[
  {
    "name":"Aidid, Abdi",
    "phone":"416-978-4150",
    "email":"a.aidid@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/abdi-aidid",
    "bio":"\nAssistant Professor\nJackman Law BuildingRoom J36478 Queen's ParkToronto, Ontario M5S 2C5\nAbdi Aidid researches and teaches in the areas of civil procedure, torts, and law & technology. He received his B.A. from the University of Toronto, his J.D. from Yale Law School and his LL.M from the Faculty of Law. Professor Aidid previously practiced litigation and arbitration at Covington & Burling LLP in New York City and most recently served as the VP, Legal Research at Blue J, where he oversaw the development of machine learning-enabled research and analytics tools. Professor Aidid is a Faculty Affiliate at the Centre for Ethics and a member of the Ethics of AI Lab. Prior to joining the Faculty of Law full-time in 2021, he served as an Adjunct Professor. He can be reached at a.aidid@utoronto.ca.\nEducationLL.M, University of TorontoJ.D., Yale Law SchoolB.A., University of Toronto",
    "keywords":" Civil Procedure; Torts; Law & Technology; Machine Learning; Ethics of AI"
  },
  {
    "name":"Alarie, Benjamin",
    "phone":"416-946-8205",
    "email":"ben.alarie@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/benjamin-alarie",
    "bio":"\nProfessor & Osler Chair in Business Law\nJackman Law BuildingRoom J36078 Queen's ParkToronto, Ontario M5S 2C5\nBenjamin Alarie, M.A. (Toronto), J.D. (Toronto), LL.M. (Yale) is an expert in tax law, judicial decision-making, machine learning, and the future of law and technology. Before joining the Faculty of Law, Professor Alarie was a graduate fellow at Yale Law School (2002-2003) and a law clerk for Madam Justice Louise Arbour at the Supreme Court of Canada (2003-2004). Over the years his publications have appeared in numerous academic journals, including the British Tax Review, the Canadian Tax Journal, and the American Business Law Journal. His research has been funded by the Social Sciences and Humanities Research Council, the Canadian Foundation for Innovation, and the Ontario Ministry of Research and Innovation. He is coauthor of several editions of Canadian Income Tax Law (LexisNexis) and was awarded the Alan Mewett QC Prize for Excellence by the JD class of 2009. He is co-author (with Andrew J. Green) of the leading study of comparative empirical supreme court decision-making practices, Cooperation and Commitment on High Courts (Oxford University Press, 2017). He is an affiliated faculty member of the Vector Institute for Artificial Intelligence and the Schwartz Reisman Institute for Technology and Society.Professor Alarie is co-founder and CEO of Blue J, a leading North American legal tech company specializing in artificial intelligence, legal prediction, and intelligent diagramming. He combines academic scholarship with legal technology through his monthly column in Tax Notes, entitled Blue J Predicts, where he analyzes recently decided and pending U.S. tax cases using machine learning. An educational Hot Docs \/ uDocs documentary, The A.I. Taxman, recounts the early Blue J story and outlines a vision of how artificial intelligence is likely to affect tax law in the coming decades.Professor Alarie is co-author (with Abdi Aidid) of The Legal Singularity: How Artificial Intelligence Can Make Law Radically Better (University of Toronto Press, 2023), available from Amazon and the University of Toronto Press. See some of the book's pre-publication press: Law360, the University of Toronto.Professor Alarie on LinkedIn, wIkipedia, Twitter, SSRN, Google Scholar.\nEducationB.A. - Wilfrid Laurier University (1999), with high distinctionM.A. - University of Toronto (2002)J.D. - University of Toronto (2002), with honoursLL.M. - Yale Law School (2003)\nAcademic appointmentsFaculty Affiliate, Vector Institute for Artificial IntelligenceFaculty Affiliate, Schwartz Reisman Institute for Technology and Society\nAwards and distinctionsAlan Mewett QC Prize for Excellence, University of Toronto Faculty of Law Students' Law Society (2009)\nOther serviceChair, Admissions Committee, Faculty of Law\nSelected publicationsThe Legal Singularity: How Artificial Intelligence Can Make Law Radically Better (University of Toronto Press, 2023), with Abdi Aidid (Amazon).\"How Artificial Intelligence will Affect the Practice of Law\" (2018) 68 University of Toronto Law Journal 106, with Anthony Niblett and Albert Yoon (JSTOR).Commitment and Cooperation on High Courts: A Cross-Country Examination of the Institutional Constraints on Judicial Decision-Making (Oxford University Press, 2017), with Andrew J. Green (OUP).\"The Path of the Law: Towards Legal Singularity\" (2016) 66(4) University of Toronto Law Journal 443 (SSRN).\"Using Machine Learning to Predict Outcomes in Tax Law\" (2016) 58(3) Canadian Business Law Journal 231, with Anthony Niblett and Albert Yoon (SSRN).\nResearch areasEconomic Analysis of LawJudicial Decision-MakingTax Law\nTwitter@BAlarie",
    "keywords":" Tax Law; Judicial Decision-Making; Machine Learning; Future of Law and Technology; Artificial Intelligence"
  },
  {
    "name":"Anand, Anita",
    "phone":"416-946-4002",
    "email":"anita.anand@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/anita-anand",
    "bio":"\nJ.R. Kimber Chair in Investor Protection and Corporate Governance & \r\nAcademic Director, Centre for the Legal Profession\r\nand Program on Ethics in Law and Business (on leave)\nJackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5\nAnita Indira Anand is currently serving as the Member of Parliament for Oakville, Ontario. She is on leave from the Faculty of Law for the duration of her appointment.Prior to assuming her role as MP, Professor Anand, a Professor of Law, held the J.R. Kimber Chair in Investor Protection and Corporate Governance. She served as Associate Dean from 2007-2009 and since 2010, served as the Academic Director of the Centre for the Legal Profession and its Program on Ethics in Law and Business. She is a Senior Fellow of Massey College and cross-appointed to the Rotman School of Management and the Munk School of Global Affairs and Public Policy. In 2019, the Royal Society of Canada awarded her the Yvain Allaire medal for her outstanding contributions in governance relating to private and public organizations.During the 2009-2010 academic year, Professor Anand was a Visiting Scholar at the Bank of Canada and a Herbert Smith Visitor at the University of Cambridge. In 2005-2006, she was a Canada-U.S. Fulbright Scholar and Visiting Olin Scholar in Law and Economics at Yale Law School. During the Fall 2005, she was a Visiting Lecturer in Law at Yale Law School where she taught comparative corporate governance. In Fall 2017, she was appointed Director of Policy and Research at the Capital Markets Institute, Rotman School of Management at the University of Toronto where she also taught in the Directors' Education Program.She is the recipient of research grants from the Social Sciences and Humanities Research Council of Canada (four awards), the Law Foundation of Ontario, the Foundation for Legal Research (three awards), the Connaught Foundation as well as the Canadian Association of Law Teachers' Scholarly Paper Award (2003).  In Fall 2004, she received the Queen's Law Students' Society Award for Excellence in Teaching and in Fall 2006, she and co-authors Frank Milne and Lynnette Purda were awarded the Best Paper in Managerial Finance by the International Journal of Managerial Finance for their empirical research relating to corporate governance. In 2015, Professor Anand was appointed by Ontario's Minister of Finance to the Expert Committee to Consider Financial Advisory and Financial Planning Policy Alternatives. She has conducted research for Ontario's Five-Year Review Committee, the federal Wise Person's Committee, the Task Force to Modernize Securities Legislation in Canada and the Commission of Inquiry into the Investigation of the Bombing of Air India Flight 182.  She was the inaugural Chair of the Ontario Securities Commission's Investor Advisory Panel (2010-2012) and the president of the Canadian Law and Economics Association (2009-2011).In 2012, she was appointed to the Bertha Wilson Honour Society by the Schulich School of Law for service to the legal profession.  She is the Editor of Canadian Law eJournal, published by the Legal Scholarship Network. She has served on the Ontario Rhodes Scholar Selection Committee and the U.S.-Canada Fulbright Committee as well as public company and non-profit boards of directors. Her main research areas relate to the regulation of capital markets with a specific focus on corporate governance, enforcement, capital raising techniques and systemic risk.Canadian Business Law BlogTwitter: @AnitaAnand2Podcast on Cooperative Securities Regulator: https:\/\/www.buzzsprout.com\/5821\/514460-anita-anand-episode-59-mp3\nSee also Professor Anand's SSRN page.\nEducationB.A. (Hons Political Studies) - Queen's University (1989)B.A. (Hons Jurisprudence) - University of Oxford (1991)LL.B. -  Dalhousie University (1992)LL.M. - University of Toronto (1996)Called to the Bar of Ontario (1994)\nAcademic appointmentsJ.R. Kimber Chair in Investor Protection and Corporate Governance (2016-2019)Director of Policy and Research, Capital Markets Institute, U of T  (2017- 2019)Cross-appointed to the Rotman School of Management (2017-present)Senior Fellow, Massey College (2012-present)Cross-appointed to the Munk School of Global Affairs and Public Policy (2009-present)Fellow-in-Residence, C.D. Howe Institute (2014-2017)Herbert Smith Visitor, University of Cambridge (2010)Visiting Scholar, Bank of Canada  (2009-2010)Visiting Olin Scholar in Law and Economics, Yale Law School (2005-2006)Visiting Lecturer in Law, Yale Law School (2005-2006)Associate Professor, Queen's Law School (2003-2006)Assistant Professor, Queen's Law School (1999-2003)Assistant Professor (adjunct), Western Law School (1997-1999)\nAwards and distinctionsRoyal Society of Canada - Yvain Allaire Medal (2019)Social Sciences and Humanities Research Council awards (2018, 2011, 2006, 2001)Law Foundation of Ontario Research Award (2016)Trailblazer Award Canadian Association of South Asian Lawyers (2013)Foundation for Legal Research award  (2012)Bertha Wilson Honour Society, Schulich School of Law (2012)Best Paper in Managerial Finance (with L. Purda and F. Milne), International Journal of Managerial Finance (2006)Canada-U.S. Fulbright Scholar Award (2005-2006)Queen’s Law Students’ Society Excellence in Teaching Award, Queen’s University (Fall 2004)Foundation for Legal Research awards (2004, 2002)Canadian Association of Law Teachers’ Scholarly Paper Award (2003)Medal in Political Studies, Queen’s University (1989)Rhodes Scholar Finalist (1988)Governor General's Medal (1985)\nOther serviceMember, Securities Advisory Committee, Ontario Securities Commission (2018-2019)Advisory Board, India Canada Association (2018-2019)Ontario Rhodes Scholarship Selection Committee (2018)Grant Review Committee, U.S.-Canada Fulbright Foundation (2017-2019)Special Advisor to the Board of FAIR Canada (2017)Member, Governing Board, Massey College (2016-2019)Member, Board of Trustees, Canadian Business Law Journal (2016-2019)Member, Province of Ontario Expert Committee to Consider Financial Advisory and Financial Planning Policy Alternatives (2015-2016)Member, National Council, C.D. Howe Institute (2014- 2019)Member, Editorial Board, Mowat Centre (2014-2019)Member, Academic Advisory Board, Can. Coalition for Good Governance (2013-2019)Inaugural Chair, Ontario Securities Commission Investor Advisory Panel (2010-2012)Researcher, Commission of Inquiry into the Investigation of the Bombing of Air India Flight 182 (2006-2007)Researcher, Task Force to Modernize Securities Legislation in Canada (2006)Researcher, Five-Year Review Committee (2001-2003)\nOther infoBoard member and Chair of Governance and Nominating Committee, Diversified Royalty Corp. (2018-2019)Board member, Economic Investment Trust Ltd. (2018-2019)Board member and Governance Committee chair, Lighthouse for Grieving Children (2017-2019)Board member and corporate secretary, Saint Mildred's-Lightbourn School (2014-2016)Board member, Oakville Hydro Electricity Distribution Inc. (2014-2016)Board member, Oakville Hospital Foundation (2013-2016)Chair and board member, Canadian Museum of Indian Civilization (2006-2007; 2012-2015)Articling Student (1992-1993) and Associate Lawyer (1994-1997 with LL.M leave), Torys LLP\nSelected publications\"An Empirical Comparison of Insider Trading Enforcement in Canada and the United States\" (2018) 57 International Review of Law and Economics 49-59 (with S. Choi, P. Puri and A. Pritchard).\"Securities Settlements as Examples of Crisis-driven Regulation\" (2018) 55 International Review of Law and Economics 41-57 (with Andrew Green).\"Governance Complexities in Firms with Dual Class Shares\" (2018) 3:3 Annals of Corporate Governance 184-275.\"Independence and Accountability in Public and Private Governance\" (2018) 61:1 Canadian Public Administration (with Lorne Sossin).“Constitutional Aspects of Commercial Law” in Peter Oliver et al The Oxford Handbook of Canadian Constitutional Law (Oxford University Press, 2017).\"An Empirical Analysis of Advance Notice Provisions in Corporate Bylaws: Evidence from Canada\" (2017) International Review of Law and Economics (with Michele Dathan).Systemic Risk, Institutional Design, and the Regulation of Financial Markets, Anita Anand, ed. (Oxford: Oxford University Press, 2016).“Diversity on Boards” (2016) 58:2 Canadian Business Law Journal 165 (with Vijay Jog).“Offloading the Burden of Being Public: An Analysis of Multi-voting Share Structures” (2016) Virginia Law and Business Review. “Shareholder Rights and Directors’ Duties in Takeover Bids” (2015) 61:1 McGill Law Journal. “Large Law Firms and Capture: Towards a Nuanced Understanding of Self-Regulation of the Legal Profession\" (2015) 92 Canadian Bar Review.“Is Crowdfunding Bad for Investors?” (2014) 55:2 Canadian Business Law Journal.“Direct Access in Ontario: A Call to Reexamine” (2014) 18:1 The Labour and Employment Law Journal 123 (with Gita Anand) “The Value of Governance” (2013) 6 Rotman International Journal of Pension Management 38-43.“Private Regulation of Insider Trading in the Shadow of Lax Public Enforcement (and a Strong Neighbor): Evidence from Canadian Firms” (2013) 3: 2 Harvard Business Law Review 215-256 (with Laura Beny).“Domestic and International Influences on Firm-level governance: Evidence from Canada” (2012) 14 American Law and Economics Review 68-110 (with Frank Milne and Lynnette Purda).“Was Magna in the Public Interest?” (2012) 49 Osgoode Hall Law Journal 311-332.“Regulating Financial Institutions: The Value of Opacity” (2012) 57:3 McGill Law Journal 399-428 (with Andrew Green). “Side-Payments, Opt-ins and Power: Creating a National Securities Regulator in Canada” (2011) 51(1) Canadian Business Law Journal 1-26 (with Andrew Green). “An Empirical Examination of the Governance Choices of Income Trusts” (2011) 8:1 Journal of Empirical Legal Studies 110-139 (with Edward Iacobucci).\nResearch areasBusiness CorporationsBusiness LawEconomic Analysis of LawSecurities Regulation\nAll Publications\nSee also Professor Anand's SSRN page.",
    "keywords":" Corporate Governance; Capital Markets Regulation; Enforcement; Systemic Risk; Capital Raising Techniques"
  },
  {
    "name":"Austin, Lisa",
    "phone":"416-946-7447",
    "email":"lisa.austin@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/lisa-austin",
    "bio":"\nProfessor, Chair in Law and Technology\nJackman Law Building 46478 Queen's Park\nLisa Austin, BA &Sc (McMaster) 1994, MA (Toronto) 1995, LLM (Toronto) (1998), PhD (Toronto) 2005, called to the Bar of Ontario in 2006, is a Professor of Law. Prior to joining the faculty, she served as law clerk to Mr. Justice Frank Iacobucci of the Supreme Court of Canada. Professor Austin received a 2017 President's Impact Award from the University of Toronto.Professor Austin is an Associate Director at the Schwartz Reisman Institute for Technology and Society, and was previously a co-founder of the IT3 Lab at the University of Toronto, which engaged in interdisciplinary research on privacy and transparency.Professor Austin's research and teaching interests include privacy law, property law, and legal theory. She is published in such journals as Legal Theory, Law and Philosophy, Theoretical Inquiries in Law, Canadian Journal of Law and Jurisprudence, and Canadian Journal of Law and Society. She is co-editor (with Dennis Klimchuk) of Private Law and the Rule of Law (Oxford University Press, 2015), in which distinguished Canadian and international scholars take on the general understanding that the rule of law is essentially only a doctrine of public law and consider whether it speaks to the nature of law more generally and thus also engages private law.Professor Austin's privacy work has been cited numerous times by Canadian courts, including the Supreme Court of Canada. She is also active in a number of public policy debates in Canada.\nSee also Professor Austin's SSRN page.\nSelected publications\"Automating Accountability? Privacy Policies, Data Transparency, and the Third Party Problem\" (with David Lie, Peter Yi Paing Sun, Wenjun Qiu) (2022) 72 UTLJ 155.“Data Trusts and the Governance of Smart Environments: Lessons from the Failure of Sidewalk Labs’ Urban Data Trust” (with David Lie), (2021) 19 Surveillance and Society 255.\"Safe Sharing Sites\" (with David Lie) 94 NYU L Rev 4 (October 2019).“Re-Reading Westin” (2019) 20 Theoretical Inquiries in Law 53.\"The Public Nature of Private Property\" in James Penner and Michael Otsuka (eds) Property Theory: Legal and Political Perspectives (2018).“Technological Tattletales and Constitutional Black Holes: Communications Intermediaries and Constitutional Constraints” (2016) 17 Theoretical Inquiries in Law 451.“Towards a Public Law of Privacy: Meeting the Big Data Challenge” (2015) 71 Supreme Court Law Review (2d) 527. Private Law and the Rule of Law (Oxford, 2014) (edited with Dennis Klimchuk)“Enough About Me: Why Privacy is About Power, Not Consent (or Harm)” in Austin Sarat, ed., A World Without Privacy?: What Can\/Should Law Do (Cambridge, 2014).“Property and the Rule of Law” (2014) 20 Legal Theory 79.“Possession and the Distractions of Philosophy” in J.E. Penner and Henry Smith, eds., Philosophical Foundations of Property Law (Oxford, 2013).\"Getting Past Privacy? Surveillance, the Charter, and the Rule of Law” (2013) 27 Canadian Journal of Law and Society 381-398“Privacy and the Question of Technology” (2003) 22 Law & Philosophy 119.\nResearch areasCharter of RightsLegal TheoryNational Security Law and Anti-Terrorism LawPrivacy LawProperty Law\nAll Publications\nSee also Professor Austin's SSRN page.\nTwitter@Lisa_M_Austin",
    "keywords":" Privacy Law; Property Law; Legal Theory; Rule of Law; Public Policy"
  },
  {
    "name":"Bédard-Rubin, Jean-Christophe",
    "phone":"",
    "email":"jc.bedardrubin@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/jean-christophe-b-dard-rubin",
    "bio":"\nAssistant Professor\n78 Queen's Park\nAssistant Professor Jean-Christophe Bédard-Rubin's work explores Canadian constitutional culture from historical and comparative perspectives. He studied law, political science, and philosophy at Université Laval, Yale University, and the University of Toronto. During his doctoral studies, Jean-Christophe was the McMurty Fellow of the Osgoode Society for Canadian Legal History and a Joseph-Armand Bombardier Scholar. He has done consultancy work on constitution-building for International IDEA and, prior to his graduate studies, he worked in litigation for the Quebec Department of Justice.Bédard-Rubin currently pursues two main research projects. The first is an intellectual history of the foundations of public law in French Canada. This project seeks to reconstruct the intellectual networks in which French Canadian public lawyers participated to excavate the transatlantic influences on the formation of Quebec’s legal syncretism. This genealogical reconstruction recovers the conceptual and theoretical innovations that allowed French Canadians to articulate a genuine theory of the state outside of the revolutionary framework. In so doing, this work sheds a different, somewhat oblique light on Canada’s constitutional experience and questions its status in comparative constitutional scholarship.The second research project investigates judicial bilingualism in Canada. Using mixed social science methods, this project explores the various empirical impacts of bilingualism on judicial behaviour, the normative significance of legal bilingualism for the authority of judicial decisions, and the ways in which language shapes the dominant conception of the judicial role in Canada’s French and English public spheres.Jean-Christophe’s work has been published in English and French in the Review of Constitutional Studies, the Canadian Journal of Law & Society, the Osgoode Hall Law Journal, the Bulletin d’histoire politique, and the International Journal of Canadian Studies, amongst others.\nResearch areasCanadian Constitutional Law",
    "keywords":" Canadian Constitutional Law; Constitutional Culture; Intellectual History; Judicial Bilingualism; Transatlantic Influences"
  },
  {
    "name":"Benson, Peter",
    "phone":"416-978-2311",
    "email":"p.benson@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/peter-benson",
    "bio":"\nProfessor\nPeter Benson joined the University of Toronto, Faculty of Law in 1998 after teaching at the McGill Faculty of Law from 1984-1998. He became a full professor in 2000. He holds law degrees from the University of Toronto and Harvard, as well as an M.Sc. in Politics from the London School of Economics and an A.B. in Sociology (magna cum laude) from Harvard. In 1983-4, Professor Benson was a law clerk to Chief Justice Bora Laskin and Justice Gerald Le Dain of the Supreme Court of Canada.His teaching and writing focus mainly on contract law, contract theory, the theory of private law, and theories of justice. He is the author of Justice in Transactions: A Theory of Contract Law (The Belknap Press of Harvard University Press, 2019) and the editor of as well as a contributor to The Theory of Contract Law: New Essays (Cambridge University Press, 2001). His work has been widely published in journals and book collections including The Oxford Handbook of Jurisprudence, The Philosophical Foundations of Tort Law, Blackwell’s A Companion to Philosophy of Law and Legal Theory, Political Theory, The Columbia Law Review, The Iowa Law Review, The Cardozo Law Review, and The Canadian Journal of Law and Jurisprudence.\nSee also Professor Benson's SSRN page.\nResearch areasContractsLegal TheoryPolitical Philosophy and Theory\nAll Publications\nSee also Professor Benson's SSRN page.",
    "keywords":" Contract law; Contract theory; Private law; Theories of justice; Jurisprudence"
  },
  {
    "name":"Borrows, John",
    "phone":"",
    "email":"j.borrows@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/john-borrows",
    "bio":"\nProfessor and Loveland Chair in Indigenous Law\nJackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5\nJohn Borrows B.A., M.A., J.D., LL.M. (Toronto), Ph.D. (Osgoode Hall Law School), LL.D. (Hons., Dalhousie, York, SFU, Queen’s & Law Society of Ontario), D.H.L, (Toronto), F.R.S.C., O.C., is the Loveland Chair in Indigenous Law at the University of Toronto Law School. His publications include, Recovering Canada; The Resurgence of Indigenous Law (Donald Smiley Award best book in Canadian Political Science, 2002), Canada's Indigenous Constitution (Canadian Law and Society Best Book Award 2011), Drawing Out Law: A Spirit's Guide (2010), Freedom and Indigenous Constitutionalism ((Donald Smiley Award best book in Canadian Political Science, 2016), The Right Relationship (with Michael Coyle, ed.), Resurgence and Reconciliation (with Michael Asch, Jim Tully, eds.), Law’s Indigenous Ethics (2020 Best subsequent Book Award from Native American and Indigenous Studies Association, 2020 W. Wes Pue Best book award from the Canadian Law and Society Association). He is the 2017 Killam Prize winner in Social Sciences and the 2019 Molson Prize Winner from the Canada Council for the Arts, the 2020 Governor General’s Innovation Award, and the 2021 Canadian Bar Association President’s Award winner.  He was appointed as an Officer of the Order of Canada in 2020. John is a member of the Chippewa of the Nawash First Nation in Ontario, Canada.\nResearch areasAboriginal Law",
    "keywords":" Aboriginal Law; Indigenous Law; Indigenous Constitutionalism; Indigenous Ethics; Canadian Law and Society"
  },
  {
    "name":"Brunnée, Jutta",
    "phone":"416-978-3718",
    "email":"deansoffice.law@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/jutta-brunn-e",
    "bio":"\nDean, University Professor & James Marshall Tory Dean’s Chair\nJackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5\nDean, University Professor & James Marshall Tory Dean’s Chair, University of Toronto. Dean Brunnée’s teaching and research interests are in the areas of Public International Law, International Environmental Law and International Legal Theory. She has published extensively in each of these areas. Her current research agenda explores the role of international legality and legal practices in mediating between stability and change in international law. Dean Brunnée is co-author of International Climate Change Law (OUP 2017), which was awarded the American Society of International Law’s 2018 Certificate of Merit “in a specialized area of international law” and was recently translated into Korean, and of Legitimacy and Legality in International Law: An Interactional Account (CUP 2010), which was awarded the American Society of International Law’s 2011 Certificate of Merit “for preeminent contribution to creative scholarship.” Dean Brunnée also is co-editor of the Oxford Handbook of International Environmental Law (Oxford University Press, 2007). In 1998-99, she was the “Scholar-in-Residence” in the Legal Bureau of the Canadian Department of Foreign Affairs and International Trade, advising, inter alia, on matters under the Biodiversity and Climate Change Conventions. From 2006 to 2016, she served on the Board of Editors of the American Journal of International Law. She was elected Fellow of the Royal Society of Canada in 2013, and Associate of the Institut de Droit International in 2017. In 2019, she delivered a course on “Procedure and Substance in International Environmental Law” at The Hague Academy of International Law,  published in the Academy's Collected Courses \/ Recueil des Cours series (2020). In 2020, Dean Brunnée was appointed University Professor, the University of Toronto’s highest and most distinguished academic rank.\nSee also Dean Brunnée's SSRN page.\nEducationDiplôme d'études françaises du 2ième degree - Université de Dijon, France (1982)Referendar Juris (First State Examination) - Rhineland Palatinate, Germany (1985)LL.M. - Dalhousie University, Halifax, Nova Scotia (1987) Doctor of Laws (summa cum laude) - Johannes Gutenberg-Universität, Mainz, Germany (1989)Assessor Juris (Second State Examination) - Ministry of Justice, Hessen, Germany (1989)\nAcademic appointmentsDean, Faculty of Law (2021)Interim Dean, Faculty of Law (2014)Adjunct Professor, New York University School of Law (2013)Associate Dean, Graduate Studies (2010-2014)Visiting Professor (Intensive Course), Institut des Hautes Etudes Internationales, Université Panthéon-Assas (Paris II) (February 16-20, 2009)Visiting Professor (Intensive Course), Faculty of Law, University of Auckland (April 4-5 and 11-13, 2007)Professor of Law, Faculty of Law (2000)\nAwards and distinctionsDelivered course at The Hague Academy of International Law (2019)Certificate of Merit “in a specialized area of international law” (American Society of International Law, 2018)Elected Associate of the Institut de Droit International (2017)Elected Fellow of the Royal Society of Canada (2013)Certificate of Merit for a Preeminent Contribution to Creative Scholarship (American Society of International Law,  2011)\nOther serviceMember, Advisory Board, Transnational Environmental Law (2020-)Co-Rapporteur, Commission on Harm Prevention Rules Applicable to the Global Commons, Institut de Droit International (2019-)Chair, Academic Advisory Board, Max-Planck-Institute for International and Foreign Public Law, Heidelberg (2019-)Member, Editorial Advisory Board, Global Constitutionalism (2010-)Member, Board of Editors, American Journal of International Law (2006-16)Member, Board of Editors, International Theory (2007-)Member, Editorial Advisory Board, Climate Law (2008-)Member, Board, European Society of International Law (2010-2014)Member, Committee on The Legal Principles relating to Climate Change, International Law Association (2009-2014)\nSelected publicationsProcedure and Substance in International Environmental Law, in Hague Academy, Collected Courses \/ Receuil des Cours Vol. 405, 75 (2020). “Limitation of the Use of Force,” in Kindred's International Law – Chiefly as Interpreted and Applied in Canada, 9th edition (Emond Montgomery, 2019), 859-942 (Chapter 11).“The Rule of International (Environmental) Law and Complex Problems,” in Heike Krieger, Georg Nolte and Andreas Zimmermann, eds., The International Rule of Law: Rise or Decline (Oxford: Oxford University Press, 2019), 211-231.“Norm Robustness and Contestation in International Law: Self-Defence against Non-State Actors,” (2019) 4\/1 Journal of Global Security Studies 73-87 [w\/ S.J. Toope].“International Law and the Practice of Legality: Stability and Change,” (2019) 49 Victoria University of Wellington Law Review 429-445 [w\/ S.J. Toope].“Community Obligations in International Environmental Law: Procedural Aspects,” in Eyal Benvenisti and Georg Nolte, eds., Community Obligations across International Law (Oxford University Press, 2018), 150-175.\"Challenging International Law: What's New?\", Keynote Address to the annual conference of the Canadian Council on International Law, Ottawa, on November 2, 2018 [for Part II, see this link; for Part III, see this link].“Völkerrechtskritik: Gestern und Heute (Critiques of International Law: Then and Now),” in Dethloff\/Nolte\/Reinisch, eds., Rückblick nach 100 Jahren und Ausblick – Migrationsbewegungen, Berichte der Deutschen Gesellschaft für Völkerrecht (Proceedings of the German Society of International Law), Volume 49 (Heidelberg: C.F. Müller Verlag, 2018) 167-191.“Self-Defence against Non-State Actors: Are Powerful States Willing but Unable to Change the Law?”(2018) 67 International & Comparative Law Quarterly 263-286 [w\/ S.J. Toope].\"Interactional Legal Theory, the International Rule of Law and Global Constitutionalism,\" in Anthony F. Lang and Antje Wiener, eds., Handbook of Global Constitutionalism (Cheltenham: Edward Elgar, 2017) 170-182.International Climate Change Law (Oxford University Press, May 2017) [Daniel Bodansky, Jutta Brunnée and Lavanya Rajamani].“The Sources of International Environmental Law: Interactional Law,” in Samantha Besson and Jean d’Aspremont, eds., The Oxford Handbook on Sources of International Law (Oxford University Press, 2017) 960-983.“The Rule of Law in an Agnostic World,” in W. Werner et al., eds., The Law of International Lawyers - Reading Martti Koskenniemi (Cambridge University Press, 2017), 137-166 [w\/ S.J. Toope]. \"Procedure and Substance in International Environmental Law: Confused at a Higher Level,\" Reflections on International Law,European Society of International Law (June 2016). “Transparency and International Environmental Institutions,”in Andrea Bianchi & Anne Peters, eds., Transparency in International Law (Cambridge University Press, 2013), 23-48 [w\/ E. Hey]. \"International Environmental Law,\" in Tony Carty, ed., Oxford Bibliographies Online: International Law - Oxford Bibliography on International Law (2013).\"Constructivism and International Law\" in Jeffrey L. Dunoff and Mark A. Pollack, eds., Interdisciplinary Perspectives on International Law and International Relations: The State of the Art (Cambridge University Press, 2012) 119-145 [w\/ S.J. Toope].Promoting Compliance in an Evolving Climate Change Regime (Cambridge: Cambridge University Press, 2012) [edited with Meinhard Doelle and Lavanya Rajamani].Legitimacy and Legality in International Law: An Interactional Account (Cambridge: Cambridge University Press, July 2010) [w\/ S.J. Toope].“Interactional International Law: An Introduction,” (2011) 3 International Theory 307-318 (introduction for book symposium on Legitimacy and Legality in International Law) [w\/ S.J. Toope].The Oxford Handbook of International Environmental Law (Oxford: Oxford University Press, 2007); edited jointly with Professors Daniel Bodansky and Ellen Hey.\nResearch areasEnvironmental LawInternational LawLegal Theory\nAll Publications\nSee also Dean Brunnée's SSRN page.\nTwitter@JuttaBrunnee",
    "keywords":" Public International Law; International Environmental Law; International Legal Theory; International Climate Change Law; Legitimacy and Legality in International Law"
  },
  {
    "name":"Chen, Li",
    "phone":"416-287-7128",
    "email":"lc.chen@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/li-chen",
    "bio":"\nAssociate Professor of History, Department of Historical and Cultural Studies and Graduate Department of History\nUTSC Department of Historical and Cultural Studies page\nLi Chen received his J.D. from University of Illinois (magna cum laude) and Ph.D. in History from Columbia University. He is an Associate Professor of Chinese History at the Department of Historical and Cultural Studies and the Graduate Department of History. Professor Chen holds a non-budgetary cross-appointment at the Faculty of Law at the rank of Associate Professor. He also holds non-budgetary appointments at the Centre for Criminology and Sociolegal Studies, the Munk School of Global Affairs, and the Department of East Asian Studies.Professor Chen’s research and teaching interests include late Imperial and modern China (15th through 20th centuries), Chinese law and society, Sino-Western relations, law and empire, history of science and biopower in jurisprudence, politics of translation, cultural encounters, international law, global history, and postcolonial studies. His book, Chinese Law in Imperial Eyes: Sovereignty, Justice, and Transcultural Politics (Columbia University Press, 2016), won the 2018 Joseph Levenson Pre-1900 Book Prize of the Association for Asian Studies and Honorable Mention for the 2017 Peter Gonville Stein Book Award of the American Society for Legal History. Professor Chen is co-editor of Chinese Law: Knowledge, Practice, and Transformation, 1530s-1950s (Brill, 2015) (with Madeleine Zelin). He is working on another SSHRC-funded book project, Invisible Power, Legal Specialists, and the Juridical Field in Late Imperial China, 1651-1911. Professor Chen is a member of the editorial board of the Law and History Review (2013-20), and founding President (2014-2017) and director of the International Society for Chinese Law and History. He also served as Associate Chair (2015-2016) and Chair of the Department of Historical and Cultural Studies (2016-2019).For more information on Professor Chen’s research, see his academia.edu page: http:\/\/utoronto.academia.edu\/LiChen\nSelected publicationsChinese Law in Imperial Eyes: Sovereignty, Justice and Transcultural Politics (Columbia University Press, 2016)Co-editor, Chinese Law: Knowledge, Practice and Transformation, 1530s-1950s (with Madeleine Zelin, Brill, 2015)“Affective Sovereignty, International Law, and China’s Legal Status in the Nineteenth Century,” in Zvi Ben-Dor Benite, Stefanos Geroulanos and Nichole Jerr, eds, The Scaffold of Sovereignty: Global and Aesthetic Perspectives on the History of a Concept (Columbia University Press, 2017)“Law, Empire, and Historiography of Modern Sino-Western Relations: A Case Study of the Lady Hughes Controversy in 1784,” Law & History Review 27.1 (2009): 1-53 (received  honorable mention for the Law and Society Association’s 2011 Article Prize, and translated into Chinese as “法律、帝国与近代中西关系历史学,” 北大法律评论 (Peking University Law Review) 12.2 (Sept. 2011): 437-81)“Universalism and Equal Sovereignty as Contested Myths of International Law in the Sino-Western Encounter,” Journal of the History of International Law13.1 (2011):75-116 (translated into Chinese by 法律史译评 (Legal History Studies: Translation and Critiques)\nResearch areasCritical Legal TheoryInternational LawLegal History",
    "keywords":" Chinese History; Chinese Law; Sino-Western Relations; Law and Empire; Global History"
  },
  {
    "name":"Chiao, Vincent",
    "phone":"416-978-4901",
    "email":"vincent.chiao@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/vincent-chiao",
    "bio":"\nAssociate Professor\nJackman Law BuildingRoom J33278 Queen's ParkToronto, Ontario M5S 2C5\nVincent Chiao, B.A. (University of Virginia), Ph.D. (Northwestern), J.D. (Harvard), researches and teaches primarily in the area of criminal law and criminal justice, with a particular interest in the philosophical examination of its doctrine and institutions. He is the author of Criminal Law in the Age of the Administrative State (Oxford University Press 2018). See also the Law & Philosophy focus area.\nSee also Professor Chiao's SSRN page.\nEducationB.A. - University of Virginia (1998)Ph.D. - Northwestern (philosophy) (2006)J.D. - Harvard Law School (2008)\nAwards and distinctionsRobina Visiting Fellow, Spring 2014Reginald F. Lewis Fellow, Harvard Law School (2008-2010)Mewett Teaching Award, 2018\nSelected publications“Realism and the rational administration of the law in Beccaria,” forthcoming in Re-Reading Beccaria, Antje du Bois-Pedain & Shachar Eldar, eds. (Cambridge 2020)“Capital Punishment and the Owl of Minerva,” in The Handbook of Applied Ethics and Criminal Law, Larry Alexander & Kim Ferzan, eds. (Palgrave 2019).“Fairness, Accountability and Transparency: Notes on Algorithmic Decision-making in Criminal Justice,”  International Journal of Law in Context 15(2) (June 2019): 126-139.“Predicting Proportionality: the Case for Algorithmic Sentencing,” Criminal Justice Ethics 37(3) (2018): 238-261 (peer reviewed).Criminal Law in the Age of the Administrative State (Oxford University Press, 2018).\"Reply to Critics,\" Jerusalem Review of Legal Studies 17(1) (2018): 158-175 - symposium issue dedicated to Criminal Law in the Age of the Administrative State.Review essay on Antony Duff, The Realm of Criminal Law (Oxford 2018), Jerusalem Review of Legal Studies 18(1) (December 2018), available at https:\/\/academic.oup.com\/jrls\/article\/18\/1\/38\/5365328.“What is the Criminal Law For?,” Law and Philosophy 2015, DOI 10.1007\/s10982-015-9247-8 (peer reviewed).\"Discretion and Domination in Criminal Procedure: Reflections on Pettit,\" Politics, Philosophy and Economics 2015, DOI 10.1177\/1470594X15599104“Mass Incarceration and the Theory of Punishment,” Criminal Law & Philosophy 2015, DOI 10.1007\/s11572-015-9378-x (peer reviewed).\nCurriculum Vitae\nResearch areasCriminal Law Criminal Procedure and EvidenceLegal TheoryPolitical Philosophy and Theory\nAll Publications\nSee also Professor Chiao's SSRN page.",
    "keywords":" Criminal Law; Criminal Justice; Philosophy; Doctrine; Institutions"
  },
  {
    "name":"Clarke, Kamari",
    "phone":"",
    "email":"kamari.clarke@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/kamari-clarke",
    "bio":"\nDistinguished Professor, Centre for Criminology & Sociolegal Studies and the Centre for Diaspora and Transnational Studies\nView Professor Clarke's Departmental Profile here\nKamari Maxine Clarke is a Distinguished Professor at the University of Toronto. For more than twenty years, she has conducted research on issues related to legal institutions, human rights and international law, religious nationalism and the politics of race and globalization. She has spent her career exploring theoretical questions concerning culture and power and detailing the relationship between new social formations and contemporary problems.  One of her key academic contributions has been to demonstrate ethnographically the ways that legal and religious knowledge regimes produce practices that travel globally. In addition to her scholarly work, she has served as a technical advisor to the African Union (AU) legal counsel and produced policy reports to help the AU navigate various international law and United Nations challenges. Clarke has published nine books (3 monographs and 6 edited volumes) with over 50 peer-refereed journal articles and book chapters.  She is the author of Affective Justice: The International Criminal Court and the Pan-Africanist Pushback (2019, Duke), Fictions of Justice (Cambridge, 2010), and Mapping Yorùbá Networks (Duke, 2004). Clarke is the recipient of the 2019 Royal Anthropological Institute’s Amaury Talbot Book Prize, as well as the 2019 finalist for the Elliot Skinner book award for her latest book, Affective Justice (Duke, 2019). She is also a recipient of a Distinguished Chair in Transnational Justice sand Socio-legal Studies and a recipient of the 2021 Guggenheim Prize for career excellence.\nAwards and distinctions2021 Guggenheim Fellowship John Simon Guggenheim Memorial Foundation\nResearch areasCritical Legal TheoryInternational LawLaw and GlobalizationLaw and Religion",
    "keywords":" Critical Legal Theory; International Law; Law and Globalization; Law and Religion; Human Rights"
  },
  {
    "name":"Cossman, Brenda",
    "phone":"416-978-8103",
    "email":"b.cossman@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/brenda-cossman",
    "bio":"\nProfessor of Law, Goodman-Schipper Chair; Chair, Research Advisory Committee\nBrenda Cossman is Professor of Law at the University of Toronto. She joined the Faculty of Law in 1999, and became a full professor in 2000. She was Director of U of T's Mark S. Bonham Centre for Sexual Diversity Studies from 2009-2018. She holds degrees in law from Harvard and the University of Toronto and an undergraduate degree from Queen's. Prior to joining the University of  Toronto, she was Associate Professor at Osgoode Hall Law School of York University.  In 2012, Professor Cossman was elected as a Fellow of the Royal Society of Canada. In 2009, she was awarded the Mundell Medal for contributions to letters and law. In 2002 and 2003, she was a Visiting Professor of Law at Harvard Law School. Professor Cossman's teaching and scholarly interests include family law, law and gender, and law and sexuality. Her most recent book The New Sex Wars: Sexual Harm in the Age of #MeToo was published by NYU Press in 2021. Her publications include Sexual Citizens: The Legal and Cultural Regulation of Sex and Belonging (Stanford University Press, 2007), the co-authored Bad Attitudes on Trial: Pornography, Feminism and the Butler Decision (University of Toronto Press) and Censorship and the Arts (published by the Ontario Association of Art Galleries).\nSee also Professor Cossman's SSRN page.\nEducationLL.M. 1988 Harvard UniversityLL.B 1986 University of TorontoB.A. Hons 1982 Queen's University\nAwards and distinctions2016 Lexpert Zenith Award for advancing diversity and inclusion in the legal profession and society2015 Ontario Bar Association Award of Excellence for the Promotion of Women’s Equality2012 The Lukwik and Estelle Jus Memorial Human Rights Prize, University of Toronto, Awards of Excellence2012 Fellow of the Royal Society of Canada2009 Mundell Medal for contribution to letters and law\nSelected publications “The 1969 Criminal Amendments: Constituting the Terms of Gay Resistance” 70(3) University of Toronto Law Journal 245 (2020).“Queering Queer Legal Studies”6(1) Critical Analysis of Law (2019). “Gender Identity, Gender Pronouns and Freedom of Expression: Bill C-16 and the Traction of Specious Legal Claims” 68 University of Toronto Law Journal 37 (2018).“Beyond “Beyond Conjugality”” with Bruce Ryder 18 Canadian Journal of Family Law (2018) “Censor, Resist, Repeat: The History of Censorship of Gay and Lesbian Sexual Representations in Canada” 21 Duke Journal of Gender, Law and Policy 45. (2014) “Anxiety Governance” 38 Law and Social Inquiry 892 (Fall 2013) “Contesting Conservatisms, Family Feuds and the Privatization of Dependency”, 13 American Journal of Gender, Social Policy and the Law 415 (2005). “Sex, Gender and Feminism After: Reading and Rereading Twyman” in GENDER, SEXUALITY, AND POWER: IS FEMINIST THEORY ENOUGH? with Dan Danielson, and Janet Halley 12 Columbia Journal of Gender and Law 601 (2004)\nResearch areasFamily LawFeminist Analysis of LawSexuality and the Law\nAll Publications\nSee also Professor Cossman's SSRN page.",
    "keywords":" Law and Gender; Law and Sexuality; Family Law; Sexual Harm; #MeToo"
  },
  {
    "name":"Cziraki, Peter",
    "phone":"416-946-3298",
    "email":"peter.cziraki@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/peter-cziraki",
    "bio":"\nAssistant Professor of Economics,\r\nAssistant Professor of Law (by courtesy)\nDepartment of Economics, Max Gluskin House, Room 209St. George Street 150M5S 3G7 Toronto, ON, Canada\nPersonal web page\nEducationPh.D. (Tilburg, 2012)\nAcademic appointments2021-2022  Cornell University, S.C. Johnson College of Business, Dyson School Visiting Assistant Professor of Finance\nAwards and distinctionsU of T Department of Economics Faculty Award for Excellence in Undergraduate Teaching, 2017. Best PhD Dissertation, Tilburg University, 2013.\nCurriculum Vitae\nResearch areasEconomic Analysis of Law\nAll Publications",
    "keywords":" Economics; Law; Research; Teaching; Max Gluskin House"
  },
  {
    "name":"Dawood, Yasmin",
    "phone":"416-946-7829",
    "email":"yasmin.dawood@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/yasmin-dawood",
    "bio":"\nProfessor of Law and Canada Research Chair in Democracy, Constitutionalism, and Electoral Law\nJackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5\nSee Professor Dawood's SSRN page\nYasmin Dawood, J.D. (Columbia), Ph.D. (Chicago), is Professor of Law and the Canada Research Chair in Democracy, Constitutionalism, and Electoral Law at the Faculty of Law, with a courtesy appointment in the Department of Political Science. She was named a member of the Royal Society of Canada College of New Scholars, Artists, and Scientists in 2018. Professor Dawood was awarded the Mewett Award for Teaching Excellence by the Graduating Class of 2020. In addition, she was a co-recipient of the 2020 Legal Excellence Award from the South Asian Bar Association.Professor Dawood specializes in election law, comparative constitutional law, and democratic theory. Her scholarship, which is broadly concerned with improving electoral fairness and democratic governance, has addressed such topics as the right to vote, money in politics, redistricting, constitutional design, political dysfunction, partisanship, corruption, and the oversight of the democratic process by the courts. Her work has been published in leading journals, including the Georgetown Law Journal, NYU Law Review Online, American Review of Political Science, Election Law Journal, ICON International Journal of Constitutional Law, Boston University Law Review, Duke Journal of Constitutional Law & Public Policy, University of Toronto Law Journal, McGill Law Journal, Osgoode Hall Law Journal, Supreme Court Law Review, and the Canadian Journal of Law and Jurisprudence, among others. Her work has also appeared in edited volumes, including The Oxford Handbook of the Canadian Constitution (Oxford University Press) and Democracy by the People: Reforming Campaign Finance in America (Cambridge University Press). She was awarded a four-year Social Sciences and Humanities Research Council (SSHRC) grant for her research on democracy and election law. Her research has been funded by the Social Sciences and Humanities Research Council, the Connaught Foundation, and the Mellon Foundation.Professor Dawood has testified as an election law expert before the Parliamentary House committee examining The Fair Elections Act Bill C-23, and before the Special Parliamentary Committee on Electoral Reform. She has been interviewed on election law issues by various media, including The New York Times, CBC News Network, CBC Radio, The Globe and Mail, National Post, CTV News, The Agenda, Power & Politics, Metro Morning, Toronto Star and The Huffington Post, among others. She regularly presents her work at national and international conferences and workshops. Professor Dawood serves as a Vice-President of the American Society for Political and Legal Philosophy (NOMOS). She is also a member of the Executive Committee of the International Association of Constitutional Law. In addition, she serves on the Advisory Board of the Asper Centre for Constitutional Rights at the Faculty of Law, University of Toronto. She is a member of the International Board of Advisors of the Federal Law Review and the Editorial Board of the University of Toronto Law Journal.Professor Dawood received a Ph.D. in political science from the University of Chicago, a J.D. from Columbia Law School, and an Honours B.A. in political science from the University of Toronto. She is admitted to the Bar of New York and she practiced law with the firm of Cleary, Gottlieb, Steen & Hamilton LLP in New York. Prior to joining the Faculty of Law in 2009, she was a SSHRC Postdoctoral Fellow at the Centre for Ethics, University of Toronto. See Prof. Dawood's profile, Department of Political Science\nDownload Professor Dawood's research from SSRN\nEducationPh.D. - Political Science, University of ChicagoM.A. - Political Science, University of Chicago J.D. - Columbia Law SchoolB.A. (Hon.) - University of Toronto\nAcademic appointmentsCanada Research Chair in Democracy, Constitutionalism, and Electoral LawAssociate Professor, Department of Political Science, University of TorontoFaculty Associate, Centre for Ethics, University of TorontoAssociate of Trinity College, University of TorontoAssistant Professor of Law (2009-2014)\nAwards and distinctionsMewett Teaching AwardRoyal Society of Canada, College of New Scholars, Artists and ScientistsCanada Research Chair Tier IISSHRC Insight Grant 2014-2018, University of TorontoConnaught New Researcher Award, University of TorontoConnaught Start-Up Award, University of TorontoSSHRC Postdoctoral Fellowship, University of ChicagoMellon Doctoral Fellowship, University of ChicagoChicago University Fellowship, University of ChicagoYoung B. Smith Prize, Columbia Law School\nSelected publicationsThe Right to Vote and Freedom of Expression in Political Process Cases Under the Charter, 100 Supreme Court Law Review 2d 105-141 (2021).*              *This article analyzes the s. 2(b) infringement in Toronto (City) v. Ontario.Protecting Elections from Disinformation: A Multifaceted Public-Private Approach to Social Media and Democratic Speech, 16 The Ohio State Technology Law Journal 639-668 (2020).Equal Participation and Campaign Finance: Comparative Perspectives, in Reforming Campaign Finance in America, Eugene Mazo & Timothy Kuhner, eds. (Cambridge University Press, forthcoming 2018).Democratic Rights, in the Oxford Handbook of Constitutional Law, Peter Oliver, Patrick Macklem & Nathalie Des Rosiers, eds. (Oxford University Press, 2017).The Process of Electoral Reform in Canada: Democratic and Constitutional Constraints, 76 Supreme Court Law Review 353-375 (2016).The Senate Reference: Constitutional Change and Democracy, 60 McGill Law Journal 737-761 (2015).Campaign Finance and American Democracy, 18 Annual Review of Political Science 1-20 (2015).Democracy Divided: Campaign Finance Regulation and the Right to Vote, 89 NYU Law Review Online 17-27 (2014).Democratic Dysfunction and Constitutional Design, 94 Boston University Law Review 913-937 (2014).Classifying Corruption, 9 Duke Journal of Constitutional Law & Public Policy 102-132 (2014).Democracy and the Right to Vote: Rethinking Democratic Rights under the Charter, 51 Osgoode Hall Law Journal 251-295 (2013).Electoral Fairness and the Law of Democracy: A Structural Rights Approach to Judicial Review, 62 University of Toronto Law Journal 499-561 (2012). Democracy and the Problem of the Partisan State, NOMOS LIV: Loyalty (Sanford Levinson, Joel Parker & Paul Woodruff, eds.) 257-291 (2013). Democracy and the Freedom of Speech: Rethinking the Conflict Between Liberty and Equality, 26 Canadian Journal of Law and Jurisprudence 293-311 (2013). Second-Best Deliberative Democracy and Election Law, 12 Election Law Journal 401-420 (2013). The Antidomination Model and the Judicial Oversight of Democracy, 96 Georgetown Law Journal 1411-1485 (2008).  The New Inequality: Constitutional Democracy and the Problem of Wealth, 67 Maryland Law Review 123-149 (2007). Democracy, Power, and the Supreme Court: Campaign Finance Reform in Comparative Context, 4 ICON International Journal of Constitutional Law 269-293 (2006).\nResearch areasCanadian Constitutional LawCharter of RightsComparative LawElection LawJudicial Decision-MakingLegal TheoryPolitical Philosophy and Theory\nAll Publications\nDownload Professor Dawood's research from SSRN\nTwitter@ProfDawood",
    "keywords":" Election Law; Constitutional Law; Democratic Theory; Comparative Constitutional Law; Money in Politics"
  },
  {
    "name":"Des Rosiers, Nathalie",
    "phone":"",
    "email":"ndesrosiers@masseycollege.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/nathalie-des-rosiers",
    "bio":"\nPrincipal, Massey College\nNathalie Des Rosiers is a lawyer, academic and former politician. She is the 6th and current Principal of Massey College at the University of Toronto. She was a member of the Legislative Assembly of Ontario representing the riding of Ottawa—Vanier from 2016 to 2019. During her tenure as a Member of Provincial Parliament, Des Rosiers served in the cabinet of Kathleen Wynne as Minister of Natural Resources and Forestry.She was born in Montreal, studied law at the Université de Montréal and received a LLM from Harvard University. Des Rosiers clerked at the Supreme Court of Canada and practised law in London, Ontario with Lerners LLP. She also was a law professor at the University of Western Ontario. She was president of the Law Commission of Canada from 2000 to 2004, Dean of Law (Civil) at University of Ottawa from 2004 -2008, Vice-President (Governance) for the University of Ottawa (2008 -2009) . Des Rosiers served as general counsel for the Canadian Civil Liberties Association (CCLA) from 2009 to 2013,[ when she returned to serve as dean of the common law section at the University of Ottawa until 2016.During the 2010 G20 Toronto summit, Des Rosiers uncovered a provision invoked by the provincial government which greatly expanded police powers near a security fence on the perimeter of the summit's location. She brought this issue to the attention of the Canadian press and ensured that CCLA volunteers monitored the Toronto police for civil liberties violations during the conference. She also helped to discourage the practice of \"carding\", where police stop people who are not suspected of any criminal activity, ask for their identification and record that information for later review.Des Rosiers was inducted into the Order of Ontario in 2012 and was inducted as a Member of the Order of Canada in 2013 for her work in civil rights and Francophone advocacy and was accepted as a Fellow of the Royal Society of Canada in 2014. She was named one of Canada's 10 \"nation builders\" by the Globe and Mail in 2014 and was named one of Canada's 25 most influential lawyers by Canadian Lawyer in 2011 and in 2012.",
    "keywords":" Civil Rights; Francophone Advocacy; Law; Governance; Carding"
  },
  {
    "name":"Drassinower, Abraham",
    "phone":"416-978-4408",
    "email":"abraham.drassinower@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/abraham-drassinower",
    "bio":"\nProfessor\nAbraham Drassinower, B.A., M.A., Ph.D., LL.B. (Toronto) is Professor at the Faculty of Law, and Chair in the Legal, Ethical and Cultural Implications of Technological Innovation. He joined the Faculty of Law in 1999, and served as Director (20006-2009) and co-Director (2012-2017) of the Centre for Innovation Law and Policy. He previously held a Postdoctoral Fellowship in the Department of Political Science at the University of Toronto (1993-1995), and lectured principally on political philosophy at York University (1993-1995) and at the University of Toronto (1995-1998).  He served as a Law Clerk to Mr. Justice John C. Major of the Supreme Court of Canada (1998-1999).Professor Drassinower's interests include property, intellectual property, legal and political philosophy, critical theory, and psychoanalysis. He has published in the areas of charitable trusts, unjust enrichment, intellectual property, and psychoanalysis and political theory.  His most recent work is What's Wrong with Copying (Cambridge: Harvard University Press, 2015). See Publisher's web page.\nSee also Professor Drassinower's SSRN page.\nResearch areasIntellectual Property LawLegal TheoryPolitical Philosophy and TheoryProperty Law\nAll Publications\nSee also Professor Drassinower's SSRN page.",
    "keywords":" Intellectual Property; Legal and Political Philosophy; Critical Theory; Psychoanalysis; Unjust Enrichment"
  },
  {
    "name":"Dubber, Markus",
    "phone":"416-946-5455",
    "email":"markus.dubber@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/markus-dubber",
    "bio":"\nProfessor, Faculty of Law & Centre for Criminology and Sociolegal Studies\nFaculty of Law78 Queen's ParkToronto, Ontario M5S 2C5Canada\nMarkus D. Dubber, B.A. (Harvard) 1988, J.D. (Stanford) 1991, is Professor, Faculty of Law & Centre for Criminology and Sociolegal Studies.Much of Markus's scholarship has focused on theoretical, comparative, and historical aspects of criminal law. He has published, as author or editor, over twenty books and eighty papers; his work has appeared in English and German, and has been translated into Arabic, Chinese, Greek, Italian, Korean, Persian, Portuguese, and Spanish, and cited across various disciplines in several other languages, including Bosnian, Croatian, Czech, Dutch, Flemish, French, Georgian, Hebrew, Hungarian, Indonesian, Italian, Norwegian, Polish, Romanian, Russian, Serbian, Slovenian, Swedish, Thai, Turkish, and Ukrainian (ssrn | Google Scholar). His books include, among others, Der doppelte Strafstaat (2022); The Oxford Handbook of Ethics of AI (with Frank Pasquale & Sunit Das) (2020); The Dual Penal State: The Crisis of Criminal Law in Comparative-Historical Perspective (2018); The Oxford Handbook of Legal History (with Christopher Tomlins) (2018); The Oxford Handbook of European Legal History (with Heikki Pihlajamäki & Mark Godfrey) (2018); Criminal Law: A Comparative Approach (with Tatjana Hörnle) (2014); The Oxford Handbook of Criminal Law (with Tatjana Hörnle) (2014); Foundational Texts in Modern Criminal Law (2014); The Sense of Justice: Empathy in Law and Punishment (2006) (available open access through Open Square @ NYU Press); The New Police Science: The Police Power in Domestic and International Governance (with Mariana Valverde) (2006); The Police Power: Patriarchy and the Foundations of American Government (2005); and Victims in the War on Crime (2002) (available open access through Open Square @ NYU Press). Journals in which his work has appeared include, among others, Stanford Law Review, Columbia Law Review, Michigan Law Review, Law & History Review, American Journal of Comparative Law, Journal of Criminal Law & Criminology, Zeitschrift für die gesamte Strafrechtswissenschaft, Kritische Vierteljahresschrift für Gesetzgebung und Rechtswissenschaft, Leiden Journal of International Law, and Journal of International Criminal Justice.From 2016-2022, Markus served as director of the University of Toronto's interdisciplinary Centre for Ethics, where he launched the Ethics of AI Lab, the Race, Ethics + Power Project, and the multimedia C4eJournal. Previously, Markus established the Buffalo Criminal Law Center at SUNY Buffalo, including the Criminal Law LL.M. Program, the Herbert Wechsler National Criminal Moot Court Competition, and the Buffalo Criminal Law Review (now New Criminal Law Review). He is also founding editor-in-chief of Ethics in Context (Oxford), Oxford Handbooks Online (Law), Critical Perspectives on Law and Crime (Stanford), and the online open-access journal Critical Analysis of Law (with Simon Stern). Other career highlights include appearing on Penelope von Schnitzel's show What in the World Do You Do?, being name dropped by Jill Lepore in the New Yorker, and hosting an academic event that featured a choir, a Poet Laureate, a printmaker, and items from the University of Toronto's Leonard Cohen collection.➤ International visitors: Over the years, I've served as academic host for junior and senior researchers in my areas of interest from various countries (including Australia, Austria, China, Finland, Germany, Israel, Italy, Japan, Poland, Singapore, Switzerland, UK, and US), who are provided with access to university resources during their research visit (library access and, if available, work space); financial support is not available. Send inquiries to markus.dubber@utoronto.ca. Projects & ResourcesEthics of AI in Context     Oxford Handbook of Ethics of AI: Online CompanionCAL     CAL Lab: Critical Analysis of Law @ UofT     CAL: An International & Interdisciplinary Law Review     CAL for Students: A Tool Kit & Read-in Group     CAL Flix: Student View-insCriminal Law     Criminal Law: A Comparative Approach     Foundational Texts in Modern Criminal Law [companion website]     An Introduction to the Model Penal Code     Oxford Handbook of Criminal Law     Criminal Law Web     Criminal Law @ UofT     Criminal Law LLM Program     Criminal Law Sciences Club     The Dual Penal State (PiPP) [https:\/\/uoft.me\/dualpenalstate]UofT     Law @ UofT: Law as a Great University Subject      Infinite Summer @ UofT Law   Course MaterialsCriminal Law     eCasebookAdministrative Law     Points of PowerCritical Perspectives on Law     ReadingsLegal Process     Annotated Outline & Syllabus\nOther infoSSRNGoogle ScholarWorldCatYouTubeTwitter\nSelected publicationsIn ProgressRecentBooks etc.Articles etc.Misc.     CAL minifesto     New Legal Science\nCurriculum Vitae\nAll Publications",
    "keywords":" Criminal Law; Comparative Law; Legal History; Ethics of AI; International Law"
  },
  {
    "name":"Dyck, Alexander",
    "phone":"416-946-0819",
    "email":"adyck@rotman.utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/alexander-dyck",
    "bio":"\nProfessor of Finance and Economic Analysis and Policy, Manulife Financial Chair in Financial Services\nRotman School webpage\nAlexander Dyck is a Professor of Finance and Economic Analysis and Policy at the Rotman School and the Manulife Financial Chair in Financial Services. He holds a non-budgetary cross-appointment at the Faculty of Law.Professor Dyck is also a board member of the Rotman International Center for Pension Management, and a Fellow at the Michael Lee-Chin Family Institute for Corporate Citizenship at the Rotman School. Previously, he was Associate Professor at the Harvard Business School. In 2009-2010, he was a visiting scholar in Finance at INSEAD. Professor Dyck teaches PhD and MBA courses in Corporate Finance, Mergers and Acquisitions and Private Equity. His research interests include corporate governance, corporate finance, corporate social responsibility, regulation and privatization, the media and financial markets, and taxation.\nSelected publications Books and ChaptersThe Bubble and the Media, in, Cornelius, Peter and Bruce Kogut (eds.), Corporate Governance and Capital Flows in a Global Economy; With Luigi Zingales; (New York: Oxford University Press, 2003).The Corporate Governance Role of the Media, in The Right to Tell: The Role of Mass Media in Development; With Luigi Zingales; (Washington: The World Bank, 2002).PapersTaxes and Corporate Policies: Evidence from a Quasi Natural Experiment; Doidge and Dyck; Journal of Finance; Issue: 70; 2015; Pages: 45-89Investor Scale and Performance in Private Equity Investments; Dyck, A., Pomorski, L.; Review of Finance; 2015; Pages: 1-26Media Versus Special Interests; Dyck, Moss and Zingales; Journal of Law and Economics; Issue: 56; 2013; Pages: 521-553The Value of Active Management: International Evidence; Dyck, A., Lins, K., Pomorski, L.; Review of Asset Pricing Studies; Issue: 3; 2013; Pages: 200-228Who Blows the Whistle on Corporate Fraud; Dyck, Morse, Zingales; Journal of Finance; Issue: Vol. 65, Nol. 6; 2010; Pages: 2213-2254Corporate Governance Role of the Media: Evidence from Russia; Alexander Dyck, Natalya Volchkova, Luigi Zingales; Journal of Finance; Issue: Vol. 63, No. 3; 2008; Pages: 1093-1136Theft and Taxes; Mihir Desai, Alexander Dyck, Luigi Zingales; Journal of Financial Economics; Issue: Vol. 84, Issue 3; 2007; Pages: 591-623Control premiums and the effectiveness of corporate governance systems; With Luigi Zingales; Finance The Bank of America Journal of Applied Corporate Finance; Issue: Vol. 16, Iss. 2-3, Spring\/Summer; 2004; Pages: 51-73Private Benefits of Control: An International Comparison; With Luigi Zingales; Journal of Finance; Issue: Vol. LIX, No. 2; 2004; Pages: 533-596Privatization, Compensation and Management Incentives: Evidence from the United Kingdom; With Michael Cragg; Journal of Law, Economics and Organization; Issue: Vol. 19, No. 1; 2003; Pages: 176-217Management Control and Privatization in the United Kingdom; With Michael Cragg; Rand Journal of Economics; Issue: Vol. 30, No. 3; 1999; Pages: 475-497Privatization in Eastern Germany: Management Selection and Economic Transition; I. J. Alexander Dyck; American Economic Review; Issue: Vol. 87, No. 4; 1997; Pages: 565-597\nResearch areasBusiness CorporationsBusiness LawPrivacy LawSecurities RegulationTax Law",
    "keywords":" Corporate Finance; Corporate Governance; Corporate Social Responsibility; Mergers and Acquisitions; Private Equity"
  },
  {
    "name":"Dyzenhaus, David",
    "phone":"416-978-6935",
    "email":"david.dyzenhaus@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/david-dyzenhaus",
    "bio":"\nUniversity Professor of Law and Philosophy and Albert Abel Chair\nJackman Law BuildingRoom J42478 Queen's ParkToronto, Ontario M5S 2C5\nDavid Dyzenhaus is a professor of Law and Philosophy at the University of Toronto,  a Fellow of the Royal Society of Canada and a Corresponding Fellow of the British Academy.  He holds the Albert Abel Chair of Law and was appointed in 2015 to the rank of University Professor. He has taught in South Africa, England, Canada, Singapore, New Zealand, Hungary, Mexico and the USA. He holds a doctorate from Oxford University and law and undergraduate degrees from the University of the Witwatersrand, South Africa. In 2002, he was the Law Foundation Visiting Fellow in the Faculty of Law, University of Auckland. In 2005-06 he was Herbert Smith Visiting Professor in the Cambridge Law Faculty and a Senior Scholar of Pembroke College, Cambridge. In 2014-15, he was the Arthur Goodhart Visiting Professor in Legal Science in Cambridge. In 2016-17, he was a Fellow of the Wissenschaftskolleg zu Berlin. In 2020-21, he was a Guggenheim Fellow and a Visiting Fellow of All Souls College, Oxford.Professor Dyzenhaus is the author of Hard Cases in Wicked Legal Systems: South African Law in the Perspective of Legal Philosophy (now in its second edition), Legality and Legitimacy: Carl Schmitt, Hans Kelsen, and Hermann Heller in Weimar, and Judging the Judges, Judging Ourselves: Truth, Reconciliation and the Apartheid Legal Order. He has edited and co-edited several collections of essays. In 2004 he gave the JC Smuts Memorial Lectures to the Faculty of Law, Cambridge University. These were published by Cambridge University Press in 2006 as The Constitution of Law: Legality in a Time of Emergency. He is editor of the University of Toronto Law Journal and co-editor of the series Cambridge Studies in Constitutional Law. His most recent book is The Long Arc of Legality: Hobbes, Kelsen, Hart (Cambridge, 2022).\nSee also Professor Dyzenhaus' SSRN page.\nEducationB.A. - University of the Witwatersrand (1977)LL.B. - University of the Witwatersrand, Faculty of Law (1979)D.Phil. - University of Oxford (1984-1988)\nAcademic appointmentsAssociate Dean of Graduate Studies, University of Toronto, Faculty of Law (2002-2010)Fellow of the Wissenschaftskolleg zu Berlin (2016-17)Global Visiting Professor, New York University Law (Fall 2008 and in 2013) Herbert Smith Visiting Fellow, University of Cambridge, Faculty of Law (2006)Visiting Scholar at Pembroke College, Cambridge (2006)Law Foundation Fellow, University of Auckland (2002)Humboldt Fellow, Faculty of Law, University of Heidelberg (1992-1993)\nAwards and distinctionsFellow of the Royal Society of Canada (1999)Corresponding Fellow of the British Academy (2021)\nOther infoEditor, Cambridge Studies in Constitutional Law, University of Toronto Law Journal\nSelected publicationsHard Cases in Wicked Legal Systems: South African Law in the Perspective of Legal Philosophy (Oxford: Clarendon Press, 1991); 2nd edition as Hard Cases in Wicked Legal Systems: Pathologies of Legality (Oxford: Oxford University Press, 2010). http:\/\/www.amazon.com\/Hard-Cases-Wicked-Legal-Systems\/dp\/0199532214\/ref=...The Constitution of Law: Legality in a Time of Emergency (Cambridge: Cambridge University Press, 2006). http:\/\/www.amazon.com\/Constitution-Law-Legality-Time-Emergency\/dp\/052167...Judging the Judges, Judging Ourselves: Truth, Reconciliation and the Apartheid Legal Order (Oxford, Hart Publishing, 1998). http:\/\/www.hartpub.co.uk\/books\/details.asp?isbn=9781841134031Legality and Legitimacy: Carl Schmitt, Hans Kelsen, and Hermann Heller in Weimar (Oxford: Clarendon Press, 1997). http:\/\/www.amazon.com\/Legality-Legitimacy-Schmitt-Kelsen-Hermann\/dp\/0198...“Emergency, Liberalism and the State” (2011) 9 Perspectives on Politics 69-79. http:\/\/www.rairo-ita.org\/action\/displayAbstract?fromPage=online&aid=8203...\nCurriculum Vitae\nResearch areasAdministrative LawComparative LawLegal TheoryMoral PhilosophyNational Security Law and Anti-Terrorism LawPolitical Philosophy and Theory\nAll Publications\nSee also Professor Dyzenhaus' SSRN page.",
    "keywords":" Law and Philosophy; Legal Theory; Constitutional Law; South African Law; Carl Schmitt"
  },
  {
    "name":"Emon, Anver",
    "phone":"416-946-0832",
    "email":"anver.emon@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/anver-emon",
    "bio":"\nProfessor of Law and History;                \r\nCanada Research Chair in Islamic Law and History;\r\nDirector, Institute of Islamic Studies\nJackman Law BuildingRoom J46678 Queen's ParkToronto, Ontario M5S 2C5  Website: www.anveremon.com\nAnver M. Emon studies pre-modern and modern Islamic legal history, the role of Shari'a both inside and outside the Muslim majority world, and the historiography of that that field of knowledge production. Since 2018, his appointment is split between the Faculty of Law and the Department of History in the Faculty of Arts and Sciences. In the Faculty of Law, he has taught torts, constitutional law, racial politics and the law, legal ethics, and statutory interpretation. In history, he teaches in the field of Islamic legal history, law and religion, and historical epistemology in Islamic studies. He was named as a 2014 Guggenheim Fellow in the field of law, a member of the College of the Royal Society of Canada and awarded its 2017 Kitty Newman Memorial Award in Philosophy, and Senior Fellow, Massey College. The recipient of numerous research grants, he recently received two grants from the Social Sciences and Humanities Research Council (SSHRC) for the projects: \"Muslims in Canada Archive\" (2020-2024) and \"On CRA Audits of Muslim-Led Faith Based Charities\" (2020-2021). In addition to publishing numerous articles, Professor Emon is the author of The 'Islamic' Deployed: The Study of Islam in Four Registers (Middle East Law and Governance, 2019), Islamic Natural Law Theories (Oxford University Press, 2010), and Religious Pluralism and Islamic Law: Dhimmis and Others in the Empire of Law (Oxford University Press, 2012), as well as the co-editor of Islamic Law and International Human Rights Law: Searching for Common Ground? (Oxford University Press, 2012).  He is the founding editor of Middle East Law and Governance: An Interdisciplinary Journal, and series editor of the Oxford Islamic Legal Studies Series.For a profile of his research, see the review in International Innovation.\nSee also Professor Emon's SSRN page.\nEducationJ.S.D. - Yale Law School (2009)Ph.D. (History) - UCLA (2005)LL.M. - Yale Law School (2004)M.A. - University of Texas, Austin (1999)J.D. - UCLA School of Law (1996)B.A. (Hon) - University of California, Berkeley (1993)\nAcademic appointmentsCross appointments: Department for the Study of Religion, Factor Inwentash Faculty of Social Work, Near and Middle East CivilizationsVisiting Scholar, Center of Theological Inquiry (2009-2010)\nAwards and distinctions• Member, College of the Royal Society of Canada• Kitty Newman Memorial Award in Philosophy (2017), Royal Society of Canada• Fellow, Guggenheim Memorial Foundation (2014-2015)• Member, Institute for Advanced Study (2014-2015)• Justice Canada: Grant for High School Curriculum on Forced Marriage, Law and Youth Agency (2014-2015)• Foundation for Legal Research, Grant for Research: \"Statutory Interpretation and the Rule of Law\" (2014-2015)• SSHRC Connection Grant: Islamic and Jewish Legal Reasoning  (2012-2013)• Connaught Summer Institute Grant (2013-2015)• SSHRC Insight Grant: Sharia and Rule of Law (2012-2017)• SSHRC Workshop Grant: Labor and Migration in the Middle East (2011-2012)• Jackman Humanities Institute Working Group Grant (2010-2011, 2011-2012, 2012-2013))• The Religion and Diversity Project MCRI Co-Investigator Grant (2010-2011)• SSHRC Standard Research Grant - Reasoning in Islamic and Jewish Law (2008-2011)• Faculty Fellow - Religion in the Public Sphere, University of Toronto (2007-2008)• Humane Studies Fellow, Institute for Humane Studies (2004-2005) • Fishbaugh\/Pollack Fellowship, Graduate Division, UCLA  (2003-2004)• Edwin W. Pauley Foundation Fellowship, Department of History, UCLA  (1999-2003)• Jan Carleton Prize for Best M.A. Thesis, Dept. of History (1999)• Foreign Language\/Area Studies Fellowship, U.S. Dept of Education (1997-1998, 1998-1999)• Phi Beta Kappa, UC Berkeley Chapter• Senior Fellow, Massey College\nOther service• General Editor, Oxford Series in Islamic Legal Studies. Oxford University Press.• Founder\/Editor-in-Chief. Middle East Law and Governance• Consultant, Hague Abduction Convention and Islamic Law, Department of Foreign Affairs, Trade and Development (Canada) (2014)• Consultant, Judicial Independence and Professionalism Project: The Maldives.        Comm. for Federal Judicial Affairs, Dept of Justice, Canada (2012-2013)• Research Leader, \"Forced Marriage High School Curriculum Project\" (2012-2014)• Co-Chair (with Mark Ellis, Exec Dir of International Bar Association). Islamic and International Law: Searching for Common Ground. Salzburg Global Seminar (Austria). November 14-19, 2010.• Editorial Board Member. Journal of Law and Religion• Faculty Fellow, International Summer School for Religion and Public Life, Bulgaria (July 2011)• Faculty Fellow, International Summer School for Religion and Public Life, Indonesia (July 2012)\nOther infoTeaching FieldsConstitutional Law, Islamic Law, Law and Religion, Legal Ethics, Racial Politics and the Law, Statutory Interpretation, TortsNews and NoteworthyFor Toronto Star coverage of Connaught Summer Institute on Islamic Studies, 2013, click here.For the high school curriculum project on \"forced marriage\", click here.For the report on the Hague Abduction Convention and Islamic Law, click hereFor Emon's essays at the Immanent Frame, click hereFor Emon's blog page at the Centre for Free Expression, click here\nSelected publicationsBooksIslamic Law and International Human Rights Law: Searching for Common Ground? Oxford: Oxford University Press, 2012 (co-editor with Mark Ellis and Benjamin Glahn).Electronic version: Islamic Law and International Human Rights Law: Searching for Common Ground? Oxford: Oxford University Press, 2012.  Oxford Scholarship Online. Oxford University Press, 2012. http:\/\/www.oxfordscholarship.com\/view\/10.1093\/acprof:oso\/9780199641444.001.0001\/acprof-9780199641444?rskey=fFabBH&result=4&q=anver emonReligious Pluralism and Islamic Law: Dhimmis and Others in the Empire of Law. Oxford: Oxford University Press, 2012.Oxford Scholarship Online BlogElectronic Version: Religious Pluralism and Islamic Law: Dhimmis and Others in the Empire of Law. Oxford: Oxford University Press, 2012. Oxford Scholarship Online. Oxford University Press, 2012. http:\/\/www.oxfordscholarship.com\/view\/10.1093\/acprof:oso\/9780199661633.001.0001\/acprof-9780199661633?rskey=fFabBH&result=2&q=anver emonIslamic Natural Law Theories. Oxford: Oxford University Press, 2010.Electronic Version: Islamic Natural Law Theories. Oxford: Oxford University Press, 2010. Oxford Scholarship Online. Oxford University Press, 2010. http:\/\/www.oxfordscholarship.com\/view\/10.1093\/acprof:oso\/9780199579006.001.0001\/acprof-9780199579006?rskey=fFabBH&result=3&q=anver emonArticles\"The 'IsIamic' Deployed: The Study of Islam in Four Registers\". Middle East Law and Governance 11 no. 3 (2019): 347-403.\"On Statutory Interpretation and the (Canadian) Rule of Law: Interpretive  Presumptions as  Boundary Setting.\" The Theory and Practice of Legislation 3, no 1 (2015): 45-89.\"The Paradox of Equality and the Politics of Difference: Gender Equality, Islamic Law and the Modern Muslim State.\" In Gender and Equality in Islamic Law: Justice and Ethics in the Islamic Legal Tradition. Eds. Ziba Mir-Hosseini, Kari Vogt, Lena Larson, and Christian Moe. 237-258. London: IB Tauris, 2013.\"The Limits of Constitutionalism in the Muslim World: History and Identity in Islamic Law.\" In Constitutional Design for Divided Societies. Ed. Sujit Choudhry. Oxford: Oxford University Press, 2008. Pp. 258-286.\"Islamic Law and the Canadian Mosaic: Politics, Jurisprudence, and Multicultural Accommodation.\" Canadian Bar Review 87, no. 2 (February 2009): 391-425.\"To Most Likely Know the Law: Objectivity, Authority and Interpretation in Islamic Law.\" Hebraic Political Studies  4, no. 4 (2009): 415-440. (view on SSRN)\"Huquq Allah and Huquq al-'Ibad: A Legal Heuristic for a Natural Rights Regime.\" Islamic Law and Society 13, no. 3 (2006): 325-391.\nCurriculum Vitae\nResearch areasCritical Legal TheoryIslamic LawJudicial Decision-MakingLaw and ReligionLegal HistoryLegal Theory\nAll Publications\nSee also Professor Emon's SSRN page.\nTwitter@anveremon",
    "keywords":" Islamic Law; Islamic Legal History; Shari'a; Historiography; Social Sciences and Humanities Research Council (SSHRC)"
  },
  {
    "name":"Essert, Christopher",
    "phone":"416-946-8382",
    "email":"chris.essert@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/christopher-essert",
    "bio":"\nAssociate Professor and Associate Dean, JD Program\nFlavelle HouseRoom FL34278 Queen's ParkToronto, Ontario M5S 2C5\nChristopher Essert, BA (McGill), JD (Toronto), LLM, JSD (Yale Law School) is Associate Professor at the Faculty of Law and the Associate Dean of the JD Program. He teaches and researches in private law, property and tort theory, and legal and political philosophy.His work has appeared in journals including Philosophy & Public Affairs, Legal Theory, Law and Philosophy, Jurisprudence, the McGill Law Journal, and the University of Toronto Law Journal. His main current research project is a book on property law and theory, defending an account of property law and its relation to equality.Professor Essert serves as a member of the International Advisory Panel for the American Law Institute’s project on the Restatement of the Law (Fourth), Property and has  participated in consultations regarding the National Housing Strategy. He is also a Faculty Affiliate at the School of Cities.Prior to joining the UofT Faculty of Law, Professor Essert was Associate Professor at the Faculty of Law at Queen’s University, and a Visiting Professor at UCLA School of Law. He also served as law clerk to Justice Michel Bastarache at the Supreme Court of Canada, and articled at Paliare Roland LLP.\nEducationJSD, Yale Law School, 2011LLM, Yale Law School, 2008JD, University of Toronto Faculty of Law, 2005BA, McGill University, 2001\nAcademic appointmentsVisiting Professor, UCLA School of Law, 2017Queen’s University Faculty of Law, 2010-2018\nSelected publications“Thinking Like a Private Lawyer” 68 University of Toronto Law Journal166 (2018)“Property and Homelessness” 44 Philosophy and Public Affairs 266 (2016)“Nuisance and the Normative Boundaries of Ownership” 52 Tulsa Law Review 85 (2016)“Legal Powers in Private Law” 21 Legal Theory 136 (2015)“Property in Licenses and the Law of Things” 59 McGill Law Journal 559 (2014)\nCurriculum Vitae\nResearch areasEquality and Anti-Discrimination LawIntellectual Property LawLegal TheoryPolitical Philosophy and TheoryProperty LawTort Law and Tort Theory\nAll Publications",
    "keywords":" Private Law; Property Law; Tort Theory; Legal and Political Philosophy; Equality"
  },
  {
    "name":"Fadel, Mohammad",
    "phone":"416-946-0589",
    "email":"mohammad.fadel@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/mohammad-fadel",
    "bio":"\nFull Professor & Former Canada Research Chair for the Law and Economics of Islamic Law (2006-16)\nJackman Law BuildingRoom J48478 Queen's ParkToronto, Ontario M5S 2C5\nMohammad H. Fadel is a Full Professor at the Faculty of Law, which he joined in January 2006. Professor Fadel wrote his Ph.D. dissertation on legal process in medieval Islamic law while at the University of Chicago and received his JD from the University of Virginia School of Law. Professor Fadel was admitted to the Bar of New York in 2000 and practiced law with the firm of Sullivan & Cromwell LLP in New York, New York, where he worked on a wide variety of corporate finance transactions and securities-related regulatory investigations. Professor Fadel also served as a law clerk to the Honorable Paul V. Niemeyer of the United States Court of Appeals for the 4th Circuit and the Honorable Anthony A. Alaimo of the United States District Court for the Southern District of Georgia. Professor Fadel has published numerous articles in Islamic legal history and Islam and liberalism.\nSee also Professor Fadel's SSRN page.\nEducationB.A. - University of Virginia (1988)Ph.D. - University of Chicago (1995) J.D. - University of Virginia (1999)\nAcademic appointmentsCross-appointed in the Department of Religion and the Department of Near and Middle Eastern Civilizations\nAwards and distinctionsCanada Research Chair (2006, 2011)\nSelected publications\"Muslim Modernism, Islamic Law, and the Universality of Human Rights\", 36 Emory Int'l L. Rev. 713 (2022).“DNA Evidence and the Islamic Law of Paternity in Light of Maqāṣid  al- Sharīʿa” , The Muslim World, Special Issue: Family Structure in the wake of Genetic and Reproductive Technologies in the Muslim World, Vol. 112, Issue 3, Summer 2022, pp. 311-323.\"The Challenges of Islamic Law Adjudication in Public Reason\", in S. Langvatn, M. Kumm, & W. Sadurski (Eds.), Public Reason and Courts (Studies on International Courts and Tribunals, pp. 115-142). Cambridge: Cambridge University Press, 2020. doi:10.1017\/9781108766579.006.\"The True, the Good and the Reasonable: The Theological and Ethical Roots of Public Reason in Islamic Law\" (2008) 21:1 Canadian Journal of Law and Jurisprudence 5.\"Public Reason as a Strategy for Principled Reconciliation: The Case of Islamic Law and International Human Rights\" 8(1) Chicago Journal of International Law 1 (Summer 2007).\"Back to the Future: The paradoxical Revival of Aspirations for an Islamic State,\" 14(1) Review of Constitutional Studies (2009).\"Political Liberalism, Islamic Family Law and Family Law Pluralism: Lessons from New York on Family Law Arbitration,\" in Marriage and Divorce in a Multi-Cultural Context: Reconsidering the Boundaries of Civil Law and Religion, ed. Joel Nichols, (Cambridge: Cambridge University Press, 2011).\"Muslim Reformists, Female Citizenship and the Public Accommodation of Islam in Liberal Democracy,\" Politics and Religion, 5 (2012), 2–35. (link to Journal)\nCurriculum Vitae\nResearch areasBusiness CorporationsEconomic Analysis of LawFamily LawInternational LawIslamic LawLaw and GlobalizationPolitical Philosophy and TheorySecurities Regulation\nAll Publications\nSee also Professor Fadel's SSRN page.",
    "keywords":" Islamic Law; Law and Economics; Legal Process; Islamic Legal History; Islam and Liberalism"
  },
  {
    "name":"Fernandez, Angela",
    "phone":"416-946-8208",
    "email":"angela.fernandez@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/angela-fernandez",
    "bio":"\nProfessor\nJackman Law BuildingRoom J45878 Queen's ParkToronto, Ontario M5S 2C5\nAngela Fernandez is a Full Professor at the Faculty of Law at the University of Toronto with a cross-appointment in the Department of History. Her research focuses on a particular style of legal history called \"legal archaeology,\" including a book-length study on an (in)famous first possession property case involving a fox: Pierson v. Post, the Hunt for the Fox: Law and Professionalization in American Legal Culture (Cambridge University Press, 2018).Professor Fernandez is very interested in animals and the law. She is a member of the Scholars Committee of the Brooks Institute for Animal Rights, Law & Policy and the collaborative research network BASAN (Brooks Animal Studies Academic Network). She sits on the Board of Advisors and is a Director of Animal Justice Canada. She is also a fellow with the Oxford Centre for Animal Ethics.In addition to \"Animals and the Law\" (taught in the Fall of 2021 and 2022) and her legal history seminar (\"Legal Archaeology: Studies of Cases in Context\"), Professor Fernandez teaches Contracts. She is also the Chair of the Directed Research Program and is interested in supervising students on animal law and legal history topics. Professor Fernandez is the inaugural scholar in the \"Brooks U\" series, \"Fundamentals of Animal Law,\" where you can find a copy of her paper \"Animals as Property, Quasi-Property or Quasi-Person\" and an accompanying video. She can also be seen speaking about this topic at a public lecture at New York University, Yale Law School's Law, Ethics and Animals Program (LEAP), and the Cambridge Centre for Animal Rights Law series Talking Animals, Law & Philosophy. All videos are available on the Faculty of Law Youtube Animal Law Playlist.\nEducationJ.S.D. - Yale Law School (2007)LL.M. - Yale Law School (2002)LL.B. & B.C.L. - National Program, McGill University (2000) M.A. - Philosophy, Queen’s University (1996) B.A. - Philosophy, McGill University (1995)\nAcademic appointmentsProfessor, Faculty of Law University of Toronto (2020 -- Present)Cross-Appointment (Non-Budgetary) to the Graduate Department of History, Faculty of Arts and Sciences, University of Toronto (2015 -- Present)Associate Professor, Faculty of Law University of Toronto (2009 -- 2020)Assistant Professor, Faculty of Law, University of Toronto (2004-2009)Clerk to Justice Michel Bastarache, Supreme Court of Canada (2000-2001).\nAwards and distinctionsUniversity of Toronto, Faculty of Law, Truth & Reconciliation Teaching Award 2021International Society for Animal Rights (ISAR) Seeds Award 2020\nOther infoUnder Professor Fernandez's leadership, the University of Toronto is partnering with the Brooks Institute of Animal Rights, Law and Policy to publish the Canadian Animal Law Digest, a free twice-a-month update on developments in Canadian animal law. To subscribe to the Digest and get each issue delivered to your inbox, enter your information and scroll down to the Canadian flag at the bottom of this page. Professor Fernandez also works with the Bora Laskin Law Library on updating the Animal Law Research Guide, launched in March 2022. It consists of lists of sources (books, chapters, book reviews, theses, journal articles, legislation, and leading cases) in Canadian animal law, perfect for students looking for a research paper topic or for more senior scholars looking for orientation in terms of sources available in Canadian animal law.The Faculty of Law's Animal Law Research Associate is Krystal-Anne Roussel (krystal.roussel@utoronto.ca). Krystal works with Professor Fernandez on the Digest, the Research Guide, and other animal law-related projects at the Faculty of Law. To learn more about those activities, check out the Faculty of Law's Animal Law Focus Area page.Please contact Professor Fernandez if you are interested in joining the Working Group in Animals in the Law and Humanities, which meets monthly (virtually) to discuss a draft work-in-progress and provide feedback to the author\/presenter on that draft.\nSelected publicationsPierson v. Post, the Hunt for the Fox: Law and Professionalization in American Legal Culture (Cambridge: Cambridge University Press, 2018)“Pierson v. Post, Justice Angela Fernandez, Dissenting” in Eloisa C. Rodriguez-Dod and Elena Maria Marty-Nelson eds., Feminist Judgments: Rewritten Property Opinions (Cambridge: Cambridge University Press, 2022), 98-118\"Fish Farms in Canada: Where is the Law?\" in in James Gacek & Richard Jochelson eds., Green Criminology and the Law (New York: Palgrave Macmillan, 2022), 113-45“Not Quite Property, Not Quite Persons: A ‘Quasi’ Approach for Nonhuman Animals,” 5 Canadian Journal of Comparative and Contemporary Law (2019): 155-232Brooks U – Animal Law Fundamentals – “Animals as Property, Quasi-Property or Quasi-Person” (documentary and working paper posted December 2021)\"What Happy the Elephant's Legal Case Tells Us About the Future of Animal Rights\" (co-authored with Justin Marceau) Slate (magazine) (17 June 2022)\nResearch areasAnimal LawCritical Legal TheoryLaw and LiteratureLegal HistoryLegal Theory\nAll Publications",
    "keywords":" Legal History; Animals and the Law; Property Law; Animal Rights; Legal Archaeology"
  },
  {
    "name":"Green, Andrew",
    "phone":"416-946-8333",
    "email":"a.green@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/andrew-green",
    "bio":"\nProfessor, Metcalf Chair in Environmental Law\nFlavelle HouseRoom FL 34278 Queen's ParkToronto, Ontario M5S 2C5\nProfessor Green is Professor and Metcalf Chair in Environmental Law at the University of Toronto, Faculty of Law.  He teaches environmental law, climate change law, administrative law, natural resources law, judicial decision-making and international trade.  Andrew writes in the areas of domestic environmental law including Canadian climate change law and policy, administrative law, judicial decision-making (including empirical work on how judges make decisions) and international trade (how trade rules interact with domestic environmental law).  His books include Picking up the Slack: Law, Institutions and Canadian Climate Policy (University of Toronto Press, 2022), Commitment and Cooperation on High Courts: A Cross-Country Examination of Institutional Constraints on Judicial Decision-making (with Ben Alarie) (Oxford University Press, 2017), Reconciling Trade and Climate: How the WTO Can Help Address Climate Change (with Tracey Epps) (Edward Elgar, 2010) and A Globally Integrated Climate Policy for Canada (University of Toronto Press, 2008) (with Jutta Brunneé, Steven Bernstein and David Duff).  Andrew is currently co-President of the Society for Empirical Legal Studies.  He is past President of the Canadian Law and Economics Association and former Associate Dean at the Faculty of Law.  He was a Chair of the University of Toronto Academic Appeals Committee between 2009 and 2018.Prior to joining the Faculty of Law, Andrew practiced environmental law in Toronto for six years.  His practice encompassed both litigation (including prosecutions, administrative appeals and civil actions) and transactional work.\nSee also Professor Green's SSRN page.\nEducationB.A. (Hon) - Queen’s University (1987)M.A. (Econ) - University of Toronto (1988)LL.B. (Hon) - University of Toronto (1992)LL.M. - University of Chicago (1994)J.S.D. - University of Chicago (1997)\nSelected publications\"How Important are the Groundbreaking Cases in Administrative Law?” (forthcoming) University of Toronto Law Journal\"Commitment and Cooperation on High Courts: A Cross-Country Examination of Institutional Constraints on Judges\" (with Ben Alarie) (forthcoming 2017) Oxford University Press. “An Enormous Systemic Problem: Delegation, Responsibility and Federal Environmental Law” (2016) 28(2) Journal of Environmental Law and Practice 155\"Panel Selection on High Courts” (with Ben Alarie and Ed Iacobucci) (2015) 65(4) University of Toronto Law Journal 335“Policy Preferences and Expertise In Canadian Tax Adjudication” (with Ben Alarie) (2014) 62(4) Canadian Tax Journal 985“Can There Be Too Much Context In Administrative Law? Setting the Standard of Review in Canadian Administrative Law” (2014) 47(2) University of British Columbia Law Review 443Reconciling Trade and Climate: How the WTO Can Help Address Climate Change (with Tracey Epps) (Cheltenham, UK: Edward Elgar, 2010).\nResearch areasAdministrative LawEconomic Analysis of LawEnvironmental LawInternational LawInternational Trade LawJudicial Decision-Making\nAll Publications\nSee also Professor Green's SSRN page.",
    "keywords":" Environmental Law; Climate Change Law; Administrative Law; Judicial Decision-Making; International Trade"
  },
  {
    "name":"Hadfield, Gillian",
    "phone":"416-978-4214",
    "email":"g.hadfield@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/gillian-hadfield",
    "bio":"\nSchwartz Reisman Chair in Technology and Society, Professor of Law and Professor of Strategic Management. CIFAR AI Chair. Director, Schwartz Reisman Institute for Technology and Society\nJackman Law Building, room J44078 Queen's ParkToronto, Ontario M5S 2C5\nPersonal website\nGillian Hadfield is the inaugural Schwartz Reisman Chair in Technology and Society, Professor of Law, Professor of Strategic Management at the University of Toronto and holds a CIFAR AI Chair at the Vector Institute for Artificial Intelligence. She is also the inaugural Director of the Schwartz Reisman Institute for Technology and Society. Her research is focused on innovative design for legal and dispute resolution systems in advanced and developing market economies; governance for artificial intelligence (AI); and computational models of human and machine normative systems.  She has also long studied the markets for law, lawyers, and dispute resolution; and contract law and theory. She teaches Contracts and Governance of AI.Prior to rejoining the University of Toronto in 2018, Professor Hadfield was the Richard L. and Antoinette Schamoi Kirtland Professor of Law and Professor of Economics at the University of Southern California from 2001 to 2018.  She began her teaching career at the University of California Berkeley and was previously on the University of Toronto Faculty of Law from 1995-2000. Her book Rules for a Flat World: Why Humans Invented Law and How to Reinvent It for a Complex Global Economy was published by Oxford University Press in 2017 and in paperback with an updated prologue focused on AI in 2020.Professor Hadfield served as clerk to Chief Judge Patricia Wald on the U.S. Court of Appeals, D.C. Circuit.  She was the Daniel R. Fischel and Sylvia M. Neil Distinguished Visiting Professor of Law at the University of Chicago (Fall 2016), the Eli Goldston Visiting Professor (Spring 2012) and the Sidley Austin Visiting Professor (Winter 2010) at Harvard Law School, and the Justin W. D'Atri Visiting Professor of Law, Business and Society at Columbia Law School (Fall 2008.) She was a 2022 Fellow at the Rockefeller Foundation's Bellagio Center in 2022, 2006-07 and 2010-11 fellow of the Center for Advanced Study in the Behavioral Sciences and a National Fellow at the Hoover Institution in 1993. She also has held Olin Fellowships at Columbia Law School, Cornell Law School, and USC. She is president of the Society for Institutional and Organizational Economics, past president of the Canadian Law and Economics Association, a former director of the American Law and Economics Association and the Society for Institutional and Organizational Economics and a member of the American Law Institute.  She has served on the editorial boards for the Annual Review of Law and Social Science, Law and Social Inquiry and the University of Toronto Law Journal and is a founding trustee of the Cooperative AI Foundation.Professor Hadfield is a Senior Policy Advisor for OpenAI in San Francisco, and an advisor to courts and several organizations and technology companies engaged in innovating new ways to make law and policy smarter, more accessible, and more responsive to technology and artificial intelligence, including the Hague Institute for Innovation of Law, LegalZoom, and Responsive Law. She was a member of the World Economic Forum’s Future Council for Agile Governance and co-curated their Transformation Map for Justice and Legal Infrastructure; she previously served on the Forum’s Future Council for Technology, Values and Policy and Global Agenda Council for Justice; and was a member of the American Bar Association’s Commission on the Future of Legal Education,\nBepress\nEducationPh.D. (Economics) – Stanford UniversityM.A. (Economics) – Stanford UniversityJ.D. – Stanford Law School B.A. (Hons.) (Economics) – Queen’s University\nAcademic appointmentsProfessor of Strategic Management, Rotman School of Management Canada CIFAR AI Chair, Vector Institute for Artificial IntelligenceFaculty Affiliate, Center for Human-Compatible AI at the University of California, BerkeleySchwartz Reisman Chair in Technology and Society\nAwards and distinctionsCanada CIFAR AI Chair (2022-2026)Mundell Medal for Excellence in Legal Writing (2019)Member, American Law InstituteMember, Order of the CoifPhi Kappa Phi Faculty Recognition Award (2018)Fellow, Center for Advanced Study in the Behavioral Sciences at Stanford (2006-2007, 2010-2011)Olin Fellow in Law and Economics, University of Southern California Law School (2000-2001)Olin Fellow in Law and Economics, Cornell Law School (1999-2000)National First Prize, Nathan Burkan Memorial Competition (1988)New Directions Mellon Fellowship (1986)\nSelected publications\"Legal Markets\" Journal of Economic Literature (2022)\"Spurious normativity improves the capacity of agents to learn stable enforcement and compliance behaviors” (with Raphael Koster, Dylan Hadfield-Menell, Richard Everett, Laura Weidinger and Joel Z Leibo) PNAS (2022)\"A Positive Theory of the Rule of Law” (with Jens Meierhenrich and Barry R. Weingast) in Meierhenrich, J. and Loughlin, M. The Cambridge Companion to the Rule of Law (2022)“Cooperative AI: machines must learn to find common ground” (with Allan Dafoe, Yoram Bachrach, Eric Horvitz, Kate Larson and Thore Graepel) Nature (2021)“Incomplete Contracts and the AI Alignment Problem” (with Dylan Hadfield-Menell) Proceedings of the AAAI\/ACM Conference on AI Ethics and Society (2019)“Legible Normativity for AI Alignment: The Value of Silly Rules” (with Dylan Hadfield-Menell and McKane Andrus) Proceedings of the AAAI\/ ACM Conference on AI Ethics and Society (2019)“Is Rule of Law an Equilibrium Without Private Ordering?” (with Barry Weingast) in Jack Knight and Melissa Schwartz (eds.) Privatization: NOMOS LX, (NYU Press, 2018).Rules for a Flat World: Why Humans Invented Law and How to Reinvent It for a Complex Global Economy (Oxford University Press, 2017).“Scaffolding:  Using Formal Contracts to Build Informal Relations to Support Innovation.” (with Iva Bozovic) Wisconsin Law Review Vol. 2016, pp. 981-1032“How to Regulate Legal Services to Promote Access, Innovation, and the Quality of Lawyering.” (with Deborah Rhode). (2016) Hastings Law Journal Vol 67, pp. 1191-1223.“Life in the Law-Thick World:  The Legal Resource Landscape for Ordinary Americans.” (with Jamie Heine).  In S. Estreicher and J Radice (eds.) Beyond Elite Law:  Access to Civil Justice in America (Cambridge:  Cambridge University Press, 2016).\nCurriculum Vitae\nResearch areasContractsEconomic Analysis of LawLaw and GlobalizationLaw and International Development\nAll Publications\nBepress\nTwitter@ghadfield",
    "keywords":" Artificial Intelligence; Governance; Dispute Resolution; Contract Law; Legal Systems"
  },
  {
    "name":"Hirschl, Ran",
    "phone":"416-978-5304",
    "email":"ran.hirschl@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/ran-hirschl",
    "bio":"\nProfessor of Political Science and Law\nSidney Smith HallRoom 3125100 St. George StreetToronto, Ontario\nRan Hirschl (PhD, Yale) is Professor of Political Science and Law, and a Fellow of the Royal Society of Canada. His research interests focus on comparative public law, and in particular the intersection of comparative politics and comparative constitutionalism. He is the author of four books: City, State: Constitutionalism and the Megacity (Oxford University Press, 2020)—winner of the 2021 Stein Rokkan Prize in Comparative Social Science Research; Comparative Matters: The Renaissance of Comparative Constitutional Law (Oxford University Press, 2014 & 2016)—winner of the 2015 APSA C. Herman Pritchett Award for the best book on law & courts; Constitutional Theocracy (Harvard University Press, 2010)—winner of the 2011 Mahoney Prize in Legal Theory; and Towards Juristocracy: The Origins and Consequences of the New Constitutionalism (Harvard University Press, 2004 & 2007)—winner of the 2021 APSA Law & Courts Section Lasting Contribution Award, as well as over one hundred articles and book chapters on comparative constitutionalism and judicial review, public law, the judicialization of politics, constitutional law and religion, and the intellectual history of comparative constitutional inquiry published in scholarly venues such as Comparative Politics, Law & Social Inquiry, Political Theory, Human Rights Quarterly, Constellations, Annual Review of Political Science, the Oxford Handbook of Law & Politics, the Journal of Political Philosophy, Annual Review of Law & Social Science, Revue Francaise de Science Politique, International Journal of Constitutional Law, Harvard International Law Review, Texas Law Review, University of Chicago Law Review, and the American Journal of Comparative Law. Professor Hirschl has been a Fellow at Stanford University’s Center for Advanced Study in the Behavioral Sciences, Maimonides Fellow at the Institute for the Advanced Study of Law and Justice (NYU), a Fulbright Fellow at Yale, and a Fellow at Princeton University’s Program in Law and Public Affairs. He served as distinguished visiting professor of law at the National University of Singapore (NUS), Harvard Law School and NYU Law School. From 2006 to 2016 he held the Tier I Canada Research Chair in Constitutionalism, Democracy and Development. In 2010, he received a University of Toronto award for outstanding teaching, and delivered the Annual Lecture in Law and Society at Oxford University. In 2012, he was awarded a Killam Research Fellowship—one of Canada’s most prestigious research awards—by the Canada Council for the Arts, and delivered the Annual Julius Stone Address at the University of Sydney. From 2015 to 2018, he served as co-president of the International Society of Public Law, and has been an editorial board member of several leading journals, as well as the co-editor of a book series on comparative constitutional law and policy published by Cambridge University Press. In 2016, he was awarded a prestigious five-year Alexander von Humboldt International Research Award, to be hosted by the University of Göttingen. In 2018, he was granted a three-year Max Planck Fellow award in comparative constitutionalism. His work on the intersection of public law and comparative politics has been translated into various languages, discussed in numerous scholarly fora, cited in high court decisions (most recently by the Supreme Court of Canada in November 2020), and addressed in media venues from the New York Times to the Jerusalem Post.\nSee also Professor Hirschl's SSRN page.\nEducationPh.D. (With Distinction) - Yale University (1999)M.Phil (High Honors) - Yale University (1996)M.A. (Summa Cum Laude) - Tel-Aviv University (1993)LL.B. - Tel-Aviv University (1992)B.A. (Magna Cum Laude) - Tel-Aviv University (1989)\nAcademic appointments* Alexander von Humboldt Professor of Comparative Constitutionalism (2016-2021)* Max Planck Fellow in Comparative Constitutionalism (2018-2021) * Kwa Geok Choo Dinstinguished Visitor, National University of Singapore (2019)* Canada Research Chair (Tier I) (2006-2016) * Professor of Political Science & Law (2006-present)* Maimonides Fellow, Institute for Advanced Study of Law & Justice, NYU (2011-2012)* Global Visiting Faculty, NYU School of Law (2010-present)* Jeremiah Smith Jr. Visiting Professor of Law, Harvard Law School (2007-2008)* Fellow, Center for Advanced Study in the Behavioral Sciences, Stanford (2006-2007) * Associate Chair & Director of Undergraduate Studies, Political Science (2004-2006)* Associate Professor of Political Science & Law (2003-2006)* Fellow, Program in Law & Public Affairs, Princeton University (2002-2003)* Assistant Professor of Political Science (1999-2003)\nAwards and distinctions* Stein Rokkan Prize for comparative social science research (2021)* Max Planck Fellow in Comparative Constitutionalism (2018)* Alexander von Humboldt International Research Award (2016)* C. Herman Pritchett Award for Best Book on Law & Courts (2015)* Fellow, Royal Society of Canada (2014-present)* Killam Research Fellowship, Canada Council for the Arts (2012-2014)* Canada Research Chair (Tier I) (2006-2016)* Julius Stone Address, University of Sydney (2012)* Mahoney Prize in Legal Theory (2011)* Outstanding Teaching Award, University of Toronto (2010)* Annual Lecture in Law & Society, Oxford University (2010)* SSHRC Standard Research Grant (ranked 1st in country) 2002-2006* Connaught Fellowship (2002)\nOther service* Co-President, International Society of Public Law (2015-2018)* Member, Canada Research Chairs College of Reviewers* Co-Editor, Comparative Constitutional Law & Policy, Book Series, Cambridge University Press* Editorial Board Member, I-CON International Journal of Constitutional Law* Editorial Board Member, Journal of Law & Courts * Editorial Board Member, Journal of Church and State* Editorial Board, Journal of Constitutional Studies * Executive Board Member, Toronto Initiative for Economic and Social Rights* Section Convener, International Association of Constitutional Law World Congress 2010\nOther infoKeynote addresses, invited talks and research presentationsAmerican Association of Law Schools (2014 plenary panel); American Association of Comparative Law (2012 plenary panel; 2020); American Political Science Association Annual Meeting (1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005 plenary panel, 2007, 2009, 2011 plenary panel, 2012, 2015, 2016, 2018, 2019 plenary panel, 2021, 2022 plenary panel); Asper Centre for Constitutional Rights, Toronto (2020); Association of Israel Studies Annual Meeting (1998; 2010 Law & Constitution Section Chair); Association for the Study of Nationalities (2019); Baylor University (Miller Annual Lecture 2012); Boston College (Clough Center for Constitutional Democracy, Keynote Address 2014; 2016); Boston University (School of Law 2008, 2013, 2015 Book Symposium); Canadian Political Science Association Annual Meeting (2005, 2010 plenary panel, 2021 plenary panel); College of Law & Business, Israel (2014, 2015); Central European University (2021); Columbia University (School of Law 2013); European University Institute, Florence (keynote address, 2011; 2014); Federal University of Rio de Janeiro, Brazil (2013); Fordham University (School of Law 2006); Georgetown University (2010; 2017); George Washington University (2010, 2011, 2012, 2014); Harvard University (Harvard Law School 2008; Islamic Legal Studies Program 2008); Hertie School of Governance, Berlin (2014); Humboldt University, Berlin (keynote address, 2016; keynote address 2022); ICON-S Brazil (2020); IDEA International, The Hague (keynote address, 2018); Indiana University, Bloomington (School of Law 2003, 2011, 2012); Institute for Advanced Study (Wissenschaftskolleg), Berlin (2010); International Political Science Association World Congress (2000, 2006); International Political Science Association (Hannover, Germany, 2017); International Association of Constitutional Law World Congress (2010 workshop convener); International Society of Public Law Annual Meeting (2014 plenary panel; 2015 plenary panel; 2016; 2017 plenary panel; 2018, 2019, 2021); Johns Hopkins University (Department of Political Science, 2005); Law & Society Association Annual Meeting (2002, 2004, 2010, 2013 plenary panel, 2018); Max Planck Institute for the Study of Religious and Ethnic Diversity, Göttingen, Germany (2012, 2016, 2017, 2018); Max Planck Institute for Comparative Public Law and International Law, Heidelberg, Germany (2013); Midwest Political Science Association Annual Meeting (2004, 2007, 2011, 2012); National University of Singapore (Kwa Geok Choo Dinstinguished Visitor 2019, CALS 2020); New England Political Science Association Annual Meeting (2005); New School for Social Research, New York (2011); New York University (School of Law 2004, 2011, 2013; Institute for Advanced Study of Law & Justice 2011, 2012, 2013); Northwestern University (Faculty of Law 2016); Oxford University (2010 Annual Lecture in Law & Society); Princeton University (Center for Human Values 2008; Program in Law and Public Affairs 2003); Stanford University (Center for Advanced Study in the Behavioral Sciences 2006; Law School 2007); Suffolk University (Law School, 2008); Turkish Bar Association, Ankara (2004); Universidad del Desarrollo, Santiago de Chile (2019); Universidad Nacional Autónoma de México, UNAM, Mexico City (2010); Université Paris 1, Panthéon Sorbonne, France (2013); University of Bergen (2022); University of British Columbia (2006, 2021); University of California, Berkeley (Jurisprudence and Social Policy Program 2008, 2009); University of Chicago (Law School 2010, 2013; 2017); University of Copenhagen (2020); University of Göttingen (2017; 2019); University of Hamburg, Germany (2018); University of Hong Kong (2011, 2017, 2020); University of Illinois at Urbana-Champaign (College of Law 2003); University of London (King's College, Institute for Advanced Legal Studies, 2009); University of Maryland (Department of Government 2000, 2002; School of Law at 2006, 2009; 2016, 2021); University of Melbourne (2019; 2020 IACL book panel); University of Milan (2016, 2018, 2019); University of Munich [LMU] (2017); University of New South Wales (distinguished visitor, 2017, 2021); University of Ottawa (keynote address, 2015); University of Southern California (distinguished visitor, Gould School of Law 2008); University of Sydney (Annual Julius Stone Address, 2012); University of Texas at Austin (Department of Government 2007, 2012, 2014; School of Law 2004, 2009, 2015, 2019, 2020); University of Turku, Finland (keynote address, 2009); University of Utrecht, the Netherlands (2018); University of Virginia (2013); University of Western Ontario (2010, 2014); University of Washington (Comparative Law & Society Studies Center 2012); Volkswagen Foundation, Hannover, Germany (2015); William and Mary (School of Law 2006, 2007); Yale University (Center for Area and International Studies 2006; Yale Law School 2012; 2016, 2022); Yeshiva University (Cardozo Law School 2009, 2012); York University (2008, 2010, 2011, 2013).\nSelected publicationsRan Hirschl, City, State: Constitutionalism and the Megacity (Oxford University Press, 2020)Ran Hirschl, Comparative Matters: The Renaissance of Comparative Constitutional Law (Oxford University Press, 2014 & 2016) Ran Hirschl, \"From Comparative Constitutional Law to Comparative Constitutional Studies,\" I-CON International Journal of Constitutional Law 11 (2013): 1-12 Ran Hirschl, Constitutional Theocracy (Harvard University Press, 2010)Ran Hirschl, Towards Juristocracy (Harvard University Press, 2004 & 2007)Ran Hirschl and Ayelet Shachar, \"The New Wall of Separation: Permitting Diversity, Restricting Competition,\" Cardozo Law Review 30 (2009): 2535-2560 Ran Hirschl, \"The Judicialization of Mega-Politics and the Rise of Political Courts,\" Annual Review of Political Science 11 (2008): 93-118Ran Hirschl, “The Question of Case Selection in Comparative Constitutional Law,” American Journal of Comparative Law 53 (2005): 125-155\nResearch areasCanadian Constitutional LawComparative LawJudicial Decision-MakingLaw and GlobalizationLaw and International DevelopmentLaw and Religion\nAll Publications\nSee also Professor Hirschl's SSRN page.",
    "keywords":" Comparative Constitutionalism; Comparative Politics; Judicial Review; Constitutional Law; Public Law"
  },
  {
    "name":"Iacobucci, Edward",
    "phone":"416-978-3718",
    "email":"edward.iacobucci@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/edward-iacobucci",
    "bio":"\nProfessor & TSE Chair in Capital Markets\nJackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5\nEdward M. Iacobucci, B.A. (Hons.) (Queen's) 1991; M.Phil. (Oxon.) 1993 (Rhodes Scholar, Ontario); LL.B. (Toronto) 1996, was appointed Dean and James M. Tory Professor of Law on January 1, 2015.  Prior to this appointment he was Osler Chair in Business Law and Professor of Law at the Faculty of Law, University of Toronto, and Associate Dean, Research.  He started at the Faculty of Law in 1998.  He was a Visiting Professor at Tsinghua University School of Law in 2010 and 2018, Visiting Professor, NYU@NUS Program in 2014, Visiting Professor at New York University Law School in 2007, Visiting Professor at University of Chicago Law School in 2003, and a John M. Olin Visiting Fellow at Columbia University Law School in 2002.  Prior to joining the Faculty of Law, he was the John M. Olin Visiting Lecturer at the University of Virginia in 1997-98 and served as Law Clerk at the Supreme Court of Canada for Mr. Justice John Sopinka in 1996-97. He won a teaching prize at the Faculty of Law in 2000 and was a joint winner with his co-authors of the 2002-3 Doug Purvis Prize in Canadian Economics for The Law and Economics of Canadian Competition Policy.  His areas of interest include corporate law, competition law, and law and economics more generally.\nSee also Professor Iacobucci's SSRN page.\nEducationB.A. (Hon Economics) - Queen’s University (1991)\tM.Phil. (Economics) - University of Oxford, St. John’s College (1993)\tLL.B. - University of Toronto Law School (1996)\nAcademic appointmentsTsinghua University: Visiting Intensive Course Professor (2010 & 2018)National University of Singapore and New York University School of Law, Visiting Professor, NYU@NUS Program (2014)New York University School of Law:  Visiting Professor of Law (2007)University of Chicago Law School: \tVisiting Professor of Law (2003)Columbia University Law School: \tJohn M. Olin Visiting Fellow (2002)\nAwards and distinctionsThe Doug Purvis Award in Canadian Economics (co-recipient (with co-authors) of award for best written work on Canadian economic policy given by Canadian Economics Association) (2002-2003)Recipient of the first Mewett Award for Excellence in Teaching at the Faculty of Law, University of Toronto given by SLS (2000)The Angus MacMurchy Gold Medal (highest cumulative average on graduation from Faculty of Law, University of Toronto (1996)Rhodes Scholarship (Ontario) (1991-1993)Prince of Wales Prize (highest cumulative average in Arts and Sciences at Queen’s University) (1991)\nOther serviceMember, Law Society of Upper CanadaDirector, The Dominion of Canada General Insurance Company 2008-2013Director, The Empire Life Insurance Company, 2008-\t- Member of Audit Committee, Human Resources Committee and Chair of the Conduct Review CommitteeCompetition Policy Scholar-in-Residence, CD Howe Institute 2011-Director, Investment Industry Regulatory Organization of Canada- Chair, Corporate Governance Committee, Member Regulatory Rules Brief CommitteeMember of the Canadian Common Law Program Approval Committee 2017 -\nSelected publications\"Reputational Economies of Scale, with Application to Law Firms\" Am Law Econ Rev (Spring 2012) 14 (1): 302-329.“Making Sense of Magna” (2011) 49 Osgoode Hall L. J. 237-275.\"An Empirical Examination of the Governance Choices of Income Trusts\" (with Anita Anand) (2011) 8 Journal of Empirical Legal Studies 147.“A Switching Costs Explanation of Tying and Warranties” (2008) 37 Journal of Legal Studies 431.“Legal and Economic Boundaries of the Firm” (2007) 93 Virginia Law Review 515. Co-author: George Triantis.\nCurriculum Vitae\nResearch areasBusiness CorporationsCompetition LawEconomic Analysis of LawSecurities Regulation\nAll Publications\nSee also Professor Iacobucci's SSRN page.",
    "keywords":" Corporate Law; Competition Law; Law and Economics; Law and Economics of Canadian Competition Policy; Doug Purvis Prize in Canadian Economics"
  },
  {
    "name":"Katz, Ariel",
    "phone":"416-978-8892",
    "email":"ariel.katz@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/ariel-katz",
    "bio":"\nAssociate Professor\nJackman Law BuildingRoom J34078 Queen's ParkToronto, Ontario M5S 2C5\nAriel Katz is an Associate Professor at the Faculty of Law, University of Toronto. Professor Katz received his LL.B. and LL.M from the Hebrew University of Jerusalem and his SJD from the University of Toronto. His general area of research involves economic analysis of competition law and intellectual property law, with allied interests in electronic commerce, pharmaceutical regulation, the regulation of international trade, and particularly the intersection of these fields. Between 2009 and 2012 Professor Katz was the Director of the Centre for Innovation Law and Policy. Prior to joining the University of Toronto Professor Katz was a staff attorney at the Israeli Antitrust Authority. While there, he litigated several merger appeals and restrictive arrangements cases before the Antitrust Tribunal and negotiated regulatory settlements. Professor Katz currently teaches courses on intellectual property, cyberlaw, and the intersection of competition law and intellectual property, and shares some of his current thoughts on these issues on his blog.\nSee also Professor Katz's SSRN page.\nEducationLL.B. - Hebrew University (1997)LL.M. - Hebrew University (2001)S.J.D. - University of Toronto (2005)\nSelected publications\"Beyond Refusal to Deal: A Cross-Atlantic View of Copyright, Competition and Innovation Policies\" (2013) 79(1) Antitrust Law Journal 139 (with Paul-Erik Veel). “Fair Use 2.0: The Rebirth of Fair Dealing in Canada”, in Michael Geist, ed., The Copyright Pentalogy: How the Supreme Court of Canada Shook the Foundations of Canadian Copyright Law, pp. 93-156 (Ottawa, ON: Ottawa University Press, 2013).“The Orphans, The Market, and the Copyright Dogma: A Modest Solution to a Grand Problem” (2012) 27(3) Berkeley Technology Law Journal, 1285-1346.\"Beyond Search Costs: The Linguistic and Trust Functions of Trademarks\" 2010 BYU Law Review 1555 (2010). \"Pharmaceutical Lemons: Innovation and Regulation in the Drug Industry\" (2007) 14 Michigan Telecommunications and Technology Law Review 1.\"Making Sense of Nonsense: Intellectual Property, Antitrust, and Market Power\" (2007) 49 Arizona Law Review 837.\"The Potential Demise of Another Natural Monopoly: Rethinking the Collective Administration of Performing Rights\" (2005) 1(3) Journal of Competition Law & Economics 541.\"A Network Effects Perspective on Software Piracy\" (2005) 55 University of Toronto Law Journal 155.\nResearch areasCompetition LawEconomic Analysis of LawIntellectual Property Law\nAll Publications\nSee also Professor Katz's SSRN page.",
    "keywords":" Economic Analysis; Competition Law; Intellectual Property Law; Electronic Commerce; Pharmaceutical Regulation"
  },
  {
    "name":"Katz, Larissa",
    "phone":"416-978-4297",
    "email":"larissa.katz@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/larissa-katz",
    "bio":"\nProfessor and Canada Research Chair in Private Law Theory; Associate Dean, Graduate Programs\nJackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5\nLarissa Katz is Professor of Law and Canada Research Chair in Private Law Theory. She is also the Associate Dean (Graduate Programs). She is cross-appointed to the Munk School of Global Affairs and Public Policy. Prior to joining the Faculty of Law in 2013, Professor Katz clerked for the late Justice Charles D. Gonthier at the Supreme Court of Canada, worked in litigation at Sullivan & Cromwell LLP (NYC) and taught at Queen’s University, Faculty of Law.Professor Katz writes about moral, political and social issues relating to private law generally and property law in particular. Her work appears in journals such as Theoretical Inquiries in Law, Yale Law Journal, University of Pennsylvania Law Review, Legal Theory, Jurisprudence, University of Toronto Law Journal, McGill Law Journal and the Canadian Journal of Law and Jurisprudence, Cornell Journal of Law and Public Policy (forthcoming), Notre Dame Law Review (forthcoming). Her work is included in anthologies such as The Philosophical Foundations of Property Law (Oxford University Press), The Philosophical Foundations of Equity, The Cambridge Companion to Law and Philosophy (Cambridge U. Press). Professor Katz is currently writing People and Things: Property in the Legal Order (under contract with Oxford University Press).Professor Katz has been a visiting fellow at the John Fleming Centre for the Advancement of Legal Research at the Australian National University, a Visiting Professor at Sciences Po (Paris) and an HLA Hart Visiting Fellow at the Oxford Center for Ethics & Philosophy of Law, Oxford University. Professor Katz actively works on issues in law and policy in Canada and the United States. Professor Katz serves as a member of the International Advisory Panel for the American Law Institute’s project on the Restatement of the Law (Fourth), Property.Professor Katz is an Associate Editor of Law and Philosophy and on the advisory board of Queen’s Law Journal.\nSee also Professor Katz's SSRN page.\nEducationYale Law School, LL.M.; J.S.D.Faculty of Law, University of Alberta, LL.B., (Highest Distinction)Faculty of Arts, University of Alberta, B.A. (Honours Philosophy) (First Class Standing)\nAwards and distinctionsSocial Sciences and Humanities Research Council Insight GrantCanada Research Chair in Private Law TheoryMewett Teaching Award, University of TorontoQueen’s Law Students Society Teaching Award, Queen’s UniversitySelection for Stanford-Yale Junior Faculty Forum (blind competition)Viscount Bennett Scholarship for Graduate Studies at Yale Law School Lillian Goldman Scholarship, Yale Law SchoolMacEachran Gold Medal in Law, University of AlbertaMacEachran Gold Medal in Philosophy, University of AlbertaRyan Styobe Memorial Scholarship in Philosophy, University of AlbertaMacEachran Humanities Scholarship, University of Alberta\nOther infoDoctoral Supervision Professor Katz welcomes inquiries from prospective doctoral and postdoctoral students interested in property law, private law and legal theory.Legal Analysis Property and Cities with Munk SchoolLarissa Katz on Ownership, Felipe Jimenez’s The Private Law Podcast\nSelected publicationsKatz, L. Equitable Remedies and “What We Have Coming to Us, 96 Notre Dame Law Review 1115 (2020)Katz L. Ownership and Office: The Building Blocks of a Legal Order, 70 University of Toronto Law Journal 267 (2020)Katz, L. Philosophy of Property Law, Three Ways, in J. Tasioulas, ed., The Cambridge Companion to Law and Philosophy (2020)Katz, L (2020) “It’s Not Personal: Social Obligations in the Office of Ownership” Cornell J. of L. & Pub. Pol.  (accepted, forthcoming)Katz, L (2019) “Conscience with a Filter”, Jerusalem Review of Legal Studies 11-15Katz, L (2017) “Property’s Sovereignty”, 18 Theoretical Inq. in Law 299Katz, L (2019) “Shares as Shares” in S. Agnew & B. McFarlane, Modern Studies in Property Law (Bloomsbury 2019)Katz, L (2019) “Blowing Hot and Cold” in J. Oberdiek & P. Miller, eds., Civil Wrongs and Justice in Private Law (Oxford U. Press)Katz, L. (2019) “Equity: Pathways to Legal Rights” in D. Klimchuk, I. Samet, & H.E. Smith, eds, Philosophical Foundations of Equity (Oxford U. Press)Katz, L. (2018) “Legal Forms and Formalism” in M. Otsuka & J.E. Penner, eds, Property Theory: Legal and Political Perspectives (Cambridge U. Press)SSRNhttps:\/\/papers.ssrn.com\/sol3\/cf_dev\/AbsByAuth.cfm?per_id=466216Academia.eduhttp:\/\/utoronto.academia.edu\/LarissaKatz\nResearch areasEquity and TrustsPrivate Law TheoryProperty Law\nAll Publications\nSee also Professor Katz's SSRN page.\nTwitter@KatzLarissa",
    "keywords":" Private Law Theory; Property Law; Moral, Political, Social Issues; Law and Policy; Legal Order"
  },
  {
    "name":"Knop, Karen",
    "phone":"416-978-4035",
    "email":"k.knop@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/karen-knop",
    "bio":"\nProfessor & Cecil A. Wright Chair (1960-2022)\nJackman Law Building78 Queen's Park Toronto, Ontario M5S 2C5\nIt is with immense sadness that the Faculty of Law announces the passing of our dear colleague, Karen Knop, on September 26, 2022. Karen held the Faculty’s Cecil A. Wright Chair.Karen Knop, B. Sc. (Hons.), LL.B. (Dalhousie), LL.M. (Columbia), S.J.D. (Toronto), is a professor at the Faculty of Law.  She was editor of the University of Toronto Law Journal from 2007 to 2012, and associate dean for research from 2016 to 2018.  She teaches in the areas of public international law, private international law, foreign relations law and citizenship law, and is a past recipient of an award from the university student organizations for excellence in teaching.Professor Knop writes on issues of diversity, interpretation and participation in public international law.  While such issues are usually studied as part of international human rights law, her scholarship is broadly concerned with the challenges of gender and cultural differences to core concepts in public international law, including sovereignty, self-determination, nationality and the relationship between international and domestic law.  Her recent articles develop alternative approaches to these topics by turning to private international law and foreign relations law.Professor Knop’s book Diversity and Self-Determination in International Law (Cambridge University Press) was awarded a Certificate of Merit by the American Society of International Law.  She is the editor of Gender and Human Rights (Oxford University Press), co-editor of Re-Thinking Federalism: Citizens, Markets and Governments in a Changing World (UBC Press) (with Sylvia Ostry, Richard Simeon and Katherine Swinton), and co-editor of a symposium issue of the journal Law and Contemporary Problems on “Transdisciplinary Conflict of Laws” (with Ralf Michaels and Annelise Riles).  Her articles have appeared in the Cornell Law Review, European Journal of International Law, NYU Journal of International Law and Politics, Osgoode Hall Law Journal, Stanford Law Review and Transnational Legal Theory, among others.  Professor Knop currently holds a Social Sciences and Humanities Research Council (SSHRC) grant for a project entitled “A Missing Field: Foreign Relations Law of Canada” (with Robert Wai).Professor Knop is a Max Planck Law Fellow (Germany) and was the 2020-21 Jane and Aatos Erkko Visiting Professor in Studies on Contemporary Society at the Helsinki Collegium for Advanced Studies, University of Helsinki.  She has also been a British Academy visiting fellow at the Centre for Women, Peace and Security, London School of Economics; a visiting professor at Georgetown University Law Center; a visiting fellow at the University of Melbourne Law School; the J.C. Smith Visiting Fellow at the University of Nottingham School of Law and a senior fellow at the Center for International Studies, New York University School of Law.  Professor Knop sits on the editorial boards of Critical Analysis of Law, the London Review of International Law, Queen's Law Journal, the University of Toronto Law Journal and the American Journal of International Law, where she chaired the editorial committee of AJIL Unbound, the new online component of the Journal, from 2014 to 2017.  In 2020 she delivered a course at the Hague Academy of International Law and will give the Herbert Bernstein Lecture in Comparative and International Law at Duke University School of Law in 2022.\nSee also Professor Knop's SSRN page.\nResearch areasInternational Law\nAll Publications\nSee also Professor Knop's SSRN page.\nTwitter@karen_knop",
    "keywords":" Public International Law; Private International Law; Foreign Relations Law; Gender and Cultural Differences; Sovereignty"
  },
  {
    "name":"Langille, Brian",
    "phone":"416-978-4907",
    "email":"brian.langille@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/brian-langille",
    "bio":"\nProfessor\nJackman Law BuildingRoom J45478 Queen's ParkToronto, Ontario M5S 2C5\nA native of Nova Scotia, Professor Langille joined the faculty at Dalhousie Law School in 1978 and moved to the Faculty of Law at the University of Toronto in 1983, becoming Full Professor in 1989. He is the former Associate Dean of Graduate Studies (1999-2002) and former Acting (2003-04) and Interim Dean (2005) of the Law Faculty. He was Director of the Law Faculty’s Legal Theory Workshop from 1986-1999. He has been a Visiting Professor at a number of Law Schools around the world as well as a Fellow at the European University Institute in Florence and the Institute for Advanced Studies at Nantes, France.Professor Langille has lectured in many parts of the world on matters of globalization and social justice and also acted as advisor on constitutional and international labour law to the governments of several Canadian provinces, the Canadian Federal Government (Department of Foreign Affairs and International Trade; Human Resources and Social Development Canada), and international labour law to the North American Commission on Labour Cooperation, the International Labour Organization, and the World Commission on the Social Dimension of Globalization. He has been a member of several Canadian government delegations to the ILO, acted as a Rapporteur for the OECD, is an Editor of the International Labour Law Reports, a member of the Board of Advisors of the International Labour Review, and was a member of the executive of the International Society for Labour and Social Security Law from 1996 to 2006. Professor Langille completed a nine-year term as a Governor of the University of Toronto in 2003. He is also an experienced labour arbitrator.\nSee also Professor Langille's SSRN page.\nEducationB.A. (Philosophy) - Acadia (1972) LL.B. - Dalhousie (1975)B.C.L. - Oxford (1977)\nAcademic appointmentsInternational Short-Term Visiting Professor, Columbia Law School (Invited for November 2020)Visiting Professor, Universidad Torcuato Di Tella, Buenos Aires, Argentina (June 2019)Visiting Professor, University of Padua, Italy (January-April 2019)Guest Professor, University of Padua and University of Ferrara Doctoral Summer School, Monteortone, Italy (September 2016)Visiting Professor, Faculty of Law, Hebrew University, Jerusalem (January-March 2015)Visiting Professor and Senior Fellow, Melbourne Law School (January-March 2013)Fellow, Institute for Advanced Studies, Nantes, France (Jan-Jun 2012)Innis Christie Visiting Professor in Labour and Employment Law, Dalhousie University (Nov 2011)Professor, Centre for Transnational Legal Studies, London (Autumn 2010) Visiting Professor, University Pompeu Fabra, Barcelona (Dec 2010)Visiting Fellow, European University Institute, Florence (Autumn 2006)Cross Appointment to the Centre for Ethics, University of Toronto (2006)Visiting Scholar, International Institute for Labour Studies (ILO), Geneva (2004-2005)Program for the Study of International Institutions Fellow, Graduate Institute for International Studies, University of Geneva (2004-2005)Cross Appointment to the Graduate Faculty, Centre for International Studies, University of Toronto (1998)Cross Appointment to the Centre for Industrial Relations, University of Toronto (1983)\nOther serviceMember, International Steering Committee, Labour Law Research Network (LLRN) (2016-2019)Member, Advisory Committee, Labour Law Research Network (LLRN) (2012- )Member, Board of Advisors, International Labour Review (2007- )Member, Editorial Board, University of Toronto Law Journal (1996- )Member, Board of Advisors, International Labour Review (2007- )Canadian Reporter, International Labour Law Reports (ILLR) (1996- )Member, Labour Law Casebook Group (Canada) (1980- )Member, Labour Law Trust (U.S.) (1989- )Executive Committee, International Association for Labour and Social Security Law (1996- 2007)\nSelected publications“Hard Law Makes Bad Cases” (2016), 32 International Journal of  Comparative Labour Law and Industrial Relations 407-423.“Labour” in Cogan, Hurd and Johnstone (eds) The Oxford Handbook of International Organizations (OUP, 2016) 472-490.“The Condescending Constitution” (2016), 19 Canadian Labour and Employment Law Journal 335-364.“The Narrative of Global Justice and the Grammar of Law” in Dahan, Lerner, and Milman (eds) Global Justice and International Labour Rights (2016, Cambridge University Press).“Law Firm Partners and the Scope of labour Laws” (2015), 4 Canadian Journal for Human Rights 211-236 (with Alon-Shenker)“The Curious Incident of Forced Labour, the ILO, and Myanmar” in Blackette and Trebilcock (eds), Research Handbook on Transnational Labour Law (Edward Elgar, 2015).“‘Take These Chains from My Heart and Set Me Free’: How Standard Labour Law Theory Drives Unnecessary Segmentation of Worker Rights”, (2015), 36 Comparative Labor Law and Policy Journal.The Idea of Labour Law, (Davidov and Langille, eds.) Oxford University Press, 2011. (Paperback 2013).Is There a Constitutional Right to Strike in Canada? (Langille, ed) Special Symposium Issue of the Canadian Labour and Employment Law Journal (2010).“Imagining Post Geneva Consensus Labour Law for Post Washington Consensus Development” (2010), 31 Comparative Labor Law and Policy Journal 523-552.\"The Freedom of Association Mess: How we got into it and how we can get out of it.” (2009), 54 McGill Law Journal 177-215.“What is International Labour Law For?” (2009), 3 Law and Ethics of Human Rights 47-82.\nCurriculum Vitae\nResearch areasCharter of RightsContractsInternational LawLabour LawLaw and GlobalizationLegal Theory\nAll Publications\nSee also Professor Langille's SSRN page.",
    "keywords":" Globalization; Social Justice; Constitutional Law; International Labour Law; Labour Arbitration"
  },
  {
    "name":"Lee, Ian",
    "phone":"416-946-8232",
    "email":"ian.lee@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/ian-lee",
    "bio":"\nAssociate Professor\nJackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5\nIan B. Lee clerked with Justice Claire L'Heureux-Dubé of the Supreme Court of Canada and Justice Mark MacGuigan of the Federal Court of Appeal, and later served as a legal researcher with the Privy Council Office. He practised with Sullivan & Cromwell LLP in Paris, France, and New York, New York, before joining the Faculty of Law in 2003. He served as Associate Dean (JD Program) from 2012 to 2015. His teaching and research interests are in the areas of constitutional law, corporate law and European Union law. He has also taught at the University of Sydney Law School and at the University of Graz. Professor Lee is admitted to practice in Ontario and New York.\nSee also Professor Lee's SSRN page.\nEducationB.Com. - University of Toronto (1991)LL.B. - University of Toronto (1994)LL.M. - Harvard Law School (1998)\nSelected publications“Économie, travail et Constitution” in JurisClasseur Québec, coll. Droit public, Droit constitutionnel (LexisNexis, 2011-current). Publisher's web site.\"Corporate Criminal Responsibility as Team-member Responsibility,\" 31 (4) Oxford Journal of Legal Studies 755-781 (2011). Full text available from Oxford Journals.\"Balancing and its Alternatives: Jurisprudential Choice, Federal Securities Legislation and the Trade and Commerce Power,\" (2011) 50 Canadian Business Law Journal 72-105.  Pre-print available here.“Citizenship and the Corporation”  (2009) 34 Law & Social Inquiry 129-168. Full-text preprint available here.\"Can Economics Justify the Constitutional Guarantee of Freedom of Expression?\" (2008) 21 Canadian Journal of Law & Jurisprudence 355-97. Full text available here.\"Implications of Sen's Concept of Commitment for the Economic Understanding of the Corporation\" (2008) 21 Canadian Journal of Law & Jurisprudence 97.  Full text available here.\nResearch areasBusiness CorporationsCanadian Constitutional LawCharter of RightsComparative Law\nAll Publications\nSee also Professor Lee's SSRN page.",
    "keywords":" Constitutional Law; Corporate Law; European Union Law; Supreme Court of Canada; Federal Court of Appeal"
  },
  {
    "name":"Lemmens, Trudo",
    "phone":"416-978-4201",
    "email":"trudo.lemmens@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/trudo-lemmens",
    "bio":"\nProfessor, Scholl Chair in Health Law and Policy\n78 Queen's Park Toronto, Ontario M5S 2C3Twitter: @TrudoLemmens\nTrudo Lemmens, CandJur, LicJur (KULeuven), LLM bioethics, DCL (McGill), is Professor and Scholl Chair in Health Law and Policy. He is cross appointed to the Dalla Lana School of Public Health, the Faculty of Medicine, and the Joint Centre for Bioethics. His research focuses on the interaction between law, governance tools, and ethical norms and values in the context of health care, biomedical research, pharmaceutical and other health product development, and knowledge production.Since joining the Faculty of Law, professor Lemmens has been a member of the School of Social Science of the Institute for Advanced Study in Princeton, a visiting fellow of the Royal Flemish Academy of Belgium for Science and the Arts, a visiting professor at the K.U.Leuven (Belgium), the Pontificia Universidad Javeriana (Bogota, Colombia), the University Torcuato di Tella (Buenos Aires, Argentina), and the University of Otago (Dunedin, New Zealand) ; a Plumer Visiting Fellow at Oxford’s St. Anne’s College, and an academic visitor at the Faculty of Law and the HeLEX Center for Health, Law and Emerging Technologies of the University of Oxford.Professor Lemmens’ publications include the co-authored book Reading the Future? Legal and Ethical Challenges of Predictive Genetic Testing, the co-edited volumes Regulating Creation: The Law, Policy and Ethics of Assisted Human Reproduction, and Law and Ethics in Biomedical Research: Regulation, Conflict of Interest, and Liability, as well as numerous chapters and articles in national and international law, policy, science, medicine and bioethics journals. He has been consulted widely by national and international organizations and has presented in the area of his expertise before a variety of parliamentary committees. He is currently a member of the Advisory Committee on Health Research of the Pan American Health Organization. In the last five years, he was a member of two expert panels of the Council of Canadian Academies: one on access to health data, the other on advance requests and medical assistance in dying.\nSee also Professor Lemmens' SSRN page.\nEducationCand. Jur. - KULeuven, Campus Kortrijk, Belgium (1985)Lic. Jur. - KULeuven, Belgium (1988)LL.M. (Specialization Bioethics) - McGill (1995)D.C.L. - McGill (2003)\nAcademic appointmentsProfessor and Dr. William M. Scholl Chair in Health Law and Policy (present)Professor (status only), Dalla Lana School of Public Health; Department of Medical Genetics and Microbiology; and Department of Psychiatry (present)Adjunct Professor, Osgoode Hall Law School (2008-2018)Visiting Professor, Faculties of Law and Medicine, KULeuven, Belgium (2006-2007)Visiting Professor, Centre for Bioethics, Pontificia Universidad Javeriana (Bogota, Colombia)Visiting Professor, Faculty of Law, Torcuato di Tella University (Buenos Aires, Argentina)Fellow, Royal Flemish Academy of Belgium of Science and the Arts, Brussels, Belgium (2006-2007)Visiting Professor, Faculty of Law, University of Otago, Dunedin, New Zealand (Jan-Feb 2007)Member, School of Social Science, Institute for Advanced Study, Princeton (2003 - 2004)Bioethicist, Centre for Addiction and Mental Health (1997-1999)Researcher, Clinical Trials Research Group, Biomedical Ethics Unit, McGill University (1994-1997)Visiting Fellow at the Centre de Recherche en Droit Public, Université de Montréal (1994-1996)\tResearch Associate, McGill Centre for Medicine, Ethics and Law (1992-1994)Teaching and Research Associate (“wetenschappelijk assistent”), department of International and Comparative Law, KULeuven, Belgium (1988-1990)\nAwards and distinctionsFellowship, Royal Flemish Academy of Belgium for Science and the Arts, Brussels, Belgium (2006-2007)Membership, School of Social Science, Institute for Advanced Study, Princeton (2003-2004)Law Commission of Canada, Legal Dimensions Initiative Award (with Duff R. Waring) (2003)Graduate Student Paper Award, Association for Politics and the Life Sciences (1996)Doctoral Fellowship, Social Sciences and Humanities Research Council of Canada (1995-1997)Doctoral Fellowship, Fonds pour la formation de chercheurs et l'aide à la recherche du Québec (deferred) (1995-1998)Student Paper Award, Society for Health and Human Values (1995)Chief Justice R.A.E. Greenshields Memorial Scholarship for Graduate Studies in Law (1994)\nOther serviceMember, Advisory Committee on Health Research, Pan American Health Organization (since 2006)Member, World Health Organization Expert Advisory Panel on Clinical Practice Guidelines and Research Methods and Ethics (2010-2015)Member, Council of Canadian Academies Expert Panel on Timely Access for Health and Social Data for Health Research and Health System Innovation (2014-2015)Member, Council of Canadian Academies Expert Panel on Medical Assistance in Dying (2017-2018)\nSelected publicationsTrudo Lemmens & Gregory Ringkamp, “The Declaration of Helsinki and Transparency: When International Ethics Standards Face National Implementation Challenges” in Ulf Schmidt, Andreas Frewer & Dominique Sprumont, (eds.), Research Ethics and the Declaration of Helsinki (Oxford University Press, 2020) 284-309.Trudo Lemmens & Kanksha Mahadevia Ghimire, “Regulation of the Health Professions in Ontario: Self-Regulation with Statutory-Based Public Accountability” (2019) 19(3) Journal of Health Law\/Revista de Dereito Sanitario 124-204.Trudo Lemmens & Carlos Herrera Vacaflor, “Research Transparency in the Americas: The Need to Coordinate Regulatory Spheres” (2018) 362 British Medical Journal k2493-8“Charter Scrutiny of Canada's Medical Assistance in Dying Law and the Shifting Landscape of Belgian and Dutch Euthanasia Practice” (2018) 85 Supreme Court Law Review (2nd) 453-539.Trudo Lemmens, Heesoo Kim & Elizabeth Kurz, “Why Canada’s Medical Assistance in Dying Law Should Be C(h)arter Compliant and What it May Help to Avoid”  (2017) 11(1) McGill Journal of Law & Health S61-S148.Scott Y.H. Kim & Trudo Lemmens, “Should assisted dying for psychiatric disorders be legalized in Canada? (2016) Canadian Medical Association Journal cmaj.160365; doi:10.1503\/cmaj.160365Louis Charland, Trudo Lemmens & Kyoko Wada, “Decision-Making Capacity to Consent for Medical Assistance in Dying for Persons with Mental Disorders” (2016) Open Issue Journal of Ethics in Mental Health 1-15Trudo Lemmens & Shannon Gibson, \"Decreasing the Data Deficit: Improving Post-Market Surveillance in Pharmaceutical Regulation\" (2014) 59(4) McGill Law Journal 943-988.Shannon Gibson & Trudo Lemmens, \"Niche Markets and Evidence Assessment in Transition: A Critical Review of Proposed Drug Reforms\" (2014) 22(2) Medical Law Review 200-220.“Pharmaceutical Knowledge Governance: A Human Rights Perspective” (2013) 41(1) Journal of Law, Medicine and Ethics 163-84.Trudo Lemmens & Candice Telfer, “Access to Data and the Right to Health: The Human Rights Case for Clinical Trials Transparency” (2012) 31(1) American Journal of Law & Medicine 63-112.Simon Stern & Trudo Lemmens, “Legal Remedies for Medical Ghostwriting: Imposing Fraud Liability on Guest Authors of Ghostwritten Articles” (2011) 8(8) PLoS Medicine 1-8Trudo Lemmens & Lisa Austin, “The End of Individual Control Over Health Information: Governing Biobanks and Promoting Fair Information Practices” in Jane Kaye & Mark Stranger, eds, Governing Biobanks  (Farnham (UK): Ashgate, 2009) 243-266.\nResearch areasHealth Law\nAll Publications\nSee also Professor Lemmens' SSRN page.",
    "keywords":" Health Law and Policy; Biomedical Research; Pharmaceuticals; Knowledge Production; Bioethics"
  },
  {
    "name":"Levi, Ron",
    "phone":"416.978.2486",
    "email":"ron.levi@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/ron-levi",
    "bio":"\nProfessor of Global Affairs & Public Policy and Sociology; Distinguished Professor of Global Justice; Director, Global Justice Lab, Munk School of Global Affairs & Public Policy\n315 Bloor Street West, Room 213\nurl: http:\/\/individual.utoronto.ca\/ronlevi\/\nRon Levi is Professor at the Munk School of Global Affairs & Public Policy and the Department of Sociology, and is Distinguished Professor of Global Justice. He holds a courtesy cross-appointment to the Faculty of Law, and is a Permanent Visiting Professor at the University of Copenhagen.Ron works at the intersection of the sociology of law and political sociology. He studies two related questions: (1) responses to crime, violence, repression, and atrocities, through legal institutions, in collective memory, and across professional groups; and (2) how legal ideas are institutionally promoted across eras and political contexts, and how individuals and groups grapple with them. He directs the Global Justice Lab in the Munk School, which works with justice systems under stress.In recent years, Ron has taught courses on events and turbulent times; police violence in global affairs; the sociology of atrocities; law, politics and globalization; justice measurement; and the sociology of law.Ron has served as Secretary of the Law and Society Association, and as an elected Council Member for the Sociology of Law section of the American Sociological Association. He was made Chevalier in l'Ordre des Palmes Académiques by the French Government, is a recipient of the Ludwik and Estelle Jus Memorial Human Rights Prize, and has served as Scholar-in-Residence for Holocaust Education Week. In 2022, he received the Global Educator Award from the University of Toronto.\nOther infoGlobal Justice Lab\nSelected publicationsSendroiu, Ioana and Ron Levi. Forthcoming. “World Society Corridors: Partnership Patterns in the Spread of Human Rights.” Forthcoming, Social Forces.Stein, Janice Gross and Ron Levi. 2023. “Testing Deterrence by Denial: Experimental Results from Criminology.” Studies in Conflict & Terrorism 46:101-121.Sendroiu, Ioana, Ron Levi and John Hagan. 2022. “Legal Cynicism and System Avoidance: Roma Marginality in Central and Eastern Europe.” Social Forces 101:281-308.Upenieks, Laura, Ioana Sendroiu, Ron Levi and John Hagan. 2022. “Beliefs about Legality and Benefits for Mental Health.” Journal of Health and Social Behavior 63:266-282.Levi, Ron, Ronit Dinovitzer and Wendy Wong. 2022. “Strategic Philanthropy and International Strategies: The Ford Foundation and Investments in Law Schools and Legal Education.” Pp. 79-122 in B. Garth and G. Shaffer, eds., The Globalization of Legal Education. New York: Oxford University Press.Levi, Ron, Holly Campeau and Todd Foglesong. 2022. “Recognition Gaps and Economies of Worth in Police Encounters.” American Journal of Cultural Sociology 10:87-109.Campeau, Holly, Ron Levi and Todd Foglesong. 2021. “Policing, Recognition, and the Bind of Legal Cynicism.” Social Problems 68:658-674.Levi, Ron, Ioana Sendroiu and John Hagan. 2020. “America First Populism, Social Volatility, and Self-Reported Arrests.” Proceedings of the National Academy of Sciences 117:26703-26709.Levi, Ron and Ioana Sendroiu. 2020. “Performance, Power, and Transnational Legal Ordering:  Addressing Sexual Violence as a Human Rights Concern.” Pp. 333-368 in G. Shaffer and E. Aaronson, eds., The Transnational Legal Ordering of Criminal Justice. New York: Cambridge University Press. Levi, Ron and Ioana Sendroiu. 2019. “Moral Claims and Redress after Atrocity: Economies of Worth across Political Cultures in the Holocaust Swiss Banks Litigation.” Poetics 73:45-60.Campeau, Holly and Ron Levi. 2019. “Neoliberal Legality as Dual Process: Embeddedness, Courts and Crime Prevention in the United States.” British Journal of Criminology 59: 334–353.Levi, Ron, Sara Dezalay and Michael Amiraslani. 2016. “Prosecutorial Practice and Strategic Statements: Justifying International Prosecutions from the International Military Tribunal at Nuremberg through to the International Criminal Court.” Comparativ: Journal for Global History and Comparative Studies 26:58-73.Levi, Ron, John Hagan and Sara Dezalay. 2016. “International Courts in Atypical Political Environments: The Interplay of Prosecutorial Strategy, Evidence, and Court Authority in International Criminal Law.” Law and Contemporary Problems 79:289-314.\nResearch areasComparative LawCritical Legal TheoryInternational LawLaw and Globalization\nAll Publications\nTwitter@ronleviutoronto",
    "keywords":" Sociology of Law; Political Sociology; Global Justice; Responses to Crime; Collective Memory"
  },
  {
    "name":"Lie, David",
    "phone":"416-946-0251",
    "email":"lie@eecg.toronto.edu",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/david-lie",
    "bio":"\nProfessor, Edward S. Rogers Department of Electrical and Computer Engineering and Department of Computer Science\nSandford Fleming Building 10 King’s College Road Toronto, ON M5S 3G4\nPersonal website\nDavid Lie received his BASc from the University of Toronto in 1998, and his MS and PhD from Stanford University in 2001 and 2004, respectively. He is currently a Professor in the Department of Electrical and Computer Engineering at the University of Toronto.  He holds a non-budgetary cross-appointment at the Faculty of Law.He is known for his seminal work on the XOM architecture, which was an early precursor to modern trusted execution processor architectures such as ARM Trustzone and Intel SGX.  He was the recipient of a best paper award at SOSP for this work. David is also a recipient of the MRI Early Researcher Award, Connaught Global Challenge Award and previous holder of a Canada Research Chair.  He developed the PScout Android Permission mapping tool, whose datasets have been downloaded over 10,000 times and used in dozens of subsequent papers.  David has served on various  program committees including OSDI, Usenix Security, IEEE Security & Privacy, NDSS and CCS.  Currently, his interests are focused on securing mobile platforms, cloud computing security and bridging the divide between technology and policy.\nSelected publicationsSee Prof. Lie's personal website for a list of publications.",
    "keywords":" XOM architecture; ARM Trustzone; Intel SGX; Android Permission mapping; Cloud Computing Security"
  },
  {
    "name":"Liu, Sida",
    "phone":"",
    "email":"sd.liu@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/sida-liu",
    "bio":"\nAssociate Professor, Department of Sociology\n725 Spadina Avenue, Toronto\nPersonal website\nProfessor Sida Liu received his LL.B. degree from Peking University Law School and his Ph.D. in sociology from the University of Chicago. He joined the Department of Sociology at the University of Toronto in 2016 after teaching sociology and law at the University of Wisconsin-Madison. He holds a non-budgetary cross-appointment at the Faculty of Law.Professor Liu’s research interests include the sociology of law, organizations and professions, criminal justice, globalization, and social theory. He has conducted extensive empirical research on China’s legal reform and legal profession, including the globalization of corporate law firms, the political mobilization of criminal defense lawyers, the feminization of judges, and the career mobility of law practitioners. His current project examines China’s influence on the legal professions in Hong Kong and Taiwan. In addition to his empirical work, Professor Liu also writes on sociolegal theory and general social theory, particularly theories of social space and social process following the tradition of Georg Simmel and the Chicago School of sociology.Professor Liu is the author of three books in Chinese and English, most recently, Criminal Defense in China: The Politics of Lawyers at Work (with Terence C. Halliday, Cambridge University Press, 2016). He has also published many articles in leading law and social science journals, including the American Journal of Sociology, Sociological Theory, Law & Society Review, Law & Social Inquiry, China Quarterly, etc. Professor Liu is a Faculty Fellow at the American Bar Foundation, as well as an affiliated scholar of the U.S.-Asia Law Institute at New York University School of Law and the Center on the Legal Profession at Harvard Law School. In 2016-2017, he was a Member of the Institute for Advanced Study in Princeton.\nSelected publicationsSee Prof. Liu's personal website for a list of his publications.\nResearch areasComparative LawCriminal Law Law and GlobalizationLegal Process",
    "keywords":" Sociology of Law; Organizations and Professions; Criminal Justice; Globalization; Social Theory"
  },
  {
    "name":"MacIntosh, Jeffrey",
    "phone":"416-978-5795",
    "email":"j.macintosh@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/jeffrey-macintosh",
    "bio":"\nProfessor\n78 Queen's ParkToronto, Ontario M5S 2C5\nJeffrey MacIntosh holds the Toronto Stock Exchange Chair in Capital Markets Law at the Faculty of Law and is a past Associate Director and Director of the Capital Markets Institute at the University of Toronto. He holds law degrees from Harvard and Toronto, and a bachelor of science degree from M.I.T. Prior to joining the University of Toronto, Professor MacIntosh served as an assistant professor at Osgoode Hall Law School. He was appointed a John M. Olin Fellow at Yale Law School in 1988-89.  He also served as a member of the Ontario Securities Commission Task Force on Small Business FinancingProfessor MacIntosh specializes in Corporation Law, Corporate Finance, Securities Regulation, Venture Capital, and Small Firm Financing.\nSee also Professor MacIntosh's SSRN page.\nResearch areasBusiness CorporationsSecurities Regulation\nAll Publications\nSee also Professor MacIntosh's SSRN page.",
    "keywords":" Corporate Finance; Securities Regulation; Venture Capital; Small Firm Financing; Corporation Law"
  },
  {
    "name":"Macklin, Audrey",
    "phone":"416-946-7493",
    "email":"audrey.macklin@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/audrey-macklin",
    "bio":"\nProfessor & Rebecca Cook Chair in Human Rights Law\n78 Queen's ParkToronto, Ontario M5S 2C5\nAudrey Macklin is a professor at the Faculty of Law. She holds law degrees from Yale and Toronto, and a bachelor of science degree from Alberta. After graduating from Toronto, she served as law clerk to Mme Justice Bertha Wilson at the Supreme Court of Canada. She was appointed to the faculty of Dalhousie Law School in 1991, promoted to Associate Professor 1998, moved to the University of Toronto in 2000, and became a full professor in 2009. While teaching at Dalhousie, she also served as a member of the Immigration and Refugee Board.Professor Macklin’s teaching areas include criminal law, administrative law, and immigration and refugee law. Her research and writing interests include transnational migration, citizenship, forced migration, feminist and cultural analysis, and human rights. She has published on these subjects in journals such as Refuge and Canadian Woman Studies, and in collections of essays such as The Security of Freedom: Essays on Canada's Anti-Terrorism Bill and Engendering Forced Migration.Prof. Macklin has been active in the Omar Khadr case. See the Omar Khadr case resources page.\nSee also Professor Macklin's SSRN page.\nResearch areasAdministrative LawFeminist Analysis of LawImmigration and Citizenship LawInternational Law\nAll Publications\nSee also Professor Macklin's SSRN page.",
    "keywords":" Transnational Migration; Citizenship; Forced Migration; Feminist Analysis; Human Rights"
  },
  {
    "name":"Moran, Mayo",
    "phone":"",
    "email":"mayo.moran@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/mayo-moran",
    "bio":"\nProfessor of Law, University of Toronto and Provost and Vice-Chancellor of Trinity College, University of Toronto\nProfessor Moran was appointed as the 15th Provost and Vice-Chancellor of Trinity College on July 1, 2014. Prior to assuming her role as Provost, Professor Moran served as the first female Dean of the Faculty of Law at the University of Toronto. As Dean, she led curriculum change, revised the admissions process and created the Asper Centre for Constitutional Rights and the Centre for the Legal Profession, among many other initiatives.  Her strong relationships with students, alumni and faculty led to her successful leadership of a $53 million campaign for the Faculty’s new Jackman Law Building.   Provost Moran has brought to Trinity College her commitment to students.  In 2016, she released the College’s new Strategic Plan: People, Program and Place, which builds upon the College’s reputation for academic excellence and interdisciplinary innovation and focuses on enhancing the whole student experience in order to make the College an even a better place to live, work and learn.  As Provost she has emphasized the student experience with initiatives ranging from mental health and wellness, to revitalized food services, to student services and program enhancements, to infrastructure renewal.Provost Moran’s teaching interests include both private and public law.  She continues to supervise graduate and undergraduate students.  At Trinity she teaches a fourth-year undergraduate course in the Ethics, Society & Law program entitled Ten Cases that Changed the World, which Maclean’s Magazine recently noted as one of the “cool courses” at the University of Toronto.Provost Moran publishes extensively on comparative constitutional law, legal and feminist theory, and historical injustices among other topics. Her book Rethinking the Reasonable Person (OUP) examines how judicial ideas of “normal” behaviour may discriminate against women and girls, and she recently co-edited The Residential Schools Litigation and Settlement special edition of the University of Toronto Law Journal.  Her current work considers how the past became a legal problem and what we should do about it.  She is a frequent guest lecturer and presents scholarly work at conferences around the world.Provost Moran is an active member of many committees both inside and outside the University of Toronto.  Recently she chaired the University of Toronto’s Expert Panel on Sexual Violence Policies and co-chaired the Faculty of Law’s Response to the Truth and Reconciliation Commission Committee.  She also serves on the Council of Ontario Universities Reference Group on Sexual Violence and is a founding member of the Transnational Advisory Group of the Association of American Law Schools.  In 2010, at the request of the Attorney General of Ontario, Provost Moran chaired an inquiry into Strategic Litigation against Public Participation (SLAPP).   The Government of Ontario also appointed her as the Independent Reviewer for the 2013 Review of the Accessibility for Ontarians with Disabilities Act. Since 2007, Provost Moran has chaired the Government of Canada’s Independent Assessment Process Oversight Committee that assists in the implementation of the Indian Residential Schools Agreement.Provost Moran obtained a B.A. (1980, English and Sociology) and B.Ed. (1981) at the University of British Columbia and taught secondary school in northern British Columbia before attending law school. She completed her LL.B. at McGill University (1990), her LL.M. at the University of Michigan (1992) and her S.J.D. at the University of Toronto (1999).  In addition to numerous other awards, in 2012 Provost Moran received a YWCA Woman of Distinction Award.\nSee also Professor Moran's SSRN page.\nResearch areasEquality and Anti-Discrimination LawLegal TheoryTort Law and Tort Theory\nAll Publications\nSee also Professor Moran's SSRN page.",
    "keywords":" Constitutional Law; Legal Theory; Feminist Theory; Historical Injustices; Accessibility for Ontarians with Disabilities Act"
  },
  {
    "name":"Moreau, Sophia",
    "phone":"416-946-7830",
    "email":"sr.moreau@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/sophia-moreau",
    "bio":"\nProfessor of Law and Philosophy\nJackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5\nBioSophia Moreau is Professor of Law and Philosophy (with a cross-appointment in the Department of Philosophy), a Faculty Associate at the U of T’s Centre for Ethics, and a Faculty Associate of Victoria College. She is an Associate Editor of Philosophy and Public Affairs, Book Reviews Editor of the University of Toronto Law Journal, and a member of the Editorial Board of Law and Philosophy. Prior to coming to the University of Toronto, she clerked for Chief Justice Beverley McLachlin at the Supreme Court of Canada; was a Frank Knox Memorial Fellow at Harvard University; and was a Commonwealth Scholar at Balliol College Oxford. In 2023, Professor Moreau will be the HLA Hart Distinguished Visiting Fellow at University College, Oxford. She was a Visiting Professor at NYU Law School in the fall of 2022, a Weinstein Fellow at Berkeley in the spring of 2022; and held a Chancellor Jackman Research Fellowship in 2021-22. Major PublicationsProfessor Moreau’s most recent book, Faces of Inequality: A Theory of Wrongful Discrimination,” won the 2022 CPA Book prize. It has been the subject of three international Symposia: a 2022 Review Symposium published in Jurisprudence 12.4 (2022), available here through www.tandfonline.com with essays by Deborah Hellman, Niko Kolodny, Seana Shiffrin, Kasper Lippert-Rasmussen and Rebecca Cook; a 2022 Symposium in the Jerusalem Review of Legal Studies 25.1 (2022), available here, with essays by David Estlund, Cheshire Calhoun, Adi Goldiner and Re’em Segev; and a Symposium in Dialogue forthcoming in 2023 with essays by Andrea Sangiovanni, Alysia Blackham, Pablo Gilabert, Dale Smith, Iyiola Solanke, Jess Eisen, and Daniel Viehoff.Professor Moreau’s other work on discrimination includes articles such as “Discrimination and Subordination”, “The Moral Seriousness of Indirect Discrimination”, “Equality and Discrimination”, “What is Discrimination?”, “Discrimination as Negligence” and “In Defense of a Liberty-Based Account of Discrimination.” Her other books include Philosophical Foundations of Discrimination Law (co-edited with Deborah Hellman) and Law and Morality (co-edited with David Dyzenhaus and Arthur Ripstein).Current ProjectsProfessor Moreau is currently working on three major projects:The Tort Law & Social Equality Project (hyperlink to: www.tortlawandsocialequality.ca), which Professor Moreau runs together with Professors Zoe Sinel (UWO) and Professor Jean Thomas (Queen’s) involves a database tracking the impact of a variety of torts and tort law rules on minority groups in Canada, as well as a monthly Discussion Forum promoting awareness of the ways in which tort law perpetuates social inequalities. See, in connection with this project, the paper “Beyond Anti-Discrimination Law: Combatting Subordination Through Other Laws, such as Tort Law.” “Institutional Roles and Morality” is a research project in normative ethics, which explores the many ways in which morality is structured by our institutional roles and the obligations to which they give rise. For two draft papers connected to this project, see “Morality and Role Obligations” and “Objectionable Obligations” (draft paper). “Systemic Discrimination and Violence Against Indigenous Women” is a research project in legal philosophy and discrimination law, which asks what we can learn about systemic discrimination —its nature and its self-perpetuating mechanisms— by considering the many forms of institutional discrimination that Indigenous women in Canada have faced, which has been extensively documented in the Final Report of Canada’s National Inquiry into Missing and Murdered Indigenous Women and Girls.\"Upcoming TalksOxford University Obligations Discussion Group, Paper Presentation, Feb. 16, 2023Warwick University, Philosophy Graduate Conference, Keynote Lecture, Feb. 18, 2023Oxford University Public Law Discussion Group, Paper Presentation, Feb. 21, 2023Seminar on Normativity and Conventions, Paper presentation, University of Pompeu-Fabra, Feb. 24, 2023Oxford Jurisprudence Discussion Group, Paper presentation, March 2, 2023Uehiro Centre, Faculty of Philosophy, Oxford, Lecture, March 7, 2023King’s Legal and Political Philosophy Workshop, Lecture, King’s College London, March 8, 2023Pacific APA, Commentary on Niko Kolodny’s The Pecking Order, April 5, 2023McGill-Concordia Conference on \"Human Dignity: Theory and Practice,” Paper presentation, April 28, 2023Involvement with the Legal ProfessionProfessor Moreau believes that legal theory should be informed by, and engaged with, legal practice. She was called to the Ontario Bar in 2006. Her approach to discrimination has been cited by the Canadian Supreme Court in seminal equality rights cases (most recently, Fraser v Canada, 2020 SCC 28; Quebec v. A, [2013] 1 S.C.R. 61); Withler v. Canada, [2011] 1 SCR 396; and R. v. Kapp, [2008] 2 S.C.R. 483,. She has made presentations to the Ontario Court of Appeal and the Constitutional Law Branch of the Ministry of the Attorney General, Ontario; has worked with L.E.A.F.; and has been a member of the Research Ethics Board at Toronto’s Hospital for Sick Children. In 2005, she wrote a commissioned report for the Government of Canada recommending that “gender identity” be added to the Canadian Human Rights Act as a prohibited ground of discrimination (it was added in 2017). She was called to the Bar of Ontario in 2006.\nEducationJ.D., University of Toronto, Faculty of LawPh.D., Harvard University, Department of PhilosophyB.Phil., Oxford University, Balliol CollegeB.A. (High Distinction), University of Toronto, Victoria College\nAwards and distinctionsCanadian Philosophical Association Book Prize, 2022 (for Faces of Inequality)Chancellor Jackman Research Fellowship, 2021-225 year Insight Grant, SSHRC, 2019-2024Standard Research Grant, SSHRC, 2006-2014Aid to Workshops Grant, SSHRC, 2011-2012Wright Grant, Faculty of Law, University of Toronto, 2005-06Emily and Charles Carrier Dissertation Prize, Harvard University, 2000Francis Bowen Prize in Philosophy, Harvard University, 2000\nResearch areasEquality and Anti-Discrimination LawMoral PhilosophyPolitical Philosophy and TheoryTort Law and Tort Theory\nAll Publications",
    "keywords":" Discrimination; Equality; Tort Law; Normative Ethics; Legal Philosophy;"
  },
  {
    "name":"Niblett, Anthony",
    "phone":"416-978-5403",
    "email":"anthony.niblett@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/anthony-niblett",
    "bio":"\nAssociate Professor and Canada Research Chair in Law, Economics, & Innovation\nJackman Law BuildingRoom J36678 Queen's ParkToronto, Ontario M5S 2C5\nAnthony Niblett is an Associate Professor and Canada Research Chair in Law, Economics, & Innovation at the Faculty of Law. Professor Niblett researches law & economics, innovation, contracts, judicial behaviour, and competition policy. He is also the Academic Advisor at the Future of Law Lab at the Faculty and an Affiliate Researcher with the Vector Institute for AI. You can find some of his research papers here.Professor Niblett holds a Ph.D. in economics from Harvard as well as degrees in law and commerce from the University of Melbourne. He was a Bigelow Fellow at the University of Chicago before moving to Canada.Professor Niblett teaches Contracts, Torts, Competition Policy, Economic Analysis of Law, Law & New Technologies, and Legal Methods.In 2019, Professor Niblett gave a TEDx talk on machine learning and law. In addition to his academic career, Professor Niblett is a co-founder of Blue J, a legal tech startup that helps predict legal outcomes in tax and employment law.\nSee also Professor Niblett's SSRN page.\nEducationPh.D. - Economics, Harvard University (2009)M.A. - Economics, Harvard University (2006)LL.B. (Hon.) - University of Melbourne (2003)B.Com. (Hon. in Econ.) - University of Melbourne (2003)\nOther info\nSelected publications2022The Limits of Public Contract Law, Law & Contemporary Problems (forthcoming 2022) [with Anthony J. Casey]The Present and Near Future of Self-Driving Contracts, in Ernest Lim & Philip Morgan (ed), Cambridge Handbook on Private Law and Artificial Intelligence (2022, Cambridge Univ. Press) [with Anthony J. Casey] 2021Micro-directives and Computational Merger Review, 1 Stanford Journal of Computational Antitrust 132 (2021) [with Anthony J. Casey]Up to the Task: Why Canadians don’t need sweeping changes to competition policy to handle Big Tech, MacDonald Laurier Institute Commentary (November 2021) [with D. Daniel Sokol]Artificial Intelligence and Regulation, in Pina D'Agostino, Carole Piovesan, & Aviv Gaon (ed), Leading Legal Disruption: AI and a Toolkit for Lawyers and the Law (2021, Thomson Reuters)Predictive Analytics, in Jesse Beatson, Gerald Chan, & Jill Presser (ed), Litigating Artificial Intelligence (2021, Emond Publishing)Litigation Analytics, in Noah Waisberg & Alexander Hudek (ed), AI for Lawyers: How Artificial Intelligence is Transforming Law Practice and Careers (2021, Wiley Publishing) 2020Will Robot Judges Change Litigation and Settlement Outcomes? A First Look at the Algorithmic Replication of Prior Cases, M.I.T. Computation Law Report, vol. 2.0 (2020) [with Anthony J Casey]Algorithms as Legal Decisions: Gender Gaps and Canadian Employment Law in the 21st Century, 71 University of New Brunswick Law Journal 112 (2020)The Effect of a Change in a Legal Rule, in Yun-chien Chang (ed.), Selection and Decision in Judicial Process Around the World: Empirical Inquiries (2020, Cambridge University Press)Data Analytics and Tax Law, in Roland Vogl, Research Handbook on Big Data Law (2020) [co-authored with Ben Alarie & Albert H. Yoon] 2019A Framework for the New Personalization of Law, 86 Univ. of Chicago Law Review 333 (2019) [co-authored with Anthony J. Casey] 2018How Artificial Intelligence Will Affect the Practice of Law, 68 Univ. of Toronto Law Journal 106 (2018) [co-authored with Ben Alarie & Albert H. Yoon]The Application of Machine Learning to Constitutional Law, in David S. Law & Malcolm Langford (eds.), Research Methods in Constitutional Law Handbook (2018, Elgar) [with Albert H. Yoon]        Regulation Reform in Ontario: Machine Learning and Regulation, 43(3) C.D. Howe Institute Commentary 507 (2018) 2017Unintended Consequences: The Regressive Effects of Increased Access to Courts, 14(1) Journal of Empirical Legal Studies 5 (2017) [co-authored with Albert H. Yoon]The Death of Rules and Standards, 92(4) Indiana Law Journal 1401 (2017) [co-authored with Anthony J. Casey]featured in The Economist: If Computers Wrote Laws: Decisions Handed Down By Data (July 16, 2016)Self-Driving Contracts, 43(1) Journal of Corporation Law 101 (2017) [co-authored with Anthony J. Casey]    Regulation by Machine, Journal of Machine Learning Research (W&CP) (2017) [co-authored with Ben Alarie & Albert H. Yoon]On the Efficiency of the Common Law: An Application to the Recovery of Rewards, 43(3) European Journal of Law & Economics 393 (2017)Computational Legal Research and the Advocate of the Future, 36 Advocates Quarterly 12 (2017) [co-authored with Ben Alarie & Albert H. Yoon]Delaying Declarations of Constitutional Validity, in Frank Fagan & Saul Levmore (eds.), The Timing of Lawmaking (2017, Elgar) 2016Using Machine Learning to Predict Outcomes in Tax Law, 58(3) Canadian Business Law Journal 231 (2016) [co-authored with Ben Alarie & Albert H. Yoon]Self-Driving Laws, 66(4) University of Toronto Law Journal 429 (2016) [co-authored with Anthony J. Casey]Law in the Future, 66(4) University of Toronto Law Journal 423 (2016) [co-authored with Benjamin Alarie & Albert H. Yoon]Friendly Precedent, 57 William & Mary Law Review 1795 (2016) [co-authored with Albert H. Yoon] 2015Judicial Disharmony: A Study of Dissent, 42 International Review of Law & Economics 60 (2015) [co-authored with Albert H. Yoon]Hostile Takeovers and Overreliance, 38 Seattle University Law Review 595 (Symposium edition, 2015) 2014Noise Reduction: The Screening Value of Qui Tam, 91(5) Washington University Law Review 1169 (2014) [co-authored with Anthony J. Casey] 2013 and earlierCase-by-Case Adjudication and the Path of the Law, 42(2) Journal of Legal Studies 303 (2013)Tracking Inconsistent Judicial Behavior, 34 International Review of Law & Economics 9 (2013) The Evolution of a Legal Rule, 39(2) Journal of Legal Studies 325 (2010) [co-authored with Richard A. Posner and Andrei Shleifer] -- Reprinted in Andrei Shleifer, The Failure of Judges and the Rise of Regulators (MIT Press, 2012)Do Judges Cherry Pick Precedents to Justify Extra-Legal Decisions, 70(1) Maryland Law Review 234 (Fall 2010)Structural and Behavioural Market Power under the Trade Practices Act: An Application to Predatory Pricing, 32(2) Australian Business Law Review 83 (2004) (co-authored with Joshua S. Gans and Stephen P. King)  &amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;lt;div class=\"statcounter\"&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;gt;&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;lt;a title=\"drupal analytics\" href=\"http:\/\/statcounter.com\/drupal\/\" target=\"_blank\"&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;gt;&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;lt;img class=\"statcounter\" src=\"http:\/\/c.statcounter.com\/8006513\/0\/19c7726f\/1\/\" alt=\"drupal analytics\"&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;gt;&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;lt;\/a&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;gt;&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;lt;\/div&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;gt;\nCurriculum Vitae\nAll Publications\nSee also Professor Niblett's SSRN page.",
    "keywords":" Law & Economics; Innovation; Contracts; Judicial Behaviour; Competition Policy"
  },
  {
    "name":"Phillips, Jim",
    "phone":"416-978-4223",
    "email":"j.phillips@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/jim-phillips",
    "bio":"\nProfessor\nJackman Law BuildingRoom J43478 Queen's ParkToronto, Ontario M5S 2C5\nJim Phillips (M.A. Edinburgh, Ph.D. (History) and LL.B. Dalhousie) is Professor in the Faculty of Law and and is cross-appointed to the Department of History and the Centre for Criminology and Socio-Legal Studies. He was a law clerk to Madam Justice Wilson of the Supreme Court of Canada prior to joining the University, and was Associate Dean of the Faculty of Law 1994-1997. He teaches property and legal history, and was the winner of the Mewett Award for Excellence in Teaching in 2001. In 1991, 1998, 2001, 2003, 2006, 2015 and 2016 he was elected by the graduating class to speak at their post-convocation reception.His research is principally in legal history, and he has coedited four volumes in the Osgoode Society for Canadian Legal History series of Essays in the History of Canadian Law. His most recent book is A History of Law In Canada: Volume 1, Beginnings to 1866, with Philip Girard and Blake Brown. Volume 2, Law for a New Dominion, 1867-1914, will be published in 2022. He was Director of the Centre of Criminology at the University of Toronto 2003-2005. In 2013 he was awarded the David Mundell Medal by the Ontario Ministry of the Attorney-General for excellence in legal writing. He is also active in debates on the future of public and accessible legal education at the University of Toronto.\nEducationM.A. - University of Edinburgh (1976)Ph.D. - History, Dalhousie University (1983)LL.B. - Dalhousie University (1987)\nAcademic appointmentsAlso appointed to Department of History and Centre of Criminology\nOther serviceEditor-in-Chief, Osgoode Society for Canadian Legal History\nSelected publicationsA History of Law In Canada: Volume 1, Beginnings to 1866 (Toronto: Osgoode Society for Canadian Legal History and University of Toronto Press,  2018), with Philip Girard and Blake Brown\"Judicial Independence in British North America, 1825-1867: Constitutional Principles, Colonial Finances, and the Perils of Democracy,\" Law and History Review, Vol 34 , No 3,  2016, pp. 689-743“Manitoba Fisheries v. The Queen: The Origins of Canada’s De Facto Expropriation Doctrine,” in B. Ziff,  E. Tucker, and J. Muir, eds., Canadian Property Law Stories (Osgoode Society for Canadian Legal History and Irwin Law, 2012) (with Jeremy Martin), pp. 257 – 299“Too Many Courts and Too Much Law: The Politics of Judicial Reform in Nova Scotia, 1830-1841,” in Law and History Review, vol 30, No 1, February 2012 (with Bradley Miller), pp. 89-133“Why Legal History Matters,” Victoria University of Wellington Law Review, Vol. 41, 2010,  pp. 293 - 316Murdering Holiness: The Trials of Franz Creffield and George Mitchell (Vancouver: University of British Columbia Press, 2003) - with Rosemary Gartner“Origins to Confederation: The Supreme Court, 1754-1867,\"  in P. Girard, J. Phillips, and J.B. Cahill, eds., The Supreme Court of Nova Scotia 1754-2004: From Imperial Bastion to Provincial Oracle (Toronto: Osgoode Society for Canadian Legal History and University of Toronto Press,  2004), pp. 53 - 139 - (with J. Barry Cahill)\nResearch areasLegal HistoryProperty Law\nAll Publications",
    "keywords":" Legal History; Property; Criminology; Teaching; Legal Writing"
  },
  {
    "name":"Prado, Mariana Mota",
    "phone":"416-978-5086",
    "email":"mariana.prado@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/mariana-mota-prado",
    "bio":"\nProfessor; William C. Graham Chair in International Law and Development\nFlavelle House78 Queen's ParkToronto, Ontario M5S 2C5\nMariana Mota Prado obtained her law degree (LLB) from the University of Sao Paulo, and her master's (LLM) and Doctorate (JSD) from Yale Law School. She is currently a Professor at the Faculty of Law, University of Toronto, where she was also the Associate Dean for the Graduate Programs from 2014 to 2019. She has published extensively on law and development, including three co-authored books with Michael J. Trebilcock: Institutional Bypasses: A Strategy to Promote Reforms for Development (Cambridge University Press, 2019), Advanced Introduction to Law and Development (Edward Elgar, 1st ed. 2014; 2nd ed. 2021), and What Makes Poor Countries Poor (Edward Elgar, 2011). A Brazilian national, she has taught courses at the Centre for Transnational Legal Studies in London, Direito Rio - Getulio Vargas Foundation Law School in Brazil, ITAM Law School in Mexico, Los Andes Law School in Colombia, Universidad Torcuato Di Tella in Argentina and University of Puerto Rico School of Law in the United States. Her scholarship focuses on law and development, corruption and comparative law.\nSee also Professor Prado's SSRN page.\nEducationLL.B., University of São Paulo, BrazilLL.M., Yale Law School, United StatesJ.S.D., Yale Law School, United States\nAcademic appointmentsAssistant Professor, 2006 - 2011Associate Professor, 2011 - 2019Associate Dean, 2014 - 2019Full Professor, 2019 -\nSelected publicationsInstitutional Bypasses: A Strategy to Promote Reforms for Development (with M. Trebilcock), Cambridge University Press (2019).Advanced Introduction to Law and Development (with M. Trebilcock), Edward Elgar (2nd e. 2021).“Using Criminal Law to Fight Corruption: The Potential, Risks and Limitations of Operation Car Wash (Lava Jato)” (with Marta Rodriguez Machado), American Journal of Comparative Law (2022)“New Progressivism and Its Implications for Institutional Theories of Development” (with Evan Rosevear and Michael J. Trebilcock), Development Policy Review (2020)\nResearch areasAdministrative LawLaw and GlobalizationLaw and International Development\nAll Publications\nSee also Professor Prado's SSRN page.\nTwitter@MMotaPrado",
    "keywords":" Law and Development; Corruption; Comparative Law; Transnational Legal Studies; Reforms for Development"
  },
  {
    "name":"Regehr, Cheryl",
    "phone":"416-978-2122",
    "email":"provost@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/cheryl-regehr",
    "bio":"\nVice-President and Provost\nSimcoe Hall 27 King’s College Circle, Room 225 Toronto, ON  M5S 1A1\nFaculty of Social Work biography\nCheryl Regehr is the Vice-President and Provost for the University of Toronto. Former Dean of the Factor-Inwentash Faculty of Social Work, she is a Professor in the Faculty of Social Work, and has cross-appointments to the Faculty of Law and the Institute for Medical Sciences at University of Toronto.Professor Regehr’s practice background includes over 20 years of direct service in forensic social work and emergency mental health and in the administration of mental health programs, specializing in civil litigation and criminal court assessments of trauma victims and violent offenders, and organizationally based trauma interventions. She was the director of the Crisis Response Team at Pearson International Airport, served on the mental health advisory for the Department of National Defence and Veteran’s Affairs Canada, and currently is a member of the CIHR Mental Health Advisory Group for COVID-19. In 2004, she was awarded the Amicus Award by the American Academy of Psychiatry and the Law for her contributions to forensic mental health.Professor Regehr’s six books and over 150 scholarly articles focus on forensic mental health; trauma and recovery; and stress, trauma and decision-making in high stress professions. This research was has been recognized by the International Campbell Collaboration for Systematic Reviews and the American Academy of Psychiatry and the Law. Her current SSHRC funded research projects involve testing a new model for improving professional decision-making in situations of risk and uncertainty; and understanding trauma in archivists. A further project explores the impact of video evidence of violent crime on those involved in the justice system.\nEducationPhD, Faculty of Social Work, University of Toronto (1995)MSW, Faculty of Social Work, University of Toronto (1980)BA, Department of Psychology, Wilfrid Laurier University (1978)\nAcademic appointmentsProfessor, Faculty of Social Work (1999-present)Cross-appointed Faculty Member, Faculty of Law (2002-present)Member, Institute for Medical Science (1998-present)\nAwards and distinctionsDoctor of Letters (Honorary), Wilfrid Laurier University (2017)Angela Hildyard Leadership Award, Senior Academic Administrators of Canada (2017)International Campbell Collaboration for Systematic Reviews, Leonard Gibbs Award (2013)Amicus Award (for contributions to forensic psychiatry), American Academy of Psychiatry and the Law (2004)Sandra Rotman Chair, Faculty of Social Work (2003-2009)Teacher of the year, Faculty of Social Work (2001, 2002, 2003)\nOther serviceCentre for Research Libraries, Chicago (2016-2020)University Health Network- Board of Trustees (2009-2020)CIHR Mental Health Advisory on COVID-19 (2020)Council of Ontario Universities - Quality Council (2010-2013)Department of National Defence and Veterans Affairs Canada - Mental Health Advisory Group (2009-2010)Baycrest Health Sciences Centre - Board of Directors (2008-2011)\nSelected publicationsGlancy, G. & Regehr, C. (2020) Canadian Landmark Cases in Forensic Mental Health.  Toronto: University of Toronto Press. https:\/\/utorontopress.com\/ca\/canadian-landmark-cases-in-forensic-mental-health-4 Regehr, C. (2018) Stress, Trauma and Decision-Making for Social Work.  New York: Columbia University Press. https:\/\/cup.columbia.edu\/book\/stress-trauma-and-decision-making-for-social-workers\/9780231180139Regehr, C. & Kanani, K. (2015\/2010\/2006) Essential Law for Social Work Practice in Canada. Toronto: Oxford University Press http:\/\/www.oupcanada.com\/catalog\/9780195430776.html Regehr, C. & Glancy, G. (2021\/2014\/2010) Mental Health Social Work in Canada.  Toronto: Oxford University Press. http:\/\/www.oup.com\/us\/catalog\/general\/subject\/SocialWork\/?view=usa&ci=9780195429718\nResearch areasHealth Law",
    "keywords":" Forensic mental health; Trauma and recovery; Stress, trauma and decision-making; Professional decision-making; Video evidence of violent crime"
  },
  {
    "name":"Ripstein, Arthur",
    "phone":"416-978-0735",
    "email":"arthur.ripstein@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/arthur-ripstein",
    "bio":"\nProfessor of Law and Philosophy, University Professor; Howard Beck, Q.C. Chair\nAddress: Jackman Law Building (Room J322)78 Queen's ParkToronto, Ontario M5S 2C5  Secondary Address: Jackman Humanities Building (Room 506)170 St. George St.Toronto, Ontario M5R 2M8\nArthur Ripstein is Professor of Law and Philosophy and University Professor. He was appointed to the Department of Philosophy in 1987, promoted to Full Professor in 1996, appointed to the Faculty of Law in 1999, and appointed to the rank of University Professor in 2016. He was awarded the Killam prize in humanities in 2021.  He served as Chair of the Department of Philosophy 2011-14 and as Acting Chair 2018-19.  He received a doctorate in philosophy from the University of Pittsburgh, a master’s degree in law from Yale, and an undergraduate degree from the University of Manitoba.Professor Ripstein’s research and teaching interests include torts, legal theory, political philosophy and Kant. In addition to numerous articles in legal theory and political philosophy, he is the author of Kant and the Law of War (Oxford 2021), Rules for Wrongdoers (Oxford 2021),  Private Wrongs (Harvard 2016), Force and Freedom: Kant’s Legal and Political Philosophy (Harvard 2009) and Equality, Responsibility and the Law (Cambridge 1999). He is editor of Ronald Dworkin (Cambridge 2007) and co-editor of Waheed Hussein’s posthumous book,, Living with the Invisible Hand, (Oxford University Press, forthcoming 2023), Law and Morality (Toronto 1996, second edition 2001, third edition 2007), and Practical Rationality and Preference (Cambridge 2001). He was awarded a Killam Fellowship in 2016, and the Killam Prize in 2021, both by the Canada Council for the Arts. He served for 15 years as Associate Editor of Philosophy and Public Affairs, for which he is now Advisory Editor. He is a former Associate Editor of Ethics and the Canadian Journal of Philosophy, serves on the editorial board of Legal Theory, and is Advisory Editor of the Canadian Journal of Law and Jurisprudence. His popular work has appeared on Ideas on CBC Radio One. Video:Kissel Lecture at Harvard University, “Perpetual War or Perpetual Peace?”Lecture at University of Girona “A Wrong Personal to You.”Audio: Society for Applied Philosophy Annual Lecture, King’s College London, “Reclaiming Proportionality.” An interview with Ripstein about the lecture.Listen to Ripstein’s Tanner Lectures on Human Values  “Rules for Wrongdoers,” and “Combatants and Civilians” delivered at Berkeley in April 2019, together with comments from Christopher Kutz, Oona Hathaway, and Jeff McMahan. Read the Transcripts 1 and 2.Listen to an interview with Ripstein about the Killam prize on CBC Radio Ideas (interview starts at 24:00)Listen to Ripstein Kant and Private Law on the Private Law PodcastListen to Ripstein on Kant and the Law of War on the Conversations on Globalization and Law PodcastListen to Ripstein on Kant and the Law of War on the Political Theory Review PodcastInterviews:Read an interview with Ripstein in Noesis (Interview begins on p. 48)Read an interview with Ripstein about graduate supervision.\nSee also Professor Ripstein's PhilPapers Page with links to many publications (requires free subscription)\nEducationB.A. (Hons.) – University of Manitoba (1981)M.A. – University of Pittsburgh (1984)Ph.D. – University of Pittsburgh (1986)M.S.L. – Yale Law School (1994)\nAwards and distinctions• Killam Prize for the Humanities, Canada Council for the Arts 2021 (Annual Award “awarded to active Canadian scholars who have distinguished themselves through sustained excellence, making a significant impact in their respective fields.”)• Journal of the History of Philosophy Book Prize 2022 (Annual Award)• Howard L Beck, QC Chair, Faculty of Law, University of Toronto, 2021.• JJ Berry Smith Doctoral Supervision Award (Annual University-Wide award for one faculty member in humanities or social sciences, 2019).• Tanner Lecturer, University of California Berkeley (Annual Lecture Series, 2019)• University Professor (Special rank reserved for 2% of tenured research faculty, 2016)• Killam Fellowship, Canada Council for the Arts (two year research fellowship 2016)• Faculty Award, University of Toronto Alumni Association (Annual Award given to one faculty member across the University for Excellence in Research and Teaching over an extended period, 2012.)• Canadian Philosophical Association Book Prize (Biennial prize 2011)• Fellow, Royal Society of Canada (2010)• Inaugural Nicholas Hoare\/Renaud Bray Book Prize of the Canadian Philosophical Association (2001)• Connaught Fellowship, (2000)• Rockefeller Visiting Fellowship, Princeton University (1995-1996)\nSelected publicationsKant and the Law of War (Oxford University Press, 2021) See if your institution has online accessOxford University Press published a companion volume of essays about it, with Ripstein’s replies The Public Uses of Coercion and Force: From Constitutionalism to War edited by Ester Herlin-Karnell and Enzo Rossi (Oxford, Oxford University Press, 2021).Rules for Wrongdoers (Oxford University Press, 2021). See if your institution has online access Private Wrongs (Harvard University Press, 2016).Read Scott Hershovitz’s review in the Harvard Law Review.Force and Freedom: Kant’s Legal and Political Philosophy (Harvard University Press, 2009).Read Allen Wood’s Review in Notre Dame Philosophical Reviews. Read Nick Sage’s Review of Freedom and Force, (a book about Ripstein’s work) in the Canadian Journal of Law and Jurisprudence. Equality, Responsibility and the Law (Cambridge University Press, 1998)Read Richard Arneson’s review in the Canadian Journal of Philosophy.Looking for a different Ripstein instead?Read about Mexican filmmaker Arturo Ripstein here.Read about Arthur Ripstein’s mother, Ellen, who was a spy and later Canada’s first woman stockbroker, here.Watch the other Ellen Ripstein, his cousin the crossword puzzle solver, win the world crossword championship here.Learn about the Ripstein Procedure here.\nCurriculum Vitae\nResearch areasLegal TheoryTort Law and Tort Theory\nAll Publications\nSee also Professor Ripstein's PhilPapers Page with links to many publications (requires free subscription)",
    "keywords":" Legal Theory; Political Philosophy; Kant; Torts; Equality"
  },
  {
    "name":"Rittich, Kerry",
    "phone":"416-978-1637",
    "email":"kerry.rittich@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/kerry-rittich",
    "bio":"\nProfessor\nJackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5\nKerry Rittich is Professor of Law, Women and Gender Studies, and Public Policy and Governance at the University of Toronto. She has served as Associate Dean, JD Program.  She writes in the areas of labour law, international institutions and global governance, law and development, and gender and critical theory. Publications include Recharacterizing Restructuring: Law, Distribution and Gender in Market Reform (Kluwer Law International, 2002); (with Joanne Conaghan), Labour Law, Work and Family: Critical and Comparative Perspectives, (OUP, 2005); “The Future of Law and Development: Second Generation Reforms and the Incorporation of the Social” in David M. Trubek and Alvaro Santos eds., The New Law and Economic Development: A Critical Appraisal (CUP, 2006); “Black Sites: Locating the Family and Family Law in Development” (American Journal of Comparative Law, 2010); “The Right to Work and Labour Market Flexibility: Labour Market Governance Norms in the International Order”, V. Mantouvalou, ed., The Right to Work: Legal and Philosophical Perspectives (Hart, 2015) and (with Guy Mundlak) “The challenge to comparative labor law in a globalized era”, M. Finkin and G. Mundlak, eds., Comparative Labor Law (Elgar, 2015); and “Theorizing International Law and Development”, F. Hoffman and A. Orford, eds., Oxford Handbook of the Theory of International Law (OUP, 2016).  She has been the Mackenzie King Visiting Professor of Canadian Studies at Harvard University, Visiting Professor at the Watson Institute for International Studies at Brown University, and Professor and Academic Director of the Center for Transnational Legal Studies, London.\nSee also Professor Rittich's SSRN page.\nResearch areasCritical Legal TheoryFeminist Analysis of LawLabour LawLaw and GlobalizationLaw and International Development\nAll Publications\nSee also Professor Rittich's SSRN page.",
    "keywords":" Labour Law; International Institutions; Global Governance; Gender and Critical Theory; Law and Development"
  },
  {
    "name":"Roach, Kent",
    "phone":"416-946-5645",
    "email":"kent.roach@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/kent-roach",
    "bio":"\nProfessor\nJackman Law BuildingRoom J446 78 Queen's ParkToronto, Ontario M5S 2C5\nKent Roach is Professor of Law at the University of Toronto Faculty of Law. He is a former law clerk to Justice Bertha Wilson of the Supreme Court of Canada. Professor Roach has been editor-in-chief of the Criminal Law Quarterly since 1998. In 2002, he was elected a Fellow of the Royal Society of Canada. In 2013, he was one of four academics awarded a Trudeau Fellowship in recognition of his research and social contributions. In 2015, he was appointed a Member of the Order of Canada. In 2016, named (with Craig Forcese) one of the top 25 influential lawyers in Canada (change-maker category) by Canadian Lawyer.  He was awarded the Molson Prize for the social sciences and humanities in 2017.He is the author of Constitutional Remedies in Canada (winner of the Owen best law book Prize); Due Process and Victims’ Rights (short listed for the Donner Prize for public policy), The Supreme Court on Trial (same); (with Robert J. Sharpe) Brian Dickson: A Judge’s Journey (winner of the Dafoe Prize) and The 9\/11 Effect: Comparative Counter-Terrorism (winner of the Mundell Medal); (with Craig Forcese) False Security: The Radicalization of Canadian Anti-Terrorism (winner of the Canadian Law and Society Association best book prize);  Canadian Justice, Indigenous Injustice: The Gerald Stanley\/Colten Boushie Case (short listed for the Shaughnessy Cohen prize for political writing); Remedies for Human Rights Violations: A Two-Track Approach to Supra-national and National Law (runner up for Canadian Council on International law book prize for 2020-21) and Canadian Policing: Why and How it Must Change (finalist for the 2022 Balsillie Prize in Public Policy.) He is also the author of the Criminal Law and Charter volumes in Irwin Law’s essentials of Canadian law series. His next book Wrongfully Convicted: Guilty Pleas, Imagined Crimes and What Canada Must Do To Safeguard Justice will be published by Simon and Schuster in 2023.  He is the co-editor of 13 collections of essays including Comparative Counter-Terrorism published by Cambridge University Press in 2015 and 3 casebooks  He has also written over 275 articles and chapters published in Australia, China, Hong Kong, India, Israel, Italy, Japan, Singapore, South Africa, the United Kingdom and the United States, as well as in Canada.Professor Roach has served as research director for the Goudge Inquiry into Pediatric Forensic Patholology,  for the Commission of Inquiry into the Investigation of the Bombing of Air India Flight 182, for the Independent Civilian Review of Toronto Police Missing Persons Investigations and for the public consultations resulting in A Miscarriage of Justice Commission report. He served as volume lead for the Truth and Reconciliation Commission's Report on the Legacy of Residential Schools  He was a member of the research advisory committees for the inquiry into the rendition of Maher Arar, the Ipperwash Inquiry into the killing of Dudley George and the Commission into the 2022 Public Order Emergency.  He has been a member of Canadian Council of Academies expert panels on policing and subsequently on Indigenous policing. He is also co-founder of the Canadian Registry of Wrongful Convictions at https:\/\/www.wrongfulconvictions.ca\/Professor Roach has won awards for his pro bono work and contributions to civil liberties. He has represented Aboriginal and civil liberties groups in many interventions before the courts, including Gladue, Wells, Ipeelee and Anderson on sentencing Indigenous  offenders, Latimer on mandatory minimum sentences, Stillman, Dunedin Construction,  Ward, Conseil Francophone and G v. Ontario  on Charter remedies, Golden on strip searches, Khawaja on the definition of terrorism, Williams and Chouhan on jury selection and Corbiere and Sauve on voting rights.\nSee also Professor Roach's SSRN page.\nEducationB.A. - University of Toronto (1984)LL.B. - University of Toronto (1987)LL.M. - Yale Law School (1988)\nAcademic appointmentsCo-Director Centre for Transnational Legal Studies, Winter 2020Member of Canadian Council of Academies Task Force on Indigenous Policing (2017)Director, Counter-Terrorism Law and Policy Group, Global Justice Lab, Munk School of Global Affairs, University of Toronto (2016)General Reporter on Counter-Terrorism Law, XIX Comparative Law   Congress, Vienna, 2014Visiting Professor at the Centre for Transnational Legal StudiesVisiting and Conjoint Professor at the University of New South WalesVisiting Professor at the National University of SingaporeEditor in chief of the Criminal Law Quarterly (1998-present)\nAwards and distinctionsMolson Prize in social sciences and humanities (2017)Liberty Award by Canadian Civil Liberties Association (with Craig Forcese) (2017)Canadian Law and Society Award for best book award (with Craig Forcese) (2016)Reg Robson award for contributions to civil liberties (with Craig Forcese)  (2016)Appointed Member of the Order of Canada (2015)Trudeau Fellowship (2013)David Mundell Award for legal writing  (2011)TRC teaching award (2020)Mewett Award for teaching (2008)Lexpert Platinum Award for pro-bono work by a legal academic (2010)JW Dafoe Prize for book that best contributes to understanding of Canada (with R.J. Sharpe) (2003)Fellowship of the Royal Society of Canada (2002)Walter Owen Book Prize for best law book (1997)\nSelected publicationsWrongfully Convicted: Guilty Pleas, Imagined Crime and What Canada Must Do To Safeguard Justice at https:\/\/www.simonandschuster.com\/books\/Wrongfully-Convicted\/Kent-Roach\/9781668023662Canadian Policing: Why and How it Must Change (Toronto: Irwin Law, Delve Publishing, 2022) at https:\/\/irwinlaw.com\/product\/canadian-policing-why-and-how-it-should-cha...Criminal Law 8th ed (Toronto: Irwin Law, 2022) at https:\/\/irwinlaw.com\/product\/criminal-law-8-e\/Remedies for Human Rights Violations: A Two-Track Approach to Supra-national and National Law (Cambridge: Cambridge University Press, 2021) at https:\/\/www.cambridge.org\/ca\/academic\/subjects\/law\/constitutional-and-ad...RemedCanadian Justice, Indigenous Injustice The Gerald Stanley and Colten Boushie Case (Montreal: McGill Queens Press, 2019) at https:\/\/www.mqup.ca\/canadian-justice--indigenous-injustice-products-9780...(with Robert J. Sharpe) The Canadian Charter of Rights and Freedoms 7th ed (Toronto: Irwin Law, 2021) at https:\/\/irwinlaw.com\/product\/the-charter-of-rights-and-freedoms-7th-edit...The Supreme Court on Trial: Judicial Activism or Democratic Dialogue revised edition (Toronto: Irwin Law, 2016) at https:\/\/irwinlaw.com\/product\/the-supreme-court-on-trial\/(with Craig Forcese) False Security: The Radicalization of Canadian Anti-Terrorism (Toronto: Irwin Law, 2015) at https:\/\/irwinlaw.com\/product\/false-security\/The 9\/11 Effect: Comparative Counter-Terrorism (Cambridge University Press, 2011) at http:\/\/www.cambridge.org\/us\/knowledge\/isbn\/item6453524\/?site_locale=en_USConstitutional Remedies in Canada, 2nd ed (Toronto: Carswell, 2013 as updated) at https:\/\/store.thomsonreuters.ca\/en-ca\/products\/constitutional-remedies-i...Due Process and Victims’ Rights: The New Law and Politics of Criminal Justice (Toronto: University of Toronto Press, 1999) available at https:\/\/utorontopress.com\/9780802079015\/due-process-and-victims-rights\/\nResearch areasCharter of RightsComparative LawCriminal Law National Security Law and Anti-Terrorism Law\nAll Publications\nSee also Professor Roach's SSRN page.",
    "keywords":" Constitutional Law; Criminal Law; Human Rights; Indigenous Law; Trudeau Fellowship"
  },
  {
    "name":"Sanderson, Douglas",
    "phone":"416-946-5770",
    "email":"d.sanderson@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/douglas-sanderson",
    "bio":"\nAssociate Professor,                                                      \r\nThe Prichard Wilson Chair in Law & Public Policy,                         \r\nDecanal Advisor on Indigenous Issues.\nJackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5\nDouglas Sanderson (Amo Binashii) was managing editor of the inaugural edition of the Indigenous Law Journal in 2002 while a student in the JD program.  He went on to get his LL.M from Columbia University as a Fulbright Scholar. Prof. Sanderson is a member of the Opaskwayak Cree Nation, and he has been deeply engaged in Aboriginal issues from a policy perspective. From 2004-2007 he was a Senior Advisor to the Government of Ontario, first in the Office of the Minister Responsible for Aboriginal Affairs, and later, to the Attorney General.Prof. Sanderson's research areas include Aboriginal and Indigenous legal theory, as well as private law (primarily property law) and public and private legal theory. His work uses the lens of material culture and property theory to examine the nature of historic injustice to Indigenous peoples and possible avenues for redress. Moving beyond the framework of common law property rights and constitutional land\/treaty rights, his scholarship focuses on Aboriginal institutions, post-colonial reconciliation and rebuilding community.  Professor Sanderson's current research interests include the Peace and Friendship Treaties (1600-1763) and the Fur Trade in Canada.Valley of the Birdtail, a book of narrative non-fiction, and co-authored with former student, will be published by Harper Collins in the fall of 2022.\nEducationB.A. (Hon) - Simon Fraser University (1998)J.D. - University of Toronto (2003)LL.M. - Columbia University (2004)\nAcademic appointmentsFaculty Advisor, Aboriginal Law Students Association (2007-Present)Visiting scholar, University of Toronto, Faculty of Law (2007-2009)\nAwards and distinctionsStudents Law Society Partnership Award, University of Toronto (2009-2010) Canada US Fulbright Scholar, Columbia University (2003-2004)Harlan Fiske Stone Scholar, Columbia University (2003-2004)Ludwik and Estelle Jus Memorial Human Rights Prize (2021)\nOther serviceMember of the LHSMember of the Bar, OntarioMember of the Osgoode Historical Society\nOther infoMember of the Law Society of Upper Canada\nResearch areasAboriginal LawIndigenous Legal TraditionsLegal HistoryLegal TheoryPolitical Philosophy and TheoryProperty Law\nAll Publications",
    "keywords":" Aboriginal and Indigenous legal theory; Private law; Property law; Public and private legal theory; Post-colonial reconciliation."
  },
  {
    "name":"Schneiderman, David",
    "phone":"416-978-2677",
    "email":"david.schneiderman@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/david-schneiderman",
    "bio":"\nProfessor\nJackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5\nDavid Schneiderman, B.A (McGill) 1980, LL.B. (Windsor) 1983, LL.M. (Queen's) 1993, is Professor of Law and Political Science. He was called to the Bar of British Columbia in 1984 where he practised law and then served as Research Director of the Canadian Civil Liberties Association in Toronto from 1986-89. He was Executive Director of the Centre for Constitutional Studies, an interdisciplinary research institute, at the University of Alberta from 1989-99. Professor Schneiderman has authored numerous articles on Canadian federalism, the Charter of Rights, Canadian constitutional history, and constitutionalism and globalization. He has authored Constitutionalizing Economic Globalization: Investment Rules and Democracy's Promise (Cambridge University Press, 2008) and co-authored The Last Word: Media Coverage of the Supreme Court of Canada with Florian Sauvageau and David Taras (UBC Press, 2006).  He also has edited several books, including The Quebec Decision (1999); Charting the Consequences: The Impact of the Charter of Rights on Canadian Law and Politics (1997) with Kate Sutherland; Police Powers in Canada: The Police Power in History, Law, and Politics (1993) with R.C. MacLeod; Social Justice and the Constitution: Perspectives on a Social Union for Canada (1992) with Joel Bakan; and Freedom of Expression and the Charter (1991). He is founding editor of the quarterly Constitutional Forum Constitutionnel and founding editor-in-chief of the journal Review of Constitutional Studies.\nSee also Professor Schneiderman's SSRN page.\nResearch areasCanadian Constitutional LawInternational Law\nAll Publications\nSee also Professor Schneiderman's SSRN page.",
    "keywords":" Canadian Federalism; Charter of Rights; Constitutionalism; Globalization; Constitutional History"
  },
  {
    "name":"Shachar, Ayelet",
    "phone":"416-978-1620",
    "email":"ayelet.shachar@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/ayelet-shachar",
    "bio":"\nR.F. Harney Chair in Ethnic, Immigration and Pluralism Studies\r\nProfessor of Law, Political Science & Global Affairs, and former Canada Research Chair in Citizenship and Multiculturalism\nJackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5\nAyelet Shachar (FRSC) is Professor of Law, Political Science, and Global Affairs, and the holder of the R.F. Harney Chair in Ethnic, Immigration and Pluralism Studies at the University of Toronto, where she directs the Harney Program at the Munk School of Global Affairs & Public Policy. Previously, she was a Scientific Member of the Max Planck Society—one of the foremost research organizations in the world—and Director at the Max Planck Institute for the Study of Religious and Ethnic Diversity. She was awarded the Gottfried Wilhelm Leibniz Prize in 2019. Before her recruitment to the Max Planck Society, she held the Canada Research Chair in Citizenship and Multiculturalism. At Goethe University Frankfurt she is affiliated with both the Faculty of Law and the Normative Orders Research Centre, where she is the leader of the \"Transformations of Citizenship\" research group. Shachar has published extensively on the topics of citizenship theory, immigration law, cultural diversity and women's rights, new border regimes, highly skilled migration and global inequality, and the marketization of citizenship. Her research is motivated by the need to develop new legal principles to address some of the most pressing issues of our time: how to live together in diverse societies, how to grant rights to those who lack formal access to membership, and how to tame the ever-expanding reach of borders and migration control in a world of persistent inequality.Shachar is the author of Multicultural Jurisdictions: Cultural Differences and Women's Rights (Cambridge University Press, 2001 & 2009), for which she won the American Political Science Association 2002 Foundations of Political Theory Section Best First Book Award. This work has inspired a new generation of thinking about how to best mitigate the tensions between gender equality and religious diversity. It has also proved influential in the real world, intervening in actual public policy and legislative debates. It has been cited by, among others, England's Archbishop of Canterbury (who described Shachar's work as \"highly original and significant\"), Ontario's Ministry of the Attorney General, and the Supreme Court of Canada. Over the last twenty years, Multicultural Jurisdictions has become a key reference point for feminist approaches to the study of law and religion.Shachar's work combines \"big ideas\" from law and political theory with innovative problem-solving and institutional design. The Birthright Lottery: Citizenship and Global Inequality (Harvard University Press, 2009) was named 2010 International Ethics Notable Book in recognition of its \"superior scholarship and contribution to the field of international ethics.\" It has created a groundswell of interest among policymakers and academics alike. Located at the intersection of law, economics, and political philosophy, The Birthright Lottery crafts new legal concepts and innovative institutional designs to promote global justice, with the aim of ameliorating the most glaring opportunity inequalities that attach to this system of allocation in today's world. This work has been the topic of special-issue symposiums, international workshops and roundtables, and the subject of essays that have appeared in professional and interdisciplinary publications, including the American Journal of Comparative Law, Ethics & International Affairs, Harvard Law Review, Issues in Legal Scholarship, La Revue Nouvelle, Political Theory, Rorotoko, Nexus, Edge, Tikkun, and the Literary Review of Canada.  Shachar is also the lead editor of the field-defining The Oxford Handbook of Citizenship (Oxford University Press, 2017 & 2020). This work has already emerged as a major reference work in the field for those engaged with citizenship from a philosophical, political, legal and cultural perspective. It has been described by Joseph Weiler as: “The definitive source on a critical concept in political and social life. Innovative in its conception and authoritative in its excitation.” Pratap Mehta observes that “[n]o other single volume achieves the theoretical acuity, historical depth, legal grounding, and sociological analysis of citizenship that this book manages to achieve. It is clear, wide ranging, and admirably un-parochial in the range of its references.”Shachar newest book, The Shifting Border: Legal Cartographies of Migration and Mobility (Critical Powers Series, Manchester University Press, 2020; shortlisted for the 2022 C.B. Macpherson Prize), critically examines the role of territory and new measures of managed migration control in selectively restricting - or, conversely, accelerating - mobility and access to the world’s prosperous countries, as governments seek to regain control over a crucial realm of their allegedly waning sovereign authority. Here, as in her previous writings, Shachar not only reveals the deep currents that are reshaping the terrain of law and mobility, but also seeks to develop innovative legal responses to break the current deadlock as she seeks to refute the claim that applicable solutions are beyond reach or impossible to imagine. This work appears under the auspices of the Critical Powers Series, which is “dedicated to constructing dialogues around innovative and original work in social and political theory”.The Shifting Border has been described by Hiroshi Motomura as “a remarkable book. Essential for understanding government responses to people on the move, Shachar’s vivid description, analytical precision, and reasoned persuasion combine to challenge conventional wisdom about ‘borders’ and how they work. The result: exceptional insights into how migration control can be more just. The Shifting Border offers an indispensable roadmap to immigration and refugee debates all around the world\". A recent LSE book review opines: \"In her impressive book, The Shifting Border, Ayelet Shachar refuses to adhere to what she views as false dichotomies between traditional approaches to a concept (culture, citizenship, borders) and premature diagnoses of the concept’s demise. The force of her argument is consistently oriented towards rethinking the question, offering a new framework to understanding the world. … Shachar’s innovative framework nicely exemplifies the shift from idealized ethical debates to institutional and political analysis.\" \"Reading this essay by Shachar...is like getting the dream dinner invitation to hear cutting-edge thought on borders\" (CHOICE magazine).  Shachar is a global citizen at heart and the recipient of research excellence awards in four different countries (Canada, Israel, Germany, and the United States). She has presented her work across the world and held visiting professorships in leading universities, including the Leah Kaplan Visiting Professor in Human Rights at Stanford Law School and the Jeremiah Smith Jr. Visiting Professor of Law at Harvard Law School. She was also a Member of the Institute for Advanced Study, Princeton, Fulbright Fellow, Distinguished Visiting Scholar at Princeton’s Law and Public Affairs Program (LAPA), Emile Noël Senior Fellow at NYU School of Law, Visiting Scholar at Harvard's Edmond J. Safra Center for Ethics, and the W. M. Keck Fellow in Legal Ethics and Professional Culture at Yale Law School. In recognition of her excellence in research and teaching as a faculty member at Toronto, she has received the University's Provostial Merit Increase Award for five consecutive years. Her work has appeared in leading law reviews, social science, and political philosophy journals, including the Yale Law Journal, Journal of Political Philosophy, Ethics & International Affairs, NYU Law Review, University of Chicago Law Review, Yale Journal of Law & the Humanities, Philosophy and Social Criticism, Jurisprudence, Political Theory, Perspectives on Politics, and Theoretical Inquiries in Law. Beyond contributing to key scholarly debates, she has provided pro-bono consultation to judges, non-governmental organizations, the European Parliamentary Research Services, and the World Bank. She is a member of the Board of Trustees of the Association of Members of the Institute for Advanced Study, Princeton; the Advisory Board of the Boundaries, Membership & Belonging program of the Canadian Institute for Advanced Research (CIFAR); and the Advisory Board of the Max Planck-Cambridge Centre for Ethics, Economics, and Social Change at the University of Cambridge. Shachar earned her LL.B in law and B.A. in political science, summa cum laude, from Tel Aviv University; LL.M. and J.S.D, both from Yale Law School. Before arriving at Yale, she was law clerk to Chief Justice Aharon Barak of the Supreme Court of Israel. She sits on the editorial boards of major peer-reviewed journals and book series in her field, and has delivered countless talks on her research in a range of academic, policy, and popular venues across the globe. In 2014, she was elected Fellow of the Royal Society of Canada. In 2015, she became Director of the Max Planck Institute for the Study of Religious and Ethnic Diversity. In 2017, she was elected member of the Göttingen Academy of Sciences and Humanities (past famous members include the Brothers Grimm and Gauss the mathematician). In 2019, she was awarded the Gottfried Wilhelm Leibniz Prize, Germany's most prestigious research award, for her groundbreaking work on citizenship and the legal frameworks of accommodation in multicultural societies. In 2021, she was appointed the R.F. Harney Chair in Ethnic, Immigration, and Pluralism Studies. Video: Shachar's academic profile, prepared on the occasion of her selection to the Leibniz Prize.Video: Author interview and lecture, \"The Shifting Border in the Time of Covid-19\"  Podcast: \"Rights at the Border\" | Entitled, University of Chicago Law School\nEducationJ.S.D. (Doctor of the Science of Law) Yale Law School (1997)LL.M. (Master of Laws) Yale Law School (1995)B.A. (Political Science) - Tel Aviv University (1993)LL.B. (Bachelor of Laws) Tel Aviv University (1993)\nAcademic appointments* R.F. Harney Chair in Ethnic, Immigration and Pluralism Studies (2021-present)* Edmond J. Safra Center for Ethics, Harvard University, Visiting Scholar (2020)* Director, Max Planck Institute for the Study of Religious & Ethnic Diversity (2015-2020)* Canada Research Chair in Citizenship and Multiculturalism (2007-2015)* University of Toronto, Professor of Law, Political Science & Global Affairs (2007-present)* Harvard Law School, Jeremiah Smith Jr. Visiting Professor of Law (2007-2008)* Stanford Law School, Leah Kaplan Visiting Professor in Human Rights (2006-2007)* University of Toronto, Connaught Research Fellow in the Social Sciences (2005) * Princeton University,  Program in Law and Public Affairs (LAPA), Distinguished Visiting Scholar (2003)* NYU School of Law, Emile Noël Senior Fellow (2003)* Institute for Advanced Study, Princeton, Member (2000-2001)* Yale Law School, W.M. Keck Foundation Fellow in Legal Ethics (1997-1998)* Yale Law School, Tutor-in-Law (1996-1998)\nAwards and distinctions* Canadian Political Science Association (CPSA) CB Macpherson Prize Finalist (2022)* Gottfried Wilhelm Leibniz Prize (2019) awarded to \"exceptional scientists and academics for their outstanding achievements in the field of research\"* Member, Göttingen Academy of Sciences and Humanities (2017)* Fellow of the Royal Society of Canada (FRSC) (2014)* American Political Science Association (APSA) Migration and Citizenship Best Chapter Award (2013) for \"Citizenship\" in the Oxford Handbook of Comparative Constitutional Law* International Studies Association (ISA), International Ethics Book Award (2010) Notable Book Distinction; The Birthright Lottery: Citizenship and Global Inequality (Harvard University Press, 2009)* American Political Science Association (APSA), Foundations of Political Theory Section (2002) Winner of the Best First Book Award for Multicultural Jurisdictions: Cultural Differences and Women’s Rights (Cambridge University Press, 2001)* Canadian Association of Law Teachers (CALT) Scholarly Paper Award (2001) Honorable Mention; “The Puzzle of Interlocking Power Hierarchies: Sharing the Pieces of Jurisdictional Authority,” Harvard Civil Rights-Civil Liberties Law Review (2001)* J.S.D. Tory Writing Award (2007) for \"Reshaping the Multicultural Model: Group Accommodation and Individual Rights,\" Windsor Review of Legal and Social Issues* Una Weiler Excellence Award (1994) for “The Sexuality of Law: The Legal Discourse of Rape,” Tel Aviv University Law Review [Hebrew]\nOther service* World Bank, Expert Consultative Group (ECG), Pro-Bono Advisor (2011-present)* European Parliamentary Research Services (EPRS), Pro-Bono Advisor (2018) * Oxford Studies in Migration and Citizenship (advisory board, 2020-present)* Journal of Politics (editorial board, 2015-2018)* Citizenship Studies (editorial board, 2010-2013)  * Diversities (MPI\/UNESCO editorial board, 2010-present)* University of Toronto Law Journal (editorial board, 2009-2016) * Law & Ethics of Human Rights (editorial board, 2009-present)* Ethnicities (editorial board, 2008-present)* Social Sciences and Humanities Research Council of Canada (SSHRC) National Selection Committee (2008-2009)\nSelected publicationsThe Shifting Border: Legal Cartographies of Migration and Mobility  (Critical Powers Series, Manchester University Press, 2020)The Oxford Handbook of Citizenship (Oxford University Press, 2017)The Birthright Lottery: Citizenship and Global Inequality (Harvard University Press, 2009)Multicultural Jurisdictions: Cultural Differences and Women’s Rights (Cambridge University Press, 2001)Instruments of Evasion: The Global Dispersion of Rights-Restricting Migration Policies110 California Law Review (2022), 967-1009Unequal Access: Wealth as Barrier and Accelerator to Citizenship25 Citizenship Studies (2021), 543-563Beyond Open and Closed Borders: The Grand Transformation of Citizenship11 Jurisprudence (2020), 1-27The Marketization of Citizenship in an Age of Restrictionism32 Ethics & International Affairs (2018), 3-13Golden Visas, Dreams & Ethics in Immigration Carnegie Council podcast interview with Ayelet ShacharOn Citizenship, States, and Markets (with Ran Hirschl)22 Journal of Political Philosophy (2014), 231-257Entangled: Family, Religion and Human Rights    Human Rights: The Hard Questions Edited by Cindy Holder and David Reidy(Cambridge University Press, 2013), 115-135Demystifying Culture10 I-CON International Journal of Constitutional Law (2012), 429-448Picking Winners: Olympic Citizenship and the Global Race for Talent120 Yale Law Journal 2088 (2011)      Earned Citizenship: Property Lessons for Immigration Reform23 Yale Journal of Law & the Humanities (2011), 110-158Privatizing Diversity: A Cautionary Tale from Religious Arbitration in Family Law 9 Theoretical Inquiries in Law 573 (2008)\nResearch areasEquality and Anti-Discrimination LawImmigration and Citizenship LawLaw and GlobalizationLaw and ReligionLegal EthicsLegal TheoryPolitical Philosophy and Theory\nAll Publications",
    "keywords":" Citizenship Theory; Immigration Law; Cultural Diversity; Women's Rights; Global Inequality"
  },
  {
    "name":"Shaffer, Martha",
    "phone":"416-978-1752",
    "email":"m.shaffer@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/martha-shaffer",
    "bio":"\nProfessor\nJackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5\nProfessor Shaffer joined the Faculty of Law in 1990 after serving as a law clerk to Chief Justice Brian Dickson at the Supreme Court of Canada. She holds law degrees from Harvard and U of T.Professor Shaffer teaches Criminal Law, Evidence Law and Legal Methods, and has taught Family Law as well as courses on cultural diversity and gender issues. She writes in the areas of family and criminal law, with a focus on gender, violence against women, and on the use of social science evidence to inform legal reasoning.\nSee also Professor Shaffer's SSRN page.\nAll Publications\nSee also Professor Shaffer's SSRN page.",
    "keywords":" Gender; Violence against women; Social science evidence; Family law; Criminal law"
  },
  {
    "name":"Stacey, Richard",
    "phone":"416-978-4488",
    "email":"richard.stacey@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/richard-stacey",
    "bio":"\nAssociate Professor\nJackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5\nRichard Stacey is an Associate Professor of law at the University of Toronto Faculty of Law. He works in public law, with a research focus is on how governments and their administrative branches uphold and fulfil, or can be encouraged to uphold and fulfil, their constitutional commitments. Richard's undergraduate and law degrees are from the University of the Witwatersrand in South Africa, and his PhD is from New York University. He was law clerk to Justice Kate O’Regan and Justice Bess Nkabinde at the Constitutional Court of South Africa, and has taught at the City University of New York Law School, the University of Witwatersrand and the University of Cape Town. He recently co-edited a collection of essays entitled The Limits and Legitimacy of Referendums (with Richard Albert) published by Oxford University Press, and is currently engaged in a project exploring the connections between popular sovereignty, the rule of law, and referendums.\nAll publications\nEducationPh.D., New York University, 2014LLB, University of the Witwatersrand, 2004BA (Hons), University of the Witwatersrand, 2002\nSelected publications‘Public Law’s Cerberus: A three-headed approach to Charter rights-limiting administrative decisions,’ forthcoming, Canadian Journal of Las and Jurisprudence, 2022The Limits and Legitimacy of Referendums (Oxford: Oxford University Press, 2022) (with Richard Albert).\"The Unnecessary Referendum: Popular Sovereignty in the Constitutional Interregnum\", in Richard Albert and Richard Stacey (eds), The Limits and Legitimacy of Referendums (Oxford: Oxford University Press, 2022).\"Constituting and regulating democracy: Kenya’s electoral commission and the courts in the 2010s\" (with Victoria Miyandazi), (2021) 16 Asian Journal of Comparative Law, s193-s210.\"A Unified Model of Public Law: Charter Values and Reasonableness Review in Canada\" (2021) 71 University of Toronto Law Journal, 338-375.\"The Magnetism of Moral Reasoning and the Principle of Proportionality in Comparative Constitutional Adjudication\", (2019) 67 American Journal of Comparative Law 435.\"A Service Conception of the Constitution: Authority, Justification and the Rule of Law in Proportionality Jurisprudence\" (2019) 9 Constitutional Court Review, 219-245\"The Dilemma of Indigenous Self-Government in Canada: Indigenous Rights and Canadian Federalism\" (2018) 46 Federal Law Review 669.  \"Honour in Sovereignty: Can Crown consultation with Indigenous peoples erase Canada's sovereignty deficit?\", (2018) 68 University of Toronto Law Journal 405.\"Falling short of constitutional norms: Does “normative (in)congruence” explain the courts’ inability to promote the right to water in South Africa?\", (2018) 43 Law & Social Inquiry 796.\"Dynamic Regulatory Constitutionalism: Taking Legislation Seriously in the Judicial Enforcement of Economic and Social Rights\", (2017) 31 Notre Dame Journal of Law, Ethics and Public Policy 85.\"Popular Sovereignty and Revolutionary Constitution-Making” in David Dyzenhaus and Malcolm Thorburn (eds), Philosophical Foundations of Constitutional Law, Oxford: Oxford University Press 2016.\nResearch areasAboriginal LawAdministrative LawCanadian Constitutional LawCharter of RightsComparative LawLegal Theory\nAll publications",
    "keywords":" Public Law; Constitutional Commitments; Popular Sovereignty; Rule of Law; Referendums"
  },
  {
    "name":"Stern, Simon",
    "phone":"416-978-0293",
    "email":"simon.stern@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/simon-stern",
    "bio":"\nProfessor of Law and English; Director, Centre for Innovation Law & Policy; Chair in Innovation Law\nJackman Law Building               Room 47278 Queen's ParkToronto, Ontario M5S 2C5\nList of all publications, or see Prof. Stern's pages on SSRN, academia.edu, google scholar, or ORCID.B.A. (Yale), Ph.D., English (UC Berkeley), J.D. (Yale), member of the Washington, D.C. Bar. While in law school he was Editor-in-Chief of the Yale Journal of Law & the Humanities. After law school he clerked for Ronald M. Gould on the U.S. Court of Appeals for the Ninth Circuit, practiced litigation at Shea & Gardner (now Goodwin Procter) in Washington, D.C., and then served as a Climenko Fellow and Lecturer on Law at Harvard Law School.Prof. Stern teaches and researches in the areas of law and literature, legal history, law and sexuality, and criminal law.  His research focuses on the evolution of legal doctrines and methods in relation to literary and intellectual history. Current research topics include the development of the \"reasonable man\" standard (and its precursors and analogues) since the eighteenth century, and the changing conception of legal fictions between the early modern period and the present. His research has been funded by the Social Sciences and Humanities Research Council, the Foundation for Legal Research, and the American Society for Legal History.He is co-editor (with Robert Spoo) of the series Law and Literature, published by Oxford University Press. With colleagues at other universities in North America, Europe, and the UK, he convenes the Works in Progress series in Law and Literature, which provides a venue for new work in the field. He is also co-editor of Critical Analysis of Law, and a co-editor of the New Rambler Review.In 2012 Prof. Stern was the recipient of the SLS Partnership Award, bestowed by the U of T Students' Law Society in recognition of faculty members who have shown a commitment to student-friendly initiatives and student advocacy.Ph.D. & S.J.D. advising      Prof. Stern supervises dissertation projects related to legal history, law and literature, eighteenth-century literature, criminal law, and law & sexuality. Recent and current projects include:  Michael Donnelly, For All Peoples and All Nations: Anglophone Literature and the Imaginative Work of International Law (1884-2017); Daniel Kennedy, Legal and Literary Fictions at the Early Modern Inns of Court; Michael Reid, Gay Lives: Literature, Secrecy, and the Problem of Evidence in Eighteenth-Century England; Daniel Del Gobbo, Feminism Goes to College: The Law and Politics of Campus Sexual Violence.\nEducationJ.D., Yale, 2002Ph.D. (English) U.C. Berkeley, 1999\nOther infoCo-editor, Law and Literature series, Oxford UPEditorial Board, Law and Literature (Taylor & Francis)Organizing Committee, Association for the Study of Law, Culture, and the HumanitiesProgram Committee, American Society for Legal HistorySenior Editor, Oxford Handbooks Online (law series)Governing Board, International Society for the History and Theory of Intellectual PropertyDirector, Centre for Innovation Law and PolicySteering Committee, Sexual Diversity Studies programDirector, Combined Degree Program in Law and EnglishFaculty advisor, Out in LawOther AppointmentsGraduate faculty, Department of EnglishAssociate member, Centre for Comparative LiteratureFaculty affiliate, Ph.D. program in Architecture, Landscape, and DesignFaculty affiliate, Book History and Print CultureFaculty associate, Centre for EthicsFaculty advisor, University of Toronto Faculty of Law Review\nSelected publicationsThe Oxford Handbook of Law and Humanities (2020) (ed. Simon Stern, Bernadette Meyler, and Maksymilian Del Mar)\"Fanny Hill and the \"Laws of Decency\": Investigating Obscenity in Eighteenth-Century England,\" Eighteenth-Century Life 43 (2019), 162-87\"Narrative in the Legal Text: Judicial Opinions and Their Narratives,\" in Narrative and Metaphor in the Law, ed. Michael Hanne & Robert Weisberg (Cambridge University Press, 2018), 121-39Co-Editor (with Nan Goodman), The Routledge Research Companion to Law and Humanities in Nineteenth-Century America (Routledge, 2017)\"Wilde's Obscenity Effect: Influence and Immorality in The Picture of Dorian Gray,\" Review of English Studies 68 (2017), 756-72\"Legal and Literary Fictions,\" in New Directions in Law and Literature, ed. Bernadette Meyler & Elizabeth Anker (Oxford University Press, 2017), 313-26\"R. v. Jones (1703): The Origins of the Reasonable Person,\" in Philip Handler, Henry Mares, & Ian Williams, eds., Landmark Cases in Criminal Law (Hart, 2017), 59-79Ed. & Intro., William Blackstone, Commentaries on the Laws of England, Book II: Of the Rights of Things (The Oxford Edition of Blackstone, Oxford University Press, 2016) Work in Progress\"Prescription and Proof in Legal Scholarship\" (on the role of prescriptive arguments and forensic modes of analysis in legal scholarship)Legal Fictions and the Legal Imagination (book-length study of fictions in the common law since the seventeenth century)\"Lord Mansfield and the Reformulation of the Legal Decision\"\nCurriculum Vitae\nResearch areasCriminal Law Intellectual Property LawLaw and LiteratureLegal HistoryLegal TheoryPrivacy LawSexuality and the Law\nAll Publications",
    "keywords":" Law and Literature; Legal History; Law and Sexuality; Criminal Law; Reasonable Man Standard"
  },
  {
    "name":"Stewart, Hamish",
    "phone":"416-978-1074",
    "email":"hamish.stewart@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/hamish-stewart",
    "bio":"\nProfessor\n78 Queen's ParkToronto, Ontario M5S 2C5\nHamish Stewart joined the Faculty of Law in 1993 and is now a Professor of Law at the University of Toronto.  Before attending law school, he studied economics (B.A., University of Toronto, 1983; Ph.D., Harvard University, 1989) and taught for a year in the economics department at Williams College.   He received an LL.B. degree from the University of Toronto in 1992, clerked at the Ontario Court of Appeal in 1992-93, and was called to the Ontario Bar in 1998.Professor Stewart teaches criminal law and the law of evidence, and has published numerous papers in these areas as well as papers on legal theory ,the law of contract, and economic methodology.  He is the general editor of Evidence: A Canadian Casebook, 4th ed. (Toronto: Emond Montgomery, 2016) and the associate editor of the Canadian Criminal Cases.  His most recent book is Fundamental Justice, 2d ed. (Toronto: IrwinLaw, 2019), a treatise on s. 7 of the Canadian Charter of Rights and Freedoms.See also the Law & Philosophy focus area.\nSee also Professor Stewart's SSRN page.\nResearch areasContractsCriminal Law Criminal Procedure and EvidenceEconomic Analysis of LawLegal Theory\nAll Publications\nSee also Professor Stewart's SSRN page.",
    "keywords":" Criminal Law; Law of Evidence; Legal Theory; Law of Contract; Economic Methodology"
  },
  {
    "name":"Su, Anna",
    "phone":"416-978-6242",
    "email":"anna.su@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/anna-su",
    "bio":"\nAssociate Professor\nJackman Law BuildingRoom J47078 Queen's ParkToronto, Ontario M5S 2C5\nAnna Su's primary areas of research include the law and history of international human rights law, comparative constitutional law, technology and international law, and law and religion. She is currently a Faculty Fellow at the Schwartz Reisman Institute for Technology and Society. Anna holds an SJD from Harvard Law School where her dissertation was awarded the John Laylin Prize for best paper in international law. She received her JD and AB degrees from the Ateneo de Manila University in the Philippines. Prior to coming to Toronto, she held a postdoctoral fellowship at the Baldy Center for Law and Social Policy based in SUNY Buffalo Law School, and a graduate fellowship in ethics with the Edmond J. Safra Center for Ethics at Harvard University. She worked as a law clerk for the Philippine Supreme Court and was a consultant to the Philippine government negotiating panel with the Moro Islamic Liberation Front.She holds a cross-appointment at the Department of History (by courtesy).\nEducationSJD, Harvard Law School (2013)LLM, Harvard Law School (2008) (waived)JD, Ateneo Law School (2005)AB, Political Science, Ateneo de Manila University (2001)\nAcademic appointmentsBaldy Postdoctoral Fellowship, SUNY Buffalo Law School (2013-2014)\nAwards and distinctionsFaculty Fellow, Schwartz Reisman Institute for Technology & Society, University of Toronto (2021-2023) )Visiting Fellow, Edmond J. Safra Center for Ethics, Harvard University (2021-2022)Fellow, Nootbaar Institute on Law and Religion, Pepperdine Caruso Law School (2020- )McDonald Distinguished Fellow, Center for the Study of Law and Religion, Emory University (2019- )Connaught New Researcher Award (2014-2015)John Laylin Writing Prize in International Law, Harvard Law School (2013)Edmond J. Safra Graduate Fellowship in Ethics, Harvard University (2012-2013)\nSelected publicationsExporting Freedom: Religious Liberty and American Power (Harvard University Press, 2016)“The Promise and Perils of International Human Rights Law for AI Governance,” Law, Technology, and Humans (2022)\"Liberalism, Catholic Integralism and the Question of Religious Freedom,\" BYU Law Review (2022)\"Rise and Fall of Universal Civil Jurisdiction,\" 41 Human Rights Quarterly 849 (2019)\"Transformative State Neutrality,\" Supreme Court Law Review (2019)\"Establishment,\" in Religion, Law, USA,  edited by Joshua Dubler and Isaac Weiner (NYU Press, 2019)\"Varieties of Burden in Religious Accommodations,\" 34 Journal of Law and Religion 42 (2019)\"Catholic Constitutionalism from the Americanist Controversy to Dignitatis Humanae\", 91 Notre Dame Law Review 101 (2016)\"Judging Religious Sincerity,\" 5 Oxford Journal of Law and Religion 28 (2016)\nCurriculum Vitae\nResearch areasCanadian Constitutional LawComparative LawInternational LawLaw and ReligionLegal HistoryPolitical Philosophy and Theory",
    "keywords":" International Human Rights Law; Comparative Constitutional Law; Technology and International Law; Law and Religion; Philippine Supreme Court."
  },
  {
    "name":"Suzack, Cheryl",
    "phone":"416-946-0352",
    "email":"cheryl.suzack@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/cheryl-suzack",
    "bio":"\nAssociate Professor; Graduate Faculty, Undergraduate Instructor, Department of English\nJackman Humanities Building170 St. George StreetToronto, ON M5R 2M8\nEnglish Department profile page\nProfessor Cheryl Suzack (Batchewana First Nations) is an Associate Professor at the Department of English. She is cross-appointed to the Aboriginal Studies Program and teaches courses for English and Aboriginal Studies on comparative Indigenous literatures, comparative Indigenous studies, and Indigenous decolonization with a focus on gender issues and Indigenous women. She also holds a non-budgetary cross-appointment at the Faculty of Law.Prof. Suzack obtained her BA (Honours) in English and Political Science and MA English at the University of Guelph in 1993 and 1995, respectively. She received a BEd degree from Nipping University in 1996 and her PhD in English at the University of Alberta in 2004.Professor Suzack's research focuses on Indigenous law and literature with a particular emphasis on writing by Indigenous women. In her book, Indigenous Women's Writing and the Cultural Study of Law, she explores how Indigenous women's writing from Canada and the United States addresses case law concerning tribal membership, intergenerational residential school experiences, and land claims. Her current project analyzes Justice Thurgood Marshall's papers in the context of Indian civil rights claims from the 1960s. She is a co-editor (with Greig Henderson and Simon Stern) of “The Critical Work of Law and Literature,” University of Toronto Quarterly (Fall 2013) and a co-editor and contributor (with Shari Huhndorf, Jeanne Perreault, and Jean Barman) to the award-winning collection, Indigenous Women and Feminism: Politics, Activism, Culture (UBC 2010). Professor Suzack has completed a book length study, Indigenous Women’s Writing and the Cultural Study of Law, and is starting a new project on Justice Thurgood Marshall’s Indian law cases. Past projects include editing special issues for Topia: Canadian Journal of Cultural Studies, Ariel: A Review of International English Literature, and English Studies in Canada.\nSelected publicationsIndigenous Women's Writing and the Cultural Study of Law. Toronto: University of Toronto Press, 2017.\"Comparative Racialization and American Indian Identity in Nineteenth-Century America.\" The Routledge Research Companion to Law and Humanities in Nineteenth-Century America. Ed. Nan Goodman and Simon Stern. New York: Routledge, 2017. 73-95.\"Transitional Justice, Termination Policies, and the Politics of Literary Affect in Chrystos' Not Vanishing.\" Canadian Review of American Studies 47.1 (2017): 1-25.\"Human Rights and Indigenous Feminisms.\" Handbook of Indigenous Peoples' Rights. Ed. Corinne Lennox and Damien Short. Abingdon and NewYork: Routledge, 2016. 146-163.\"Indigenous Feminisms in Canada.\" NORA: Nordic Journal of Feminist and Gender Research 23.1 (2015): 261-274.\"The Becoming of Justice: Indigenous Women's Writing in the Pre-Truth and Reconciliation Period.\" Transitional Justice Review 1.2 (2013):97-125. Co-Author with Élise Couture-Grondin\"The Transposition of Law and Literature in Delgamuukw and Monkey Beach.\" South Atlantic Quarterly 110.2 (Spring 2011): 447-463.Indigenous Women and Feminism: Politics, Activism, Culture. Cheryl Suzack, Shari Huhndorf, Jeanne Perreault, and Jean Barman, co-editors and contributors (UBC Press, 2010).\"Land Claims, Identity Claims: Mapping Indigenous Feminism in Literary Criticism and in Winona LaDuke's Last Standing Woman.\" Reasoning Together. Ed. Craig Womack. U of Oklahoma P, 2008. 169-92.\"Law Stories as Life Stories: Jeannette Lavell, Yvonne Bedard, and Half-breed.\" Auto\/Biography: Trace, Text, Telling. Ed. Marlene Kadar, Susanna Egan, Jeanne Perreault, and Linda Warley. Wilfrid Laurier UP, 2005. 117-41.Editor, In Search of April Raintree: Critical Edition, by Beatrice Culleton Mosionier, Portage and Main Press, 1999.\nResearch areasAboriginal LawLaw and Literature\nAll Publications",
    "keywords":" Indigenous law; Indigenous literature; Indigenous women; Comparative Indigenous studies; Decolonization"
  },
  {
    "name":"Thorburn, Malcolm",
    "phone":"416-978-7546",
    "email":"malcolm.thorburn@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/malcolm-thorburn",
    "bio":"\nProfessor; \r\nChair, Legal, Ethical and Cultural Implications of Technological Innovation; \r\nAssociate Dean, Graduate Programs\nJackman Law Building78 Queen's ParkRoom J326Toronto, Ontario M5S 2C5\nMalcolm Thorburn, B.A. (Hons.) (Toronto); M.A. (Pennsylvania); J.D. (Toronto); LL.M. (Columbia); J.S.D. (Columbia) is a Professor at the University of Toronto Faculty of Law. Prior to joining the Faculty of Law in 2013, he was Canada Research Chair in Crime, Security and Constitutionalism at Queen’s University. In 2000-2001, he served as Law Clerk at the Supreme Court of Canada for Mr. Justice Louis LeBel. He has held visiting fellowships at Sciences Po, Paris, France (2019), the Australian National University (2008), Ludwig Maximilians University in Munich, Germany (2011), and the French National Centre for Criminology (CESDIP) in Paris, France (2011). In the 2011-2012 academic year, he was the Robert S. Campbell visiting fellow at Magdalen College, University of Oxford, UK.His writing focuses on theoretical issues in criminal justice and public law including criminal law and procedure, sentencing, policing, constitutional rights and proportionality reasoning. He is the editor of two books: The Philosophical Foundations of Constitutional Law (with David Dyzenhaus) and The Dignity of Law (with Dwight Newman). His work has appeared in such publications as the Yale Law Journal, Ratio Juris, the Boston University Law Review, the University of Toronto Law Journal, Criminal Law and Philosophy and several books at Oxford University Press and Hart Publishing. He is co-convenor of the Legal Theory Workshop, an associate editor of the New Criminal Law Review and a member of the editorial boards of Law and Philosophy and Criminal Law and Philosophy.See also the Law & Philosophy focus area.\nSee also Professor Thorburn's SSRN page.\nAwards and distinctionsCanada Research Chair (tier 2) in Crime, Security and Constitutionalism, 2010-2013\nSelected publications \"Policing and Public Office\" University of Toronto Law Journal 70: 248-266 (2020).\"Criminal Punishment and the Right to Rule\" University of Toronto Law Journal 70:44-63 (2019)\"Soldiers as Public Officials: A Moral Justification for Combatant Immunity\" 32 Ratio Juris 395 (2019).\"Human Trafficking: Supplying the Market for Human Exploitation,\" in Herlin-Karnell, E, Haverkamp, R, and Lernestedt, C, eds, What is Wrong with Human Trafficking? Critical Perspectives on the Law, (Bloomsbury 2018).\"Punishment and Public Authority\" in Asp, P, Dubois-Pedain, A and Ulvang, M eds, Criminal Law and the Authority of the State (Bloomsbury, 2017).\"Proportionality\" in Dyzenhaus, D and Thorburn, M eds, The Philosophical Foundations of Constitutional Law (Oxford University Press, 2016).\"Two Conceptions of Equality Before the (Criminal) Law\" in Tanguay-Renaud, F. and Stribopoulos, J. eds., Rethinking Criminal Law Theory: New Canadian Perspectives in the Philosophy of Domestic, Transnational and International Criminal Law,  (Hart Publishing 2011)\"Criminal Law as Public Law\" in Duff, R.A. and Green, S. eds., Philosophical Foundations of Criminal Law (Oxford University Press 2011)\"Reinventing the Night-watchman State?\" 60 University of Toronto Law Journal 425 (2010) .\"Justifications, Powers and Authority\" 117 Yale Law Journal 1070 (2008)\nCurriculum Vitae\nResearch areasCanadian Constitutional LawCharter of RightsComparative LawCriminal Law Criminal Procedure and EvidenceLegal Theory\nAll Publications\nSee also Professor Thorburn's SSRN page.",
    "keywords":" Constitutional Law; Criminal Law; Public Law; Sentencing; Proportionality Reasoning"
  },
  {
    "name":"Valcke, Catherine",
    "phone":"416-946-8240",
    "email":"c.valcke@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/catherine-valcke",
    "bio":"\nProfessor\nJackman Law BuildingRoom J42278 Queen's ParkToronto, Ontario M5S 2C5\nCatherine Valcke (LL.B. Civil Law, University of Sherbrooke; LL.B. Common Law, University of Toronto; LL.M. University of Chicago; S.J.D. Columbia) is Professor at University of Toronto Faculty of Law, where she served as Associate Dean from 1997 to 2000.  Professor Valcke has lectured on contract law, the civil law of obligations, comparative law, and comparative legal theory in North America, Europe, and North Africa, and published in those fields nationally and internationally, in such journals as Nomos, the American Journal of Comparative Law, Harvard Journal of Law and Public Policy, Yale Journal of International Law, European Review of Private Law, and Canadian Journal of Law and Jurisprudence.  An elected member of the International Academy of Comparative Law, Professor Valcke as acted on several occasions as National Reporter for Canada to the Congress of the Academy.  Her recent book Comparing Law: Comparative Law as Reconstruction of Collective Commitments (Cambridge University Press, 2018) draws on legal theory to develop an interpretive conception of, and analytic framework for, comparative legal studies.  That analytic framework finds application in her current SSHRC-funded project -- French and English Private Law Paradigms -- which seeks to provide a deep comparative understanding of the French and English legal rules governing contract, tort, and property. A new author of the forthcoming 2021 edition of Pineau et al, Théorie des Obligations (Thémis, Montréal), a prominent treatise on the law of obligations of Quebec, Professor Valcke also is a co-editor of the forthcoming 2023 edition of the prestigious Elgar Encyclopedia of Comparative Law.\nSee also Professor Valcke's SSRN page.\nEducationJ.S.D. - Columbia University, New York, NY, USA (1997) LL.M. - University of Chicago, Chicago, IL, USA (1989)LL.B. (Common Law) - University of Toronto (1988)LL.B. (Civil Law) - University of Sherbrooke, Sherbrooke, Quebec, Canada (1985)\nAcademic appointmentsActing Associate Dean of Law (First-Year Programme), University of Toronto (2007, 2008)Visiting Professor of Law, University of Montreal (2004-2005)Guest Lecturer, Faculty of Law, University of Tunis II, Tunis, Tunisia (2005)Associate Dean of Law, University of Toronto (1997-2000)  Visiting Professor of Law, Center for Transnational Legal Studies, King's College, London, England, Spring 2019\nAwards and distinctionsArticle cited as “illuminating” by the English House of Lords (Lord Hoffmann) in Chartbrook Ltd. v. Persimmon Homes Ltd. et al., [2009] UKHL 38, [39].Social Science and Humanities Research Council of Canada Standard Research Grant for project “Reconstructing Comparative Law” (2011-2014)Rapporteur for Canada, International Survey on Legal Convergence, International Academy of Comparative Law (2009)Member of the International Academy of Comparative Law (by nomination and election only) (2007)Social Science and Humanities Research Council of Canada Standard Research Grant for project “Towards a Theory of Comparative Law” (2004-2007)Rapporteur for Canada (Common Law Section), XVIIth Congress of the International Academy of Comparative Law (“Precedent and Comparative law”), University of Utrecht, Netherlands (2006)\nSelected publicationsComparing Law: Comparative Law as Reconstruction of Collective Commitments (Cambridge: Cambridge University Press, 2018) 232 pp., reviewed: S. Seppänen, 14 Asian J. Comp. Law 382-84 (2019); E. Robson Taylor & P. Taylor, “The Barrister”, Spring 2019; Comparing Legal Styles in P. Cserne, ed., The Many Faces of Style in Law and Legal                                                                      Scholarship (2019) 15 International Journal of Law in Context pp. 274-96 (http:\/\/dx.doi.org\/10.1017\/S1744552319000284).Les différentes configurations de l’espace juridique contractuel en droit français et en droit anglais (2015) 7 Droit et philosophie--Annuaire de l’Institut Michel Villey, pp. 47-81.“Reflections on Comparative Law Methodology—Getting Inside Contract Law” in Maurice Adams & Jacco Bomhoff, eds, Practice and Theory in Comparative Law (Cambridge: Cambridge University Press, 2012) 53-105.“On Comparing French and English Contract Law:  Insights from Social Contract Theory” (2009) 4 Journal of Comparative Law 69-95 (cited and described as “illuminating article” by the English House of Lords (Lord Hoffmann) in Chartbrook Ltd. v. Persimmon Homes Ltd. et al., [2009] UKHL 38, [39]; also cited by the Scottish Law Commission (Review of Contract Law, Discussion Paper 147, [4.13]).“Le système de droit en droit comparé—Réflexions sur l’épistémologie d’une définition” in Pierre Legrand, ed, Comparer les droits, résolument (Paris: Presses Universitaires de France, 2009) 99-121.“Convergence and Divergence among English, French, and German Conceptions of Contract” (2008) 16 European Review of Private Law 29-62.“Comparative Law as Comparative Jurisprudence—The Comparability of Legal Systems” (2004) 52 American Journal of Comparative Law 713-740 (reprinted in Maksymilian Del Mar, William Twining & Michael Giudice, eds, The Library of Essays in Contemporary Legal Theory—Legal Theory and the Legal Academy (Ashgate Publishing, 2010).\nCurriculum Vitae\nResearch areasCivil LawComparative LawContractsLegal Theory\nAll Publications\nSee also Professor Valcke's SSRN page.",
    "keywords":" Comparative Law; Contract Law; Civil Law of Obligations; Legal Theory; Comparative Legal Studies"
  },
  {
    "name":"Valverde, Mariana",
    "phone":"",
    "email":"m.valverde@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/mariana-valverde",
    "bio":"\nProfessor of Criminology\nComplete profile page\nMariana Valverde is a professor at the Centre for Criminology and Sociolegal Studies at the University of Toronto, and a Fellow of the Royal Society of Canada since 2006.  She served as Director of the Centre from 2007 to 2013 and was one of the founders of the Sexual Diversity Studies program.  She holds a courtesy cross-appointment to the Department of Geography and Planning as well as the Faculty of Law.  Prior to joining the University of Toronto in 1993, she was an associate professor in the Department of Sociology at York University and previously taught in Women’s Studies at Trent University.In 2016, Professor Valverde received the Law and Society Association’s Harry J. Kalven Jr. Award in recognition of “empirical scholarship that has contributed most effectively to the advancement of research in law and society.”  She has twice won the Association’s Herbert Jacobs Book Prize for a major contribution to socio-legal scholarship: in 2000 for Diseases of the Will: Alcohol and the Dilemmas of Freedom (Cambridge University Press, 1998) and again in 2013 for Everyday Law on the Streets: City Governance in an Age of Diversity (University of Chicago Press, 2012).  Professor Valverde is also the author of Chronotopes of Law: Jurisdiction, Scale and Governance; The Force of Law; The Age of Light, Soap, and Water: Moral Reform in English Canada 1880s-1920s (now in its second edition); Law and Order: Signs, Meanings, Myths; Law’s Dream of a Common Knowledge; and Sex, Power and Pleasure.  Her most recent book Michel Foucault (Routledge, 2017) is the first title in a series on key thinkers in criminology, and gives an accessible account of Foucault’s work and how it can be used for purposes of legal studies and criminological research. Her co-edited collections include Police and the Liberal State (Stanford University Press, 2008) and The New Police Science: The Police Power in Domestic and International Governance (Stanford University Press, 2006) (both with Markus Dubber), and Wife Assault and the Canadian Criminal Justice System: Issues and Policies (Centre of Criminology, 1995) (with Linda Macleod and Kirsten Johnson).Professor Valverde’s main research interests are currently urban law and governance (historically and in the present) and, at the theoretical level, Foucault, sexuality studies, theories of spatiotemporality, and actor-network theory.  In addition, her SSHRC-funded research project, “Planning by Contract?” (2013-2016), illuminates how legal tools from private law, such as contracts, as well as the governance structures developed for and by public-private partnerships, are changing local and municipal governance.  This project is being conducted with urban political scientist Professor Aaron Moore, planning scholar Professor Sue Bunce and transnational financing expert Professor Fleur Johns.\nResearch areasCriminal Law Sexuality and the Law",
    "keywords":" Criminal Law; Sexuality and the Law; Urban Law and Governance; Foucault; Actor-Network Theory"
  },
  {
    "name":"Waddams, Stephen",
    "phone":"416-978-4205",
    "email":"s.waddams@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/stephen-waddams",
    "bio":"\nProfessor\nJackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5\nStephen Waddams is a University Professor at the Faculty of Law, where he has been teaching since 1968. He served as graduate co-ordinator from 1976 to 1987, and held the Goodman\/Schipper Chair from 2000 to 2020.  He holds B.A. and LL.B. degrees from Toronto, M.A. and Ph.D degrees from Cambridge, and LL.M and S.J.D. degrees from Michigan. He has been visiting senior research fellow, Jesus College, Oxford; visiting senior lecturer, University of Otago, Dunedin, New Zealand, and visiting fellow, All Souls College, Oxford. He is a fellow of Trinity College at the University of Toronto and was elected a fellow of the Royal Society of Canada in 1988.  He is a senior fellow of Massey College.  In 1989, he was awarded the Canadian Association of Law Teachers\/Law Reform Commission of Canada Award for Outstanding Contribution to Legal Research and Law Reform; in 1994, the first Albert Abel Professorship; in 1996 the David W. Mundell medal for contributions to Law and Letters; and in 1999, a Killam Research Fellowship. He was appointed University Professor in 2005. He was selected as a Herbert Smith Freehills Visitor to Cambridge University in 2017.Professor Waddams specializes in contract law and is the author of nine books: Products Liability, The Law of Contracts, The Law of Damages, Introduction to the Study of Law, Law, Politics and the Church of England, Sexual Slander in Nineteenth-Century England, Dimensions of Private Law: Categories and Concepts in Anglo-American Legal Reasoning, Principle and Policy in Contract Law: Competing or Complementary Perspectives?, and  Sanctity of Contracts in a Secular Age: Equity, Fairness and Enrichment as well as numerous law review articles and notes. He was co-winner of the Owen Prize in 1987 for The Law of Damages. He is also a past editor of University of Toronto Law Journal. In 1990, he received an award from the university student organizations for excellence in teaching. He has received several grants from the Social Sciences and Humanities Research Council Canada (SSHRC), most recently an Insight Grant (2020-2023) for the study of “Continuity and change in private law: the equitable perspective”.\nSee also Professor Waddams' SSRN page.\nResearch areasContractsLegal History\nAll Publications\nSee also Professor Waddams' SSRN page.",
    "keywords":" Contract Law; Equity; Law Reform; Law of Damages; Legal Research"
  },
  {
    "name":"Weinrib, Arnold",
    "phone":"416-978-1621",
    "email":"arnold.weinrib@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/arnold-weinrib",
    "bio":"\nProfessor (Retired)\nJackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5\nArnold Weinrib, B.A. (Toronto) 1962, LL.B. (Toronto) 1965, LL.M. (Harvard) (1966), called to the Bar of Ontario, 1969, is Associate Professor of Law. Professor Weinrib served as Acting Dean in 1990 and as Associate Dean from 1988-1991. Professor Weinrib's teaching and scholarship have been concentrated on Property, Community Planning and Taxation. He is the Editor-in-Chief of the Land Compensation Reports and was Research Director to the Ontario Government's Select Committee on Land Drainage. He also acted as counsel to the Airport Inquiry Commission on a Second International Airport in the Toronto Area. For many years Professor Weinrib has been the Chair of the Admissions Committee at the Faculty of Law.",
    "keywords":" Property; Community Planning; Taxation; Land Drainage; Airport Inquiry Commission"
  },
  {
    "name":"Yoon, Albert",
    "phone":"416-978-5083",
    "email":"albert.yoon@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/albert-yoon",
    "bio":"\nProfessor and Michael J. Trebilcock Chair in Law and Economics\nJackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5\nAlbert Yoon holds the Michael J. Trebilcock Chair in Law and Economics.Albert received his undergraduate degree from Yale and his law and doctoral (political science) degrees from Stanford. During law school, he was the senior articles editor of the Stanford Law Review. After graduation, he clerked for the Hon. R. Guy Cole of the U.S. Court of Appeals for the Sixth Circuit. Before joining the Faculty of Law, Albert was professor of law at Northwestern University. At the Faculty of Law, he was Associate Dean - Research and Curriculum for the 2018-20 academic years. He has held fellowships at Princeton University and the Robert Wood Johnson, Russell Sage, and Pierre Elliott Trudeau foundations.Albert examines labor markets within and outside the legal profession.  He has published in the Chicago, Stanford, and Virginia law reviews; and the Annals of Applied Statistics, Journal of Law & Economics, Journal of Theoretical Politics, among others. He is a recipient of the Ronald H. Coase Prize for best article in Law and Economics and a member of the American Law Institute. His recent scholarship focuses on legal ethics, and applications of machine learning and natural language processing to law.Beyond his academic career, Albert is co-founder of Blue J Legal, the company behind Tax Foresight and Employment Foresight: the next generation of legal research tools that harness the power of artificial intelligence to provide instant and comprehensive answers in complex areas of tax, labor, and employment law.\nSee also Professor Yoon's SSRN page.\nCurriculum Vitae\nAll Publications\nSee also Professor Yoon's SSRN page.",
    "keywords":" Labor markets; Legal ethics; Machine learning; Natural language processing; Law and Economics"
  }
]