[
  {
    "faculty":"lakehead",
    "name":"Ryan Alford",
    "title":"Professor",
    "email":"ralford@lakeheadu.ca",
    "href":"https:\/\/www.lakeheadu.ca\/users\/A\/ralford\/node\/21753",
    "bio":"Academic Qualifications:  Professor Alford received his doctorate in public, constitutional, and international law from the University of South Africa. He recently published two books on the subject of the rule of law with McGill-Queens' University Press. (Most of his law review articles are available on his SSRN page).Prior, he was awarded his master’s degree from the University of Oxford and his law degree from New York University. He is called to the bar of Ontario and is an attorney and counselor-at-law of the state of New York. Date joined Lakehead: July 2014 Previous Teaching\/Work: Upon receiving his law degree, he served as a judicial clerk for the Honorable Robert L. Carter of the Southern District of New York and the Honorable Rosemary S. Pooler of the United States Court of Appeals for the Second Circuit. After entering practice he worked for the firm of Cleary, Gottlieb, Steen & Hamilton in their New York and Brussels offices, focusing on international arbitration, transnational litigation, and cross-border mergers and acquisitions.Prior to joining the Bora Laskin Faculty of Law, he was Visiting Assistant Professor at the University of Victoria Faculty of Law, where he was awarded the First Year Class Teaching Award. He has also served as a Visiting Fellow of the Max Planck Institute for Legal History and Legal Theory. Research Interests: Constitutional historyHistorical development of the Rule of LawNonderogable rights during public emergencies Current Courses:Constitutional LawProfessional ResponsibilitySpecial Topics: Rule of LawSample Publications:Seven Absolute Rights: Recovering the Foundations of Canada's Rule of Law (Montreal: McGill-Queens' University Press, 2020) (peer-reviewed book).Permanent State of Emergency: Unchecked Executive Power and the Demise of the Rule of Law (Montreal: McGill-Queens' University Press, 2017) (peer-reviewed book).\"The Origins of Hostility to the Rule of law in Canadian Academia: A History of Administrativism and Anti-Historicity\", in Attacks on the Rule of Law from Within (M. St-Hilaire and J. Baron, eds.) (Toronto: Lexis-Nexis, 2019) (peer-reviewed book chapter).Community Service:Bencher (director) of the Law Society of Ontario (the regulator of the province's legal professions).Adjudicator of the Law Society Tribunal (the quasi-judicial disciplinary body that hears allegations of professional misconduct).Vice-Chair, Tribunal Committee of the Convocation of the Law Society (responsible for the supervision of the Tribunal and the revision of the Rules of Professional Conduct and the Rules of Practice and Procedure).Senior Fellow, Macdonald-Laurier InstituteResearch Associate, University of British Columbia Centre for Constitutional Law and Legal Studies Other:Prof. Alford serves as the faculty supervisor of Bora Laskin's chapter of the Runnymede Society, the national law student membership group dedicated to debating the ideas and the ideals of constitutionalism, individual liberty and the rule of law.He also brought a successful constitutional challenge to the provisions of the National Security and Intelligence Committee of Parliamentarians Act (Alford v. Canada (Attorney-General) 2022 ONSC 2911 (CanLII). In that case, the Ontario Superior Court of Justice struck down a federal statute that abridged freedom of speech and debate in Parliament for implicitly amending the unwritten provisions of the Constitution of Canada --the first time that any Canadian court has done so. He was also granted standing by the Public Order Emergency Commission (the Rouleau Commission) to participate as a party before the Inquiry and to make submissions about the propriety of the Government of Canada's promulgation of the Emergencies Act.",
    "listed_research_areas":null
  },
  {
    "faculty":"lakehead",
    "name":"Joan Braun",
    "title":"Assistant Professor",
    "email":"jbraun2@lakeheadu.ca",
    "href":"https:\/\/www.lakeheadu.ca\/users\/B\/jbraun2\/node\/57003",
    "bio":"Academic Qualifications:  PhD Candidate - Peter A. Allard School of LawMaster of Laws – Peter A. Allard School of LawMaster of Social Work – School of Social Work, University of BCBachelor of Laws – School of Law, University of BCBachelor of Arts (Psychology) – University of Victoria Date joined Lakehead: August 2020 Previous Teaching\/Work: Prior to her doctoral studies Professor Braun worked as a mediator in private practice and as a lawyer in the social justice sector. In the latter role, she founded western Canada’s first community legal clinic for older adults (province wide program) at the BC Centre for Elder Advocacy and Support. She previously served as the chair of the national executive for the Canadian Bar Association’s Alternative Dispute Resolution Section and is currently serving as a member-at-large on the Canadian Bar Association's National Elder Law Section Executive and as the co-chair of the Alternate Dispute Resolution’s (ACR) Elder Mediation Section. In 2015 - 2016 she was appointed as the ACR representative to a task force that oversaw the development of a new ADR model for resolving guardianship and advanced planning disputes. This model, called Eldercaring Coordination, has been implemented in the courts in several states. Her previous teaching includes courses in public law at the University of Northern BC and restorative justice at the University of the Fraser Valley Research Interests: Professor Braun’s research focuses on elder law, criminal law, human rights law and alternate dispute resolution. It explores how laws address social and legal issues relevant to older adults. A current research focus is on legal issues that arise in the context of elder abuse and legal issues that arise in the criminal and civil context when an older adult has dementia. Examples of current projects are: a project examining court cases where the court references advanced age as an aggravating factor in sentencing and a project examining mental (in)capacity in the context of abuse and neglect. Current Courses Taught: Criminal Law, Alternative Dispute Resolution and Elder LawSelect Publications:Joan Braun, “Preventing Harm to Vulnerable Older Adults: A Social Justice Perspective” (2021) 36:6 Research on Social Work Practice 561 (Peer-reviewed).Joan Braun, “Legal Interventions to Protect Vulnerable Adults: Does Relational Autonomy Provide a New Way Forward?” (2020) 12: 2 Elder Law Review (Peer-reviewed).Joan Braun, “Elder Mediation: Promising Approaches and Potential Pitfalls” (2012) 7 Elder Law Review (Peer-reviewed).Joan Braun, “Elder Guardianship Mediation: Threat or Benefit to Abuse Victims? (2012) 7 International Perspectives on Victimology 27 (Peer-reviewed).",
    "listed_research_areas":null
  },
  {
    "faculty":"lakehead",
    "name":"Mariette Brennan",
    "title":"Associate Professor",
    "email":"mbrennan@lakeheadu.ca",
    "href":"https:\/\/www.lakeheadu.ca\/users\/B\/mbrennan\/node\/16746",
    "bio":"Academic Qualifications:  Dr. Brennan completed her Juris Doctor at the University of Ottawa and was admitted to the Ontario Bar in 2004.Following her call to the Bar, Mariette moved to England to pursue her LL.M at the University of Essex in international human rights law. She completed her thesis on the international right to health under the supervision of then United Nations Special Rapporteur on the Right to the highest attainable standard of health, Paul Hunt. Mariette graduated with distinction in 2006. In 2007, Mariette moved to Toronto, Ontario to begin her Ph.D. in law at Osgoode Hall Law School at York University. Mariette’s doctoral thesis was a comparative legal analysis of health care systems and their compliance with the right to health as elucidated in general comment 14; her work was supervised by Dr. Joan Gilmour. Mariette successfully defended her Ph.D. in December 2011.Sample Publications:International Journal of Human Rights (2018)Brennan, M. & Cohen, M. “Canadian Citizenship Laws and the Making of a Stateless Person” (2018) 22 (10) International Journal of Human Rights 1302Brennan, Mariette, “Is the Health Star Rating System a Thin Response to a Fat Problem?” (2015) 17 University of Notre Dame (Australia) Law Review 86Brennan, Mariette, “Canada’s Next Step in Tobacco Control Laws: Is Plain Packaging Legislation a Viable Proposal?” (2013) 51(1) Alberta Law Review 23 Date joined Lakehead: July 2013 Previous Teaching\/Work: Prior to joining the Bora Laskin Faculty of Law as a founding faculty member, Dr. Mariette Brennan was an Assistant Professor at Bond University, Gold Coast, Australia. During her 5 years at Bond University, Mariette taught a wide-range of courses that covered both Australian and Canadian law. Research Interests: Dr. Brennan’s research interests currently lie in the intersection of constitutional law and public health law. She is currently working on a project with Drs. Elaine Wiersma and Lori Chambers regarding the legal, constitutional and human rights for people living with dementia. She is also working on a CIHR funded project , Promoting Just and Inclusive Decision-Making Towards Palliative Care Goals for Long-Term Care Residents with Dementia and Their Care Partners, headed by Dr. Nisha Sutherland. In addition to her work at the Bora Laskin Faculty of Law, Mariette has been appointed as an assistant professor at the Northern Ontario School of Medicine since 2016 and is a core member of the Thunder Bay Regional Health Sciences Centre Research and Ethics Board.",
    "listed_research_areas":null
  },
  {
    "faculty":"lakehead",
    "name":"Tenille E. Brown",
    "title":"Assistant Professor",
    "email":"tenille.brown@lakeheadu.ca",
    "href":"https:\/\/www.lakeheadu.ca\/users\/B\/tbrown5\/node\/59684",
    "bio":"Academic Qualifications:  LLB (Scots, Honours), LLM, Phd Candidate (University of Ottawa), Barrister and Solicitor at the Bar of Ontario.Professor Brown holds an LL.M. from the University of Ottawa in the field of Aboriginal law and the then-draft International Declaration on the Rights of Indigenous Peoples, and an LL.B. (Scots law) (Honours) from the University of Dundee, Scotland, where she graduated high school before immigrating to Canada. Date joined Lakehead: July 2020 Previous Teaching\/Work: Prior to joining Bora Laskin Faculty of Law, Professor Brown was an adjunct professor in the Common Law and Civil Law Sections of the Faculty of Law at the University of Ottawa, where she taught Property Law in the first year JD programme. She also created and taught two courses, Legal Theory and Social Sciences taught in the Civil law section as part of the undergraduate certificate in law offered by the Civil law section, and Law and Geography an elective offering in the JD programme Common law section. This was the first legal geography course in a law school in Canada.Professor Brown is a member of the Human Rights Research and Education Centre housed at the University of Ottawa. Professor Brown holds professional membership at the Bar of Ontario. She was a Student at Law at the Samuelson-Glushko Canadian Internet Policy & Public Interest Clinic, Canada’s leading public interest technology law clinic, where she contributed to interventions at the Supreme Court of Canada in the area of privacy law. She has practised in the areas of intellectual property, privacy, administrative and employment law. Before moving into academia, Professor Brown worked in the Kingdom of Eswatini (at that time known as the Kingdom of Swaziland), Southern Africa, as a legal officer in a feminist organization. Research Interests: Professor Brown’s doctorate research is in the area of legal geography examining the intersection between property, geography and the creation of place in Canada. Her PhD thesis is titled “The Geographies of Property Law: An Engagement with Place and Space.” While completing her doctorate at the University of Ottawa, Professor Brown contributed to research projects on topics including: access to land and Indigenous peoples, mapping and digital technologies, data governance and on the regulation of emerging technologies. She was a student member on the Social Science and Humanities Research Council funded project titled “Geothink: Canadian Geospatial and Open Data Research Partnership,” where she contributed to research on liability in data use, open data and data propertization. As well she researched on the intersection between mapping, evidence and Constitutional s.35 Indigenous land rights for the mapping database “dreamcatcher” created by Co-Map, the Centre for Community Mapping, Waterloo, in partnership with the Mississauga’s of New Credit First Nation.",
    "listed_research_areas":null
  },
  {
    "faculty":"lakehead",
    "name":"Frances E. Chapman",
    "title":"Professor",
    "email":"fchapman@lakeheadu.ca",
    "href":"https:\/\/www.lakeheadu.ca\/users\/C\/fchapman\/node\/16744",
    "bio":"Academic Qualifications:  Dr. Chapman was admitted to the Bar in 2003 after having completed her Juris Doctor at the University of Western Ontario, and her undergraduate degree at the University of Waterloo.After completing her articles at Cohen Highley LLP, in London Ontario, Frances gained a broad range of experience in family law, criminal law, personal injury and tort law, administrative law, contract law, and civil and commercial litigation. She was re-hired by the firm as an associate lawyer in the department of the senior litigation partner. Frances practiced for almost two years working with real property disputes, mortgage actions, wrongful dismissal, and class actions.Frances returned to school in September 2005 to pursue her passion for criminal law. She focused specifically on criminal law defences including automatism, duress, necessity, and completed her Master of Laws degree at the University of Western Ontario while teaching part-time at Fanshawe College. She then moved to Toronto, Ontario to complete her Ph.D. in law at Osgoode Hall Law School at York University. Frances finished her Ph.D. in 2009 while teaching full time at St. Jerome’s University at the University of Waterloo. Her areas of interest are in criminal law and focus on defences including brainwashing, automatism, duress, necessity, and mental disorder. She focuses particularly on wrongful convictions, violence against women and domestic violence. Current research includes pedagogy in a law school setting and false confessions. Date joined Lakehead: July 2013 Previous Teaching\/Work: Dr. Frances Chapman comes to us from the University of Waterloo (St. Jerome's University) where she taught as an Assistant Professor in the Legal Studies program since 2009 and as a contract lecturer since 2007. During her time at St. Jerome's she established a strong reputation for her classroom teaching and in 2012 received the UW Legal Studies Society Distinguished Professor Award. Frances also won the John Bonsignore award from the Academy of Legal Studies in Business for outstanding teaching in 2013. Research Interests: Her research interests lie in the area of criminal law, criminal defence, tort law and family law and specifically in: child custody and access, parental alienation, children and the law, feminism and the law, women and the law, alternative dispute resolution, false confessions, interpersonal\/domestic violence, women and corrections, brainwashing, coercive persuasion, restorative justice, automatism, duress, involuntary servitude and coercive persuasion.",
    "listed_research_areas":null
  },
  {
    "faculty":"lakehead",
    "name":"Daniel Cox",
    "title":"Assistant Professor",
    "email":"daniel.cox@lakeheadu.ca",
    "href":"https:\/\/www.lakeheadu.ca\/users\/C\/dgcox\/node\/106727",
    "bio":"Daniel Cox Assistant Professor Department: Bora Laskin Faculty of Law Email: daniel.cox@lakeheadu.ca Phone Number: +1 807-343-8010ext. 7802 Office Location: PA 1004B Office Hours: Mon-Fri 8:30 am - 4:30 pm",
    "listed_research_areas":null
  },
  {
    "faculty":"lakehead",
    "name":"Daniel Dylan",
    "title":"Associate Professor",
    "email":"dwdylan@lakeheadu.ca",
    "href":"https:\/\/www.lakeheadu.ca\/users\/D\/dwdylan\/node\/38629",
    "bio":"Academic Qualifications:  LL.M. (University of Ottawa) 2011J.D. (Michigan State University College of Law) 2010LL.B. (University of Ottawa) 2010B.A. (High Hons) (Carleton University – Political Science) 1997 Date joined Lakehead: August 2016 Previous Teaching\/Work: Professor Dylan was called to the bar of Ontario in June 2011 and the bar of Nunavut in April 2012. He received his LL.M., which focused on Canada’s intellectual property regime in relation to the Nunavut Land Claims Agreement, from the University of Ottawa in April 2011, his LL.B. from the University of Ottawa in 2010, and his J.D. from the Michigan State University College of Law in 2010 as part of a dual-degree program between these two institutions. He clerked at the Federal Court (of Canada) for the Honourable Justice Douglas R. Campbell from August 2010 to July 2011 and clerked at the same court for the Honourable Justice Donald J. Rennie, former federal Assistant Attorney General, from July 2011 to April 2012 (now a member of the Federal Court of Appeal). He also completed a judicial clerkship externship in the chambers of the Honorable Judge David W. McKeague of the United States Court of Appeals for the Sixth Circuit. From April 2012 to July 2016, he served as Legal Counsel in the Legal and Constitutional Law division of the Government of Nunavut Department of Justice, where his practice focused on Impact Review Assessments, Wildlife, Natural Resource Extraction issues, and other areas such as constitutional, litigation, human rights, and human health law, among others.In addition to his law degrees, in 1997 Daniel earned a B.A. (High Honours) in Political Science from Carleton University. He returned to Carleton in the fall of 2011 to teach Law and Aboriginal Peoples as well as Social Justice and Human Rights in the winter of 2012. He has received numerous academic awards and has published several pieces of writing.He is a Past-President of the Canadian Bar Association, Nunavut Branch and a former member of the Canadian Bar Association, National Board of Directors, as at the end of August 2016, and has over several years served on various committees of the Law Society of Nunavut. He was awarded Lakehead University's Contribution to Teaching Award in 2020.He is admitted to the Bars of Ontario (inactive) and Nunavut (active), and provides legal services to clients in Nunavut. Research Interests: Professor Dylan teaches Animal Law, Contracts, Evidence, and Intellectual Property & Indigenous Knowledge Governance. In the past, he has taught Professional Responsibility as well as Legal Research & Writing. His current research interests include Animal Law and Environmental Law, as well as a mix of Aboriginal, Traditional Knowledge, Wildlife Mining & Natural Resources, and Administrative Law, with a focus on the mechanics of non-human animals, as well as cultural and environmental protection, appropriation, and the remediation thereof, as well as modern treaties. He is also interested in International, Maritime and Aviation Law.Selected Publications:'We the North' as the Dispossession of Indigenous Identity and a Slogan of Canada's Enduring Colonial Legacy, Alberta Law Review, Vol. 56, No. 3, 2019. The Complicated Intersection of Politics, Administrative and Constitutional Law in Nunavut's Environmental Impacts Assessment Regime, University of New Brunswick Law Journal 68 U.N.B. L.J. 202, 2017. Professor Dylan is actively involved on several Lakehead University Committees, serves on Research Ethics Boards, and is actively involved generally in the Thunder Bay community.",
    "listed_research_areas":null
  },
  {
    "faculty":"lakehead",
    "name":"Martin-Joe Ezeudu",
    "title":"Assistant Professor",
    "email":"mezeudu@lakeheadu.ca",
    "href":"https:\/\/www.lakeheadu.ca\/users\/E\/mezeudu\/node\/48953",
    "bio":"Academic Qualifications:  Dr. Martin-Joe Ezeudu studied at Osgoode Hall Law School at York University, where he obtained his Ph.D. in 2013. At York University he was a recipient of both a York University graduate scholarship and an Ontario graduate scholarship. He obtained his LL.M. in Commercial Law from the University of Birmingham in England, where he was a recipient of a Birmingham Law School graduate scholarship. He obtained his LL.B. from Nnamdi Azikiwe University in Nigeria, where he graduated the best student in his class. Date joined Lakehead: August 2018 Previous Teaching\/Work: Dr. Ezeudu articled at the Ontario Ministry of the Attorney General where he worked in the areas of corporate-commercial law, privacy law, consumer protection and governmental policy. While at the AG’s office, he was also engaged in the prosecution of provincial offences under the Ontario Consumer Protection Act, 2002. He was called to the Ontario bar in 2014. He is also a Solicitor of the Supreme Court of England and Wales (non-practicing), and a Barrister and Solicitor of the Supreme Court of Nigeria.Prior to joining Lakehead University, he taught Commercial Law in the School of Accounting and Finance at George Brown College in Toronto and was in private practice, also in Toronto. Research Interests: Dr. Ezeudu’s research focuses primarily on international governance of natural resources and extractive industries. He also has research interests in trade regulatory regimes, commercial and environmental law. He has published works in internationally reputed law journals, including the European Journal of Law Reform, the African Human Rights Journal, King’s Law Journal and the Journal of Energy and Natural Resources Law for which he has also contributed a peer-review. Dr. Ezeudu teaches Natural Resources Law (Mining Law), Bankruptcy and Insolvency Law, Business Organizations and Criminal Law.Selected Publications:Mining Law of Canada, by Dwight Newman, (2019) Journal of Energy & Natural Resources Law, DOI: 10.1080\/02646811.2019.1633152 (Peer-reviewed book review).“From a Soft Law Process to Hard Law Obligations: The Kimberley Process and Contemporary International Legislative Process” (2014) 16(1) European Journal of Law Reform 104-132 (Peer-reviewed).“Revisiting Corporate Violations of Human Rights in Nigeria’s Niger Delta Region: Canvassing the Potential Role of the International Criminal Court” (2011) 11(1) African Human Rights Law Journal 23-56 (Peer-reviewed).",
    "listed_research_areas":null
  },
  {
    "faculty":"lakehead",
    "name":"Jula Hughes",
    "title":"Dean, Professor",
    "email":"jhughe11@lakeheadu.ca",
    "href":"https:\/\/www.lakeheadu.ca\/users\/H\/jhughe11\/node\/57001",
    "bio":"Academic Qualifications:  M.A., Ph.D. (Erlangen), LL.B. (Ottawa) Date joined Lakehead: October, 2019 Previous Teaching\/Work: Professor, Faculty of Law, University of New Brunswick Research Interests: Law and practice of judicial disqualificationCriminal Code reformApplication of criminal law to marginalized populationsLegal recognition of and provision of services to off-reserve and non-status Indigenous people",
    "listed_research_areas":null
  },
  {
    "faculty":"lakehead",
    "name":"Wendy Parkes",
    "title":"Assistant Professor",
    "email":"wparkes@lakeheadu.ca",
    "href":"https:\/\/www.lakeheadu.ca\/users\/P\/wparkes\/node\/48954",
    "bio":"Academic Qualifications:  Professor Parkes has degrees in Law and Geography. She graduated from the University of Ottawa Faculty of Common Law. In 2002, she was called to the Bar of Ontario.Current Courses Legal Research and Writing; Professional Responsibility; Tort Law; Environmental Law Date joined Lakehead: August 2018 Previous Teaching\/Work: Professor Parkes’ teaching has focused on Indigenous law and mentoring of Indigenous students. At Lakehead she has taught a course on Aboriginal Law in the Canadian North. She taught for four years at the University of Saskatchewan’s Native Law Centre Summer Program, and in the first year of the Nunavut Law Program, based in Iqaluit. She has also tutored Inuit students at Nunavut Sivuniksavut, a program for Inuit youth transitioning to higher education.Following graduation from law school, Professor Parkes practiced civil litigation and corporate law with the Ottawa law firm of McFarlane Lepsoe. She appeared in legal proceedings at Small Claims Court, the Ontario Superior Court of Justice, the Federal Court of Canada and the Ontario Landlord and Tenant Board.While in practice, she developed a legal writing workshop at the University of Ottawa for first-year and Indigenous law students, and subsequently taught Foundation Legal Writing Skills, an upper-year writing course. She also led a two-year research study of the legal and policy framework for identity theft for the Canadian Internet Policy and Public Interest Clinic (CIPPIC).Prior to law school, Professor Parkes was a policy advisor with the federal government on Indigenous, northern and environmental issues. Research Interests: Curriculum Development; Identity Theft, Data Breaches and Privacy LawSample Publications Contributor to headnotes and subject indexes for recent Aboriginal law cases for the Canadian Native Law Reporter University and Community Service Professor Parkes is Chair of the Faculty of Law Natural Resources and Environmental Law Committee and a member of the Appointments Committee. She is the Faculty representative on the Canadian Association of Law Teachers and a member of the Canadian Bar Association and Ontario Bar Association and their Aboriginal Law and Environmental Law sections. As a Skate Canada Senior Competitive Judge, she is an active member of the Thunder Bay figure skating community.",
    "listed_research_areas":null
  },
  {
    "faculty":"lakehead",
    "name":"David Rosenberg",
    "title":"Assistant Professor",
    "email":"drosenbe@lakeheadu.ca",
    "href":"https:\/\/www.lakeheadu.ca\/users\/R\/drosenbe\/node\/48955",
    "bio":"Academic Qualifications:  Hons. B.A. from the University of Toronto LL.B. from Queen’s University at Kingston LL.M. from The London School of Economics and Political Science Date joined Lakehead: August, 2018 Previous Teaching\/Work: David was admitted to the Ontario Bar in January, 1991. He articled at Torys LLP in Toronto and worked there as an associate in their corporate department for roughly five years. After Torys, David joined a boutique firm in Toronto that specialized in bankruptcy-insolvency law, becoming a partner and practicing corporate\/commercial there till 2003. He then served as General Counsel in Canada for Carillion, a publicly-traded, UK-based development company, followed by a similar role for Balfour Beatty Investments, also a publicly-traded, UK-based infrastructure development company. David transitioned to an academic career last year after more than 30 years in private practice. Last year, David taught Civil Practice, Property, Remedies and Trusts. Over the summer, he taught Personal Property Law in Saskatoon at the Native Law Centre at the University of Saskatchewan. This year, he is teaching Contract Law, Evidence, Trusts and Remedies. Research Interests: David's research interests are varied and include improving access to justice with particular interest in the resolution of civil disputes involving Indigenous communities using traditional forms of civil dispute resolution. He is also particularly interested in examining issues related to the practice of law in small town and rural communities. Professional Associations\/Community Involvement: Ontario Bar Association | Law Society of Ontario | Canadian Corporate Counsel Association| Canadian Association for Victims of Torture | Ontario Bar Association Mentorship Program",
    "listed_research_areas":null
  },
  {
    "faculty":"lakehead",
    "name":"Larissa Speak",
    "title":"Assistant Professor",
    "email":"lspeak@lakeheadu.ca",
    "href":"https:\/\/www.lakeheadu.ca\/users\/S\/lspeak\/node\/72564",
    "bio":"Larissa Speak Assistant Professor Department: Bora Laskin Faculty of Law Email: lspeak@lakeheadu.ca Phone Number: +1 807-343-8110ext. 7818 Office Hours: Mon-Fri 8:30 am - 4:30 pm",
    "listed_research_areas":null
  },
  {
    "faculty":"lakehead",
    "name":"Robin Whitehead",
    "title":"Assistant Professor",
    "email":"robin.whitehead@lakeheadu.ca",
    "href":"https:\/\/www.lakeheadu.ca\/users\/W\/rwhitehe\/node\/66739",
    "bio":"Robin Whitehead Assistant Professor Department: Bora Laskin Faculty of Law Email: robin.whitehead@lakeheadu.ca Phone Number: +1 807-343-8010ext. 7858 Office Location: PA3005 Office Hours: Mon-Fri 8:30 am - 4:30 pm Date joined Lakehead: August 2021 Previous Teaching\/Work: Professor Whitehead is a member of the Law Society of British Columbia and worked as a lawyer in small firms and in private practice on civil litigation, criminal defence, environmental, and administrative cases, prior to and during her doctoral studies. She has also worked as an analyst for the Library of Parliament where she assisted the House of Commons Standing Committee on Public Safety and National Security and provided legal and policy research, briefings, and drafting services to members of Parliament. Research Interests: Professor Whitehead’s research considers human rights and mental health disability discrimination and is informed by Critical Disability Theory and Mad Studies. Her current work explores police-involved deaths of persons who experience mental health disability in Canada and the opportunities for, or limitations to, accountability afforded by human rights and constitutional law. Current Courses Taught:Critical Race Theory, Administrative LawSelect Publications:Robin Whitehead & Jennifer Chandler, \"Biocriminal Justice: Exploring Public Attitudes to Criminal Rehabilitation Using Biomedical Treatments\" (2020) 13 Neuroethics 55.Robin Whitehead, \"Policing mental health disabilities\" c13 in J. Chandler & C. Flood, eds, Law and Mind: Mental Health Law and Policy in Canada (Toronto: LexisNexis, 2016).",
    "listed_research_areas":null
  }
]