[
  {
    "faculty":"osgoode",
    "name":"Rabiat Akande",
    "title":"Assistant Professor",
    "email":"rakande@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/akande-rabiat\/",
    "bio":"Professor Rabiat Akande works in the fields of legal history, law and religion, constitutional and comparative constitutional law, Islamic law, international law, and (post)colonial African law and society. Her research explores law’s interplay with global inequality. She investigates this relationship in the historical setting of Europe’s nineteenth and twentieth-century empire, especially in its encounter with Africa and the Muslim World. Her work further grapples with the afterlife of that encounter for law, unveiling legacies that resound far beyond erstwhile colonies. In her recent book, Entangled Domains: Empire, Law and Religion in Northern Nigeria (Cambridge University Press, 2023), Dr. Akande investigates the case of the British imperial encounter in Colonial Northern Nigeria. In particular, the book chronicles contestations between British colonial officials, Christian missionaries, and indigenous Muslim elites over law’s governance religious difference, and grapples with the postcolonial legacy of those struggles. The book illuminates law’s centrality to one of modernity’s most contested issues–the relationship between religion, the state, and society–while also spotlighting law’s complex relationship with power, political theology, identity, and socio-political change. Beyond Entangled Domains, Dr. Akande’s work has appeared in the American Journal of International Law (forthcoming), the Law and History Review, the Journal of Law and Religion, the Supreme Court Law Review, Die Welt des Islam (forthcoming), and in co-edited volumes published by or forthcoming with the Oxford University Press, Cambridge University Press, Edward Elgar Publishing, University of Toronto Press, and the University of Virginia Press. Dr. Akande is currently at work on “Malcolm X, Black Globalism, and the Human Rights Critique of Imperialism,” a book project that investigates the globalist critique of imperialism that was central to Malcolm X’s thought in his last years and inspired by his visits to Africa and the Muslim World. She is also at work on a volume interrogating histories of the idea of the “international” in pre-colonial Africa. Dr. Akande chairs the international legal history project at the African Institute of International Law in Arusha with the support of the African Union and the Gerda Henkel Foundation, among other institutions. Before Osgoode Hall Law School, she was a postdoctoral fellow at the Harvard Academy for International and Area Studies as an Academy Scholar from 2019-2021. She received her Doctor of Juridical Science (SJD) degree from Harvard Law School in 2019 with her dissertation, “Navigating Entanglements: Contestations over Religion-State Relations in British Northern Nigeria, c. 1890-1978” receiving the Law and Society in the Muslim World Prize. At Harvard University, Dr. Akande held the Clark Byse fellowship at the Law School and was a Dissertation Fellow and Graduate Student Associate at the Weatherhead Center for International Affairs. She also served on the editorial board of the Harvard International Law Journal. Dr Akande taught courses at Harvard in the Law School and the Department for African and African American Studies. She also taught at Northeastern University School of Law. Prior to her graduate work, Dr. Akande obtained her Bachelor of Laws from the University of Ibadan, graduating with First Class Honors and at the top of her class. She later studied at the Nigerian Law School, from which she also graduated with First Class Honors. Dr. Akande’s research has been supported by fellowships and grants, including from the US National Science Foundation (as part of a Law and Society Association International Research Collaborative), the Gerda Henkel Foundation, the Cravath International Research fellowship, the Weatherhead Center for International Affairs fellowship, the Program on Law and Society in the Muslim World research grant, among others. She serves on the International Journal of Law in Context editorial board. She is the co-chair of the American Society of International Law’s Africa Interest Group. She is also active in the American Society for Legal History, the Law and Society Association, and the African Studies Association. Research Interests: legal history, law and religion, constitutional and comparative constitutional law, Islamic law, international law and the global south, and (post)colonial African law and society.",
    "listed_research_areas":"legal history; law and religion; constitutional and comparative constitutional law; Islamic law; international law and the global south; and (post)colonial African law and society"
  },
  {
    "faculty":"osgoode",
    "name":"Saptarishi Bandopadhyay",
    "title":"Associate Professor",
    "email":"sbandopadhyay@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/bandopadhyay-saptarishi\/",
    "bio":"I am an Associate Professor at Osgoode Hall Law School. I am also a research Fellow at the Dahdaleh Institute for Global Health Research at York University, and a Senior Fellow at Melbourne University Law School. My first book, All Is Well: Catastrophe and the Making of the Normal State was published by Oxford University Press in 2022. In All Is Well, I offer a history of the mutually constitutive relationship between disasters and states during the eighteenth-century and show the enduring influence of the underlying narratives, instincts, techniques, and practices on global disaster management today. I am currently working on two book projects. The first examines the history of war, environmental degradation\/disasters, and human displacement from 1860 to the present. This research is funded by a Social Sciences and Humanities Council Insight Development Grant and supported by Osgoode Hall Law School, York University’s Center for Refugee Studies, and the Dahdaleh Institute for Global Health Research. The second book project presents a legal and environmental history of the relationship between the international environmentalism movement of the 1960s and 70s, and contemporary global crises of food insecurity and climate change. I have published in encyclopedias, edited volumes and in legal and interdisciplinary journals such as the University of British Columbia Law Review, the Fordham Environmental Law Review, Global Jurist, the Indian Journal of International Law, and the Journal of Intellectual Property Rights. I occasionally write essays and book reviews for public facing periodicals and websites and have developed several case studies for Harvard Law School’s Case Studies Program. During 2016-2017, I was a Visiting Professor and Catalyst Fellow at Osgoode, and an adjunct faculty at Northeastern University School of Law. I hold an SJD, an interdisciplinary doctorate from Harvard Law School, LLMs from Harvard Law School and American University’s Washington College of Law, and a BA LLB (with honors) from the National University of Juridical Sciences, India. At Harvard, I received the Irving Oberman Memorial Environmental Law Prize and the Abram Chayes International Public Service Fellowship. I have also received research and advocacy fellowships from the Canadian Social Sciences and Research Council, the American Society for Legal History, the American Society for Environmental History, the Berkman-Klein Center for Internet and Society, Harvard University’s Office for Scholarly Communication, the Public International Law and Policy Group, the Center for International Environmental Law, Watson Institute for International Studies at Brown University. I have studied and worked in disaster management in central India, in the borderlands between India, Pakistan, and China, and in the Philippines. I have also trained and advised officials and civil society in India, Thailand, Canada, and at the United Nations. From 2006 to 2010, I was an associate with Radon & Ishizumi in New York and worked on pharmaceutical and biotechnology projects. During this time, I also advised public authorities and corporate clients on constitution development in Nepal and environmental policymaking in the Caucasus, respectively. Twitter: @saptarishi_b Research Interests: Law, history, and politics of Disasters, International law, State formation, Environmental law and politics, Environmental conflict, Humanitarianism, Human displacement, Risk, Copyright.",
    "listed_research_areas":"Law; history; and politics of Disasters; International law; State formation; Environmental law and politics; Environmental conflict; Humanitarianism; Human displacement; Risk; Copyright"
  },
  {
    "faculty":"osgoode",
    "name":"Stephanie Ben-Ishai",
    "title":"Professor and York University Distinguished Research Professor",
    "email":"sbenishai@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/ben-ishai-stephanie\/",
    "bio":"Professor Stephanie Ben-Ishai is a Distinguished Research Professor and Full Professor at Osgoode Hall Law School, where she engages in research and teaching on bankruptcy, contract, commercial law, and financial crises. She has authored or co-authored nine books and more than 50 refereed articles, including seminal and innovative texts on bankruptcy and contract law. She holds her LLB from Osgoode Hall Law School, and her LLM from Harvard Law School, where she studied as a Fulbright Scholar and SSHRC Doctoral Scholar as well as receiving the American Bankruptcy Institute Medal of Excellence on graduation. Professor Ben-Ishai has been nationally and internationally recognized as an expert in each of her research areas. She has been consulted by private actors, governments and self-regulatory institutions, and served as a Scholar in Residence with the Law Commission of Ontario. Her work has been cited by every level of Canadian court and she has given expert testimony to Canadian and American courts. Professor Ben-Ishai’s research has been consistently funded by research grants, including four major Social Sciences and Humanities Research Council (SSHRC) grants as Principal Investigator; other significant grants have been provided by the Law Foundation of Ontario, the Law Commission of Canada, Industry Canada, and the Schulich School of Business National Research Program in Financial Services and Public Policy. An active participant in domestic and international professional committees, research networks and law reform efforts, Professor Ben-Ishai also serves as Co-Founder and Editor of the Insolvency Institute of Canada Law Journal, established in 2011. To date, she has held visiting professorships at eight law schools in four countries, and has served as an INSOL International Scholar, Distinguished Fulbright Fellow, Sprout Fellow in Canadian Studies and the Thomas Feeney Visiting Professor of Business Law. Her research contributions have been presented at conferences around the world to lay audiences, lawyers, judges and academic colleagues from a wide range of academic disciplines. Professor Ben-Ishai has taught courses across the private law curriculum in multiple formats (online, video conference, seminar, lecture and small group) of varying lengths and intensity across Canada, in the United States, Europe, Australia and New Zealand at the undergraduate law and social science and graduate levels. She also serves as the Academic Director of the Osgoode Business Clinic, which provides legal advice to small businesses which might not otherwise be able to afford legal services. At Osgoode, Professor Ben-Ishai has held a number of senior administrative responsibilities, including as Director of the graduate programs in Bankruptcy and Banking and Finance Law. She has chaired almost every major Law School committee, including, most recently, the Faculty Recruitment Committee and Faculty Council, served on the University Senate and as a Director of Parkdale Community Legal Services. Professor Ben-Ishai has supervised graduate level research in bankruptcy, banking, contracts, corporate\/commercial law, and financial regulation. She is willing to read novel proposals in this area from strong students interested in working with her. Research Interests: Corporate\/Commercial Law",
    "listed_research_areas":"Corporate\/Commercial Law"
  },
  {
    "faculty":"osgoode",
    "name":"Benjamin L. Berger",
    "title":"Professor & York Research Chair in Pluralism and Public Law",
    "email":"bberger@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/berger-benjamin\/",
    "bio":"Professor Benjamin L. Berger is Professor and York Research Chair in Pluralism and Public Law at Osgoode Hall Law School. In 2020 he was elected as a Member of the College of the Royal Society of Canada. Professor Berger served as Associate Dean (Students) from 2015-2018. He holds an appointment as Professor (status only) in the Department for the Study of Religion at the University of Toronto and is a member of the faculty of the Graduate Program in Socio-Legal Studies at York University. Prior to joining Osgoode, he was an Associate Professor in the Faculty of Law, and was cross-appointed in the Department of Philosophy, at the University of Victoria, where he began teaching in 2004. He holds a JSD and LLM from Yale University, where he studied as a Fulbright Scholar and a SSHRC doctoral fellow. He earned his LLB and the Law Society Gold Medal from the University of Victoria, and was awarded the Gold Medal in Arts and the Governor General’s Academic Medal for his BA (Hons) studies at the University of Alberta. In 2002-2003, Professor Berger served as law clerk to the Rt. Honourable Beverley McLachlin, former Chief Justice of Canada. His areas of research and teaching specialization are law and religion, criminal and constitutional law and theory, and the law of evidence. He has published broadly in these fields and his work has appeared in leading legal and interdisciplinary journals and edited collections. He is the author of Law’s Religion: Religious Difference and the Claims of Constitutionalism (University of Toronto Press, 2015), is a general editor of the Hart Publishing series Constitutional Systems of the World, and served as Editor in Chief of the Canadian Journal of Law and Society from 2014-2018. He is also co-editor of multiple edited collections, including Religion and the Exercise of Public Authority (Hart, 2016) and The Grand Experiment: Law and Legal Culture in British Settler Societies (UBC Press, 2008). He has been a principal investigator or collaborator on multiple research grants and has received awards for his scholarly work, including the 2010 Canadian Association of Law Teachers’ Scholarly Paper Award for an article entitled “The Abiding Presence of Conscience: Criminal Justice Against the Law and the Modern Constitutional Imagination” and, in 2015, the CALT-ACPD Prize for Academic Excellence. Professor Berger is active in judicial, professional, and public education, is involved in public interest advocacy, and has appeared before the Supreme Court of Canada. While at UVic Law, Professor Berger twice received the Terry J. Wuester Teaching Award, and was awarded the First Year Class Teaching Award. He received the Osgoode Hall Law School Teaching Award in 2013. Professor Berger convenes the Osgoode Colloquium in Law, Religion & Social Thought and is the Academic Program Director of the Osgoode Professional LLM in Criminal Law and Procedure. Research Interests: Law and Religion; Criminal and Constitutional Law and Theory; the Law of Evidence; Legal History; Judgment and the Judiciary; Law and the Humanities.",
    "listed_research_areas":"Law and Religion; Criminal and Constitutional Law and Theory; the Law of Evidence; Legal History; Judgment and the Judiciary; Law and the Humanities"
  },
  {
    "faculty":"osgoode",
    "name":"Kate Glover Berger",
    "title":"Associate Professor",
    "email":"kgberger@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/glover-berger-kate\/",
    "bio":"Professor Kate Glover Berger joined the faculty at Osgoode Hall Law School in 2020. From 2015-2020, Professor Berger was an Assistant Professor at the Faculty of Law at Western University, where she was co-director of Western Law’s Public law research group and taught Administrative Law, Constitutional Law, and specialized seminars in Public Law. Professor Berger earned her doctorate in law from McGill University as a Vanier Scholar and held the O’Brien Fellowship in Human Rights and Legal Pluralism. She earned her masters in law from the University of Cambridge, where she was the Rt. Hon. Paul Martin Senior Scholar. In 2009-2010, she served as law clerk to the Honourable Justice Rosalie Abella of the Supreme Court of Canada. Professor Berger has appeared as counsel before all levels of court, including the Supreme Court of Canada, and has served as an expert witness before the Senate, providing testimony to the Special Senate Committee on Senate Modernization. She is the academic chair of the Annual National Forum on Administrative Law and chair of the Advisory Board of the Canadian Association of Law Teachers. Professor Berger’s scholarly and teaching expertise lies in administrative and constitutional law. She researches and publishes widely in these areas, with an emphasis on administrative law and its relationship to the constitution; the nature of the administrative state; the design of institutions and fair process; judicial review of administrative action; and constitutional principles, architecture, and amendment. Her research appears in leading Canadian and international journals and edited collections, and has been translated for inclusion in international publications. She is the author of “The Principles and Practices of Procedural Fairness” in Administrative Law in Context, 3d ed (Toronto: Emond, 2018) and the chapter on Canada in Foundations and Traditions of Constitutional Amendment (Oxford: Hart, 2017). Professor Berger has been invited to present her scholarship across Canada and around the world, including at the Frontiers of Public Law Conference (University of Melbourne & University of Cambridge), the Colloque sur la modification constitutionelle dans tous ses états (Palace des Académies, Brussels), and the Comparative Public Law Workshop (American Society for Comparative Law & University of Ottawa). In 2017-18, Professor Berger held the inaugural Dean’s Research Fellowship at Western Law. In 2017, her research was awarded the Prix d’Excellence de L’Association des Doyens des Études Supérieures au Québec. A recipient of multiple teaching awards, including the Western Law Award for Teaching Excellence (2015-16) and the J. McLeod Professor of the Year Award (2016-17), Professor Berger teaches JD courses and seminars in administrative law, constitutional law, and advanced public law. She is also active in graduate legal education, and in addition to supervising graduate research at both the masters and doctoral level, she has taught graduate courses on research methods and legal inquiry. Committed to ongoing legal education, Professor Berger also lectures on specialized topics of public law in professional development programs. Research interests: Administrative Law, Constitutional Law, and Public Law",
    "listed_research_areas":null
  },
  {
    "faculty":"osgoode",
    "name":"Faisal Bhabha",
    "title":"Associate Professor",
    "email":"fbhabha@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/bhabha-faisal\/",
    "bio":"Faisal Bhabha is an Associate Professor at Osgoode Hall Law School in Toronto, Canada. He also serves as the Faculty Director of the Canadian Common Law LLM degree program. He has researched and published in the areas of constitutional law, multiculturalism, law and religion, disability rights, national security and access to justice. He teaches constitutional law, human rights, legal ethics, and appellate advocacy. Previously, he sat as Vice-chair of the Human Rights Tribunal of Ontario (2008-2011). He maintains a varied public and private law practice, appearing before administrative boards and tribunals and at all levels of court, including the Supreme Court of Canada. He advises and represents a variety of individuals and public interest organizations in matters pertaining to constitutional law and human rights. He has appeared as an expert witness before Canadian parliamentary committees and served as a member of the Equity Advisory Group of the Law Society of Ontario. He has lived and worked in the Middle East and South Africa, and has lectured and taught in many countries. He is currently a senior editor with the International Review of Human Rights Law. Research Interests: constitutional law; equality and anti-discrimination; administrative law; legal ethics and professionalism; legal process; dispute resolution; legal education",
    "listed_research_areas":"constitutional law; equality and anti-discrimination; administrative law; legal ethics and professionalism; legal process; dispute resolution; legal education"
  },
  {
    "faculty":"osgoode",
    "name":"Amar Bhatia",
    "title":"Associate Dean (Students) & Associate Professor",
    "email":"abhatia@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/bhatia-amar\/",
    "bio":"Amar Bhatia joined Osgoode’s full-time faculty on July 1, 2014, after serving as a Catalyst Fellow and Visiting Professor at Osgoode for the 2013-14 academic year. He has undergraduate and graduate degrees in English and postcolonial literature (Queen’s; Sussex) and received an LLB from Osgoode in 2005. While an LLB student at Osgoode, he worked and volunteered with CLASP, the Innocence Project, Duty Counsel’s office, and Parkdale Community Legal Services. He then articled and worked in union-side labour and employment law in Toronto before returning to graduate school. He subsequently obtained an LLM from the University of Toronto Faculty of Law (U of T), where he received the Howland Prize for most outstanding performance in the program. Professor Bhatia was awarded a SSHRC CGS Doctoral Scholarship to pursue his SJD, which he obtained from U of T. His dissertation looked at issues of status and authority of migrant workers and Indigenous peoples under Canadian immigration law, Aboriginal law, treaty relations, and Indigenous legal traditions. In addition to his research, Professor Bhatia has also been active at Osgoode by co-editing the Journal of Law Social Policy, serving on the Admissions Committee, sitting on the Board of Directors for Parkdale Community Legal Services, and being a member of the Third World Approaches to International Law Review’s editorial collective. Professor Bhatia has taught a variety of courses at Osgoode, including property law, refugee law, globalization & the law (focused on migrant work), and co-directing the Intensive Program in Indigenous Lands, Resources and Governments.",
    "listed_research_areas":null
  },
  {
    "faculty":"osgoode",
    "name":"Andrée Boisselle",
    "title":"Associate Professor",
    "email":"aboisselle@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/boisselle-andree\/",
    "bio":"Andrée Boisselle’s research interests are in the areas of indigenous law, comparative and constitutional law, pluralism and postcolonial legal theory. She is currently completing her doctorate in the Faculty of Law at the University of Victoria. Her doctoral research on Stó:lõ constitutionalism and the Coast Salish legal tradition has been supported by scholarships from the Trudeau Foundation and the Social Sciences and Humanities Research Council of Canada. Her master’s thesis critically examined the development of the duty to consult First Nations in Canadian law. It received the Quebec Association of Law Professors Prize in 2008. Before pursuing graduate studies, she practised litigation in Québec with McCarthy Tétrault LLP and did contractual work with the Supreme Court of Canada.",
    "listed_research_areas":null
  },
  {
    "faculty":"osgoode",
    "name":"Margaret Boittin",
    "title":"Assistant Professor",
    "email":"mboittin@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/margaret-boittin\/",
    "bio":"Professor Boittin is the author of The Regulation of Prostitution in China: Law in the Everyday Lives of Sex Workers, Police Officers, and Public Health Officials, forthcoming with Cambridge University Press. Based on ethnographic observation, interviews, and surveys, the book examines how the regulation of prostitution shapes both the lives of female sex workers and the frontline police officers and public health officials who are responsible for implementing the laws and policies that govern sex work in China. Boittin also conducts research on the regulation of human trafficking and forced labor. She has carried out randomized controlled trials examining rights awareness campaigns on labor abuse of migrant domestic workers in Hong Kong, and on attitudes and behaviors pertaining to human trafficking vulnerability of both the general population and police officers in Nepal. Her research has been supported by the US Department of Labor, USAID, Humanity United, and the National Science Foundation. She received her Ph.D. in Political Science from UC Berkeley, and her JD from Stanford. Her articles have been published in Law & Society Review, Law & Policy, and American Political Science Review.",
    "listed_research_areas":null
  },
  {
    "faculty":"osgoode",
    "name":"Ruth Buchanan",
    "title":"Professor",
    "email":"rbuchanan@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/buchanan-ruth\/",
    "bio":"Ruth Buchanan joined Osgoode Hall Law School as an Associate Professor in 2006 and was promoted to Full Professor in 2016. Prior to joining the Osgoode faculty, Professor Buchanan taught at the law schools of the University of British Columbia and the University of New Brunswick. Professor Buchanan also holds an ongoing appointment as a Senior Fellow at Melbourne Law School, where she teaches in the Melbourne Law Masters program. Professor Buchanan holds an SJD from the University of Wisconsin-Madison, an LLB from the University of Victoria and an AB from Princeton University. In 2011, Professor Buchanan founded the Law.Arts.Culture Colloquium, to create a vibrant forum for the discussion of emerging interdisciplinary work on law and humanities. Since that time, Professor Buchanan, through LAC, has hosted more than two dozen speakers, events and installations. She is also a past Director of the Graduate Program (Research), and a past co-Director of the Institute for Feminist Legal Studies. An interdisciplinary legal scholar whose work spans critical legal theory, sociology of law and cultural legal studies, Dr. Buchanan’s scholarship has engaged with a range of topics including NAFTA and labour rights, the WTO and global constitutionalism, social movements and resistance to globalization, Indigenous law and legal pluralism, law and film. She has published widely and collaborates frequently with legal scholars in Canada and internationally. Professor Buchanan co-edited the collections Law in Transition: Human Rights, Development and Transitional Justice (2014) with Peer Zumbansen and Reading Modern Law: Critical Methodologies and Sovereign Formations (2012) with Sundhya Pahuja and Stewart Motha. She has published widely, including in the Journal of Law, Culture and Humanities; Miami Law Review; Leiden Journal of International Law; Law,Text,Culture; Journal of Legal Education, Nordic Journal of International Law; Osgoode Hall Law Journal, and the Journal of Law and Society. She has been involved in the editorial boards or editorial advisory boards of the Canadian Journal of Women and Law, Journal of Law, Culture and Humanities, Transnational Legal Theory. In 2015-16, Professor Buchanan was awarded an Osgoode Hall Research Fellowship for her ongoing project, “Visualizing Developments,” which considers the variety of visual mechanisms through which knowledge about development is produced and disseminated by international institutions. Professor Buchanan is also currently writing a book on International Development with Sundhya Pahuja and Luis Eslava as part of the Routledge-Cavendish Critical Approaches to Law series. Professor Buchanan has taught courses in the areas of: Globalization and Law, Law and Social Change, Trade, Human Rights and Development, Law and Film. In the Osgoode Graduate Program, she has taught the Legal Research seminar and convened the Study Group on Law in a Global Context. Professor Buchanan has supervised many LLM and doctoral students in the areas of law and development, legal theory, legal sociology, or visual legal studies and law and film. Research Interests: Law and Development, Legal Theory, Law and Film",
    "listed_research_areas":"Law and Development; Legal Theory; Law and Film"
  },
  {
    "faculty":"osgoode",
    "name":"Suzanne Chiodo",
    "title":"Assistant Professor",
    "email":"schiodo@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/chiodo-suzanne\/",
    "bio":"Professor Suzanne Chiodo’s areas of teaching and research specialization are in civil procedure, class actions and access to justice. Professor Chiodo joined the faculty at Osgoode Hall Law School in July 2022. From 2020 to 2022, she was a visiting professor at Western University Faculty of Law, where she taught civil procedure, class actions and other litigation-related courses. Prior to that, she taught tort and criminal law as a stipendiary lecturer at the University of Oxford and legal process as an adjunct faculty member at Osgoode. Professor Chiodo earned her doctorate in law as a SSHRC Doctoral Fellow at the University of Oxford, where she also completed her undergraduate studies in modern history. She earned her master of laws degree from Osgoode in 2017 and a juris doctor with distinction from Western Law in 2011. At Western, she helped to establish the Western Journal of Legal Studies. Before entering academia, Professor Chiodo practiced as a class actions lawyer and insurance defence lawyer. She served as a judicial clerk to Justice James A. O’Reilly with the Federal Court of Canada and was called to the Ontario bar in 2012. Professor Chiodo has published widely in her field. Her book The Class Actions Controversy: The Origins and Development of the Ontario Class Proceedings Act was based on her LLM thesis and was published in 2018 by Irwin Law and the Osgoode Society for Canadian Legal History. It won the Peter Oliver Prize in Canadian Legal History and was shortlisted for the 2019 Legislative Assembly of Ontario Speaker’s Book Award. She has written a chapter in Class Actions in Canada (Emond Montgomery, 2018), and has published numerous articles in the U.K.’s Civil Justice Quarterly, the Osgoode Hall Law Journal, Canadian Class Action Review and other journals in Canada and the United Kingdom. Professor Chiodo’s work on class action reform has influenced policy thinking on both sides of the Atlantic. She co-organized one of the first class-actions conferences in England and has made submissions to the U.K. Ministry of Justice on legislative reform. In Ontario, her work was cited in the Law Commission of Ontario’s report Class Actions: Objectives, Experiences and Reforms, the first comprehensive review of class actions since they were enacted in the province. She has also made submissions to other legislatures around the world on the subject of class action reform. Research Interests: civil procedure, access to justice, class actions, courts modernization, legal history, and the impact of COVID-19 on court processes.",
    "listed_research_areas":"civil procedure; access to justice; class actions; courts modernization; legal history; and the impact of COVID-19 on court processes"
  },
  {
    "faculty":"osgoode",
    "name":"Barnali Choudhury",
    "title":"Professor and Director, Jack & Mae Nathanson Centre on Transnational Human Rights, Crime and Security",
    "email":"bchoudhury@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/choudhury-barnali\/",
    "bio":"Barnali Choudhury is a Professor of Law and the Director of the Jack & Mae Nathanson Centre on Transnational Human Rights, Crime and Security. Prior to joining Osgoode, she was a Professor at University College London and academic director of UCL’s Global Governance Institute. She is an internationally recognized expert on business and international economic issues, particularly as they relate to issues of human rights. She has published numerous books, including Corporate Duties to the Public (Cambridge University Press, 2019); Understanding the Company: Corporate Governance and Theory (Cambridge University Press, 2017); and Public Services and International Trade Liberalization: Human Rights and Gender Implications (Cambridge University Press, 2012), as well as a forthcoming commentary on the United Nations Guiding Principles on Business and Human Rights. Her work has appeared in the Oxford Journal of Legal Studies, Columbia Journal of Transnational Law, Berkeley Business Law Journal, International & Comparative Law Quarterly, Journal of Corporate Law Studies, as well as in numerous other journals and in book chapters. It has also been featured in the Oxford Business Law Blog, the Columbia Law School Blue Sky Blog and the American Society of International Law Insight, among others. She has written op-eds for the Globe and Mail, the Neue Zurcher Zeitung, and iPolitics and her work has been featured in Bloomberg Businessweek. She has held numerous research grants including a grant from the Leverhulme Trust, one of the UK’s most prestigious research bodies. She is regularly invited to give talks and has presented her work throughout Asia, Europe, the Middle East, North America and at the United Nations. She has visited at New York University, University of Cambridge, University of St. Gallen, University of Otago, and at the Max Planck Institute for Comparative and Private Law. In addition to numerous academic citations, her work has been cited by the United Nations, the UK’s House of Commons, the House of Lords EU Select Committee, international arbitral tribunals and relied on by governments and international non-governmental organizations. Research Interests: Corporate Law, Business & Human Rights, Corporate Social Responsibility, International Investment Law, Corporate Governance, International Trade Law, International Arbitration",
    "listed_research_areas":"Corporate Law; Business & Human Rights; Corporate Social Responsibility; International Investment Law; Corporate Governance; International Trade Law; International Arbitration"
  },
  {
    "faculty":"osgoode",
    "name":"Mary G. Condon",
    "title":"Professor",
    "email":"mcondon@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/condon-mary-g\/",
    "bio":"Mary Condon served as Dean of Osgoode Hall Law School from July 1, 2019 to August 31, 2023. She served as Interim Dean from May 1, 2018 to June 30, 2019 and as Associate Dean (Academic) from July 2016 to June 2018. Professor Condon teaches Securities Regulation and Advanced Securities in Osgoode’s JD program and also directs and teaches in the Professional LLM in Securities Law program. Her research interests are focused primarily on the regulation of securities markets, investment funds, online investing, and pensions. She is co-author of Business Organizations: Practice, Theory and Emerging Challenges (with Robert Yalden, Janis Sarra, Paul Paton, Mark Gillen, Carol Liao, Michael Deturbide, Mohamed Khimji, Bradley Bryan and Gary Campo). She is co-author of Securities Law in Canada: Cases and Commentary (with Anita Anand, Janis Sarra and Sarah Bradley), [3rd edition, 2017]. She is the author of Making Disclosure: Ideas and Interests in Ontario Securities Regulation (UTP). She has also written articles, book chapters and policy papers on topics related to securities regulation and pensions policy and has given invited lectures on these topics in Canada and internationally. In October 2023, she was appointed as a part-time adjudicator of the Capital Markets Tribunal (Ontario). In January 2024, she was appointed a member of the Central Bank of Ireland Commission. Between 2018 and 2021, she was appointed a member of the board of the Capital Markets Authority Implementation Organization (CMAIO), an interim body set up to assist with the establishment of a Capital Markets Regulatory Authority for co-operating jurisdictions in Canada. Between 2008 and 2016 she was appointed by the Ontario government as a Commissioner and Board Member of the Ontario Securities Commission (OSC). For three of those years (2011-2014) she served as one of two full-time Vice-Chairs of the OSC. In that capacity she was executive sponsor of a number of policy initiatives. She also issued numerous adjudicative decisions as a member of the OSC’s tribunal. In 2018, she was named one of the top 100 Most Powerful Women in Canada (Public Sector Category) by Women’s Executive Network. Between 2014 and 2016 she served as a member of Canada’s National Steering Committee for Financial Literacy. She was a member of the Board of Trustees of the York University Pension Fund between 2005 and 2014. In the 2009 winter term, she was awarded the Walter S. Owen Chair at the Faculty of Law, University of British Columbia, where she was also the co-director of the National Centre for Business Law. She joined the Osgoode faculty in 1992, having been the first recipient of the Alan Marks Medal for her doctoral thesis at the Faculty of Law, University of Toronto. Research Interests: Corporate\/Securities Law, Pensions, Feminist Legal Studies",
    "listed_research_areas":"Corporate\/Securities Law; Pensions; Feminist Legal Studies"
  },
  {
    "faculty":"osgoode",
    "name":"Carys J. Craig",
    "title":"Associate Professor",
    "email":"ccraig@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/craig-carys-j\/",
    "bio":"Dr. Carys Craig joined the faculty at Osgoode Hall Law School in 2002. She is the Academic Director of the Osgoode Professional Development LLM Program in Intellectual Property Law, a founding member of IP Osgoode (Osgoode’s Intellectual Property Law & Technology Program), and recently served as Osgoode’s Associate Dean (Research & Institutional Relations). In 2018, she held a MacCormick Research Fellowship at the University of Edinburgh. A recipient of multiple teaching awards, including the 2015 President’s University-Wide Teaching Award, Dr. Craig teaches JD, graduate and professional courses in the areas of intellectual property, copyright and trademark law, and legal theory. She researches and publishes widely on intellectual property law and policy, with an emphasis on authorship (drawing on critical and feminist theory), users’ rights and the public domain. She is the author of Copyright, Communication & Culture: Towards a Relational Theory of Copyright Law (2011), and the co-editor of Trade-marks and Unfair Competition Law: Cases and Commentary, 2nd ed. (Toronto: Carswell, 2014) and Copyright: Cases and Commentary on the Canadian and International Law, 2nd ed. (Toronto: Carswell, 2013). Her award-winning work has been cited with approval by the Supreme Court of Canada. Dr. Craig holds a First Class Honours Bachelor of Laws (LLB Hons) from the University of Edinburgh in Scotland, a Master of Laws (LLM) from Queen’s University in Kingston, and a Doctorate in Law (SJD) from the University of Toronto, where she was a graduate fellow of Ontario’s Centre for Innovation Law and Policy.",
    "listed_research_areas":null
  },
  {
    "faculty":"osgoode",
    "name":"Giuseppina (Pina) D'Agostino",
    "title":"Associate Professor",
    "email":"gdagostino@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/dagostino-giuseppina\/",
    "bio":"Professor Giuseppina (Pina) D’Agostino is a law professor, lawyer, public speaker, board director and recognized international scholar at Osgoode Hall Law School, York University specializing in intellectual property (IP), technology and innovation law and policy. She joined Osgoode in 2006 and is regularly called by Canadian and foreign governments for advice, has testified before Parliament and is a widely published author, regularly serves as a consultant and is a cited authority at the Supreme Court of Canada and in various media. She serves as the Editor-in-Chief of the Intellectual Property Journal. Professor D’Agostino brings her creativity and passion to trailblaze new initiatives and to serve in new roles as Founder and Director of the globally-recognized IP Osgoode, the award-winning, IPilogue, the IP Intensive, the IP Innovation Clinic, the first legal clinic of its kind helping inventors and start-ups across Canada and, more recently, founded the AI-powered IP Innovation ChatBot allowing underrepresented groups and the general public greater access to IP information. She began her legal career as an Associate in a large Toronto law firm and was later recruited into the Canadian Government by the Recruitment of Policy Leaders (RPL) as a Senior Policy Analyst working on copyright policy. She serves on the Board of Directors of Alectra Inc. and Chairs its GRE&T Centre Advisory Committee advancing innovation and sustainable energy solutions. She held an Order in Council Appointment at the McMichael Canadian Art Collection where she served as Trustee, and currently sits on its Art Advisory Committee. Professor D’Agostino is Co-Chair of the York University AI & Society Task Force, is appointed to the City of Vaughan Smart City Task Force and is a Senior Fellow at the Centre for International Governance Innovation (CIGI). She spent her last sabbatical as a Visiting Scholar at Stanford University. Prof D’Agostino is the recipient of various tri-council grants, honours and awards and is currently working on the second edition of Copyright Law (with Prof David Vaver, Irwin Law). Her peer-reviewed articles and her three books Copyright, Contract, Creators: New Media, New Rules, The Common Law of Intellectual Property: Essays in Honour of Professor David Vaver and Leading Legal Disruption: Artificial Intelligence and a Toolkit for Lawyers and the Law (with A Gaon and C Piovesan) are widely available. She holds a Masters and Doctorate in Law (University of Oxford) with distinction, an LLB (Osgoode Hall Law School), an HonBA, summa cum laude, in English and Political Science and a specialization in French (York University), is an ICD.D from the Rotman School of Management, University of Toronto and is a member of the Law Society of Ontario (2001 call). Should you be interested in working with Prof D’Agostino on any of her research projects, please feel free to get in touch with her directly at gdagostino@osgoode.yorku.ca Research Interests: Intellectual Property, data governance & ownership, Innovation law & policy, emerging technologies (ie Artificial Intelligence, IoT, robotics, 3D printing, Blockchain etc)",
    "listed_research_areas":"Intellectual Property; data governance & ownership; Innovation law & policy; emerging technologies (ie Artificial Intelligence; IoT; robotics; 3D printing; Blockchain etc)"
  },
  {
    "faculty":"osgoode",
    "name":"Signa A. Daum Shanks",
    "title":"Associate Professor",
    "email":"sdaumshanks@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/daum-shanks-signa\/",
    "bio":"Signa A. Daum Shanks started at Osgoode in 2014 after working at the University of Saskatchewan’s College of Law. Her teaching has included classes such as Torts, Law and Economics, Aboriginal Self-government, Canadian Legal History, the Kawaskimhon Aboriginal Rights Moot, Game Theory and the Law (via Monash University Law School), Indigenous Peoples and Canadian Law, Comparative Indigenous Legal Traditions and Indigenous Peoples and the Canadian Constitution in the part-time LLM in Constitutional Law. As well, she has taught at the summer program hosted at the Indigenous Law Centre in Saskatoon and the Nunavut Law Program in Iqaluit. Research Interests: Law and Economics, Indigenous Governance, Legal History Currently on leave.",
    "listed_research_areas":"Law and Economics; Indigenous Governance; Legal History"
  },
  {
    "faculty":"osgoode",
    "name":"Valerio De Stefano",
    "title":"Canada Research Chair in Innovation Law and Society",
    "email":"vdestefano@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/de-stefano-valerio\/",
    "bio":"Professor Valerio De Stefano, PhD, joined Osgoode as a tenured professor in January 2022 and was then appointed as the inaugural Canada Research Chair in Innovation, Law and Society. From October 2017 to December 2021, he was the BOF-ZAP Research Professor of Labour Law at the Institute for Labour Law and the Faculty of Law of the University of Leuven (KU Leuven) in Belgium. Valerio De Stefano read law at Bocconi University in Milan, Italy, where he obtained a master’s degree in 2006 and later received his doctoral degree (2011). At Bocconi University, he served as a postdoctoral researcher between 2011 and 2014 while also being a part-time associate in an international law firm. From 2014 to 2017, he worked as an officer of the International Labour Organization in Geneva. During his career, he was a visiting academic at the University College London (UCL), a postdoctoral member of Clare Hall College at the University of Cambridge (2013), a Distinguished Speaker for Spring 2018 at the “William C. Wefel Center for Employment Law” at Saint Louis University Law School (2018), and a Senior Fellow (Melbourne Law Masters) at the University of Melbourne (2019). In 2018, he was awarded an Odysseus Grant from the Research Foundations – Flanders (FWO) amounting to 880,000 Euro for an interdisciplinary research project on the working conditions and labour protection of platform workers. Since 2020 he was also the principal investigator at the KU Leuven of an Horizon2020 Grant about in-work poverty. Valerio De Stefano regularly publishes articles in major specialized academic journals. In 2016, he was the guest editor of a special issue of the Comparative Labour Law and Policy Journal on “Crowdsourcing, the Gig-Economy, and the Law”. In 2019, he was the guest editor of a special issue of the same journal on “Automation, Artificial Intelligence, and Labour Protection”. He also was the co-editor of a special issue on “Testing the ‘Personal Work’ Relation: New Trade Union Strategies for New Forms of Employment” published by the European Labour Law Journal. In 2022, with professor Antonio Aloisi, he published “Your Boss Is an Algorithm. Artificial Intelligence, Platform Work and Labour” (Hart Publishing), a monograph about algorithmic management and artificial intelligence at work. He is the co-editor of the Dispatches Session of the Comparative Labour Law and Policy Journal and an Editorial Adviser of the International Labour Review. Prof. De Stefano acted as a consultant for the International Labour Office, the European Parliament, Eurofound, the Joint Research Center of the EU Commission and national governments. His research is also frequently referred to by governments and international organisations, including the International Labour Organisation, the OECD, the European Commission, and the European Parliament, and has been cited by courts, parliamentary bills, policy reports, employers’ and workers’ organizations, and media worldwide. Besides numerous academic conferences, lectures and seminars, he was invited to speak as an expert on the labour protection of new forms of work at the European Parliament, the European Social and Economic Committee, the OECD, and the Canada-EU dialogue on employment, social affairs and decent work. He is a member of the OECD’s Network of Experts on AI (One AI). Research Interests: Labour Law, Employment Law, Law and Technology, Artificial Intelligence and Law, Algorithmic Management, Artificial Intelligence and Work, Digitalisation and Society, Platform Work, Non-Standard Employment, International and Comparative Labour law.",
    "listed_research_areas":"Labour Law; Employment Law; Law and Technology; Artificial Intelligence and Law; Algorithmic Management; Artificial Intelligence and Work; Digitalisation and Society; Platform Work; Non-Standard Employment; International and Comparative Labour law"
  },
  {
    "faculty":"osgoode",
    "name":"Karen Drake",
    "title":"Associate Professor",
    "email":"kdrake@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/drake-karen\/",
    "bio":"Karen Drake is a member of the Wabigoon Lake Ojibway Nation who researches and teaches in the areas of Canadian law as it affects Indigenous peoples, Anishinaabe constitutionalism, Indigenous pedagogy within legal education, property law, and dispute resolution including civil procedure and Indigenous dispute resolution. Professor Drake served as Osgoode’s Associate Dean (Students) throughout the pandemic, from July 2020 to June 2023. She joined the Osgoode faculty in July 2017 from the Bora Laskin Faculty of Law at Lakehead University where she had been a founding Co-Editor in Chief of the Lakehead Law Journal. Prior to joining Lakehead, she articled with Cassels Brock & Blackwell LLP, completed a clerkship with the Ontario Court of Appeal, served as a part-time judicial law clerk with the Federal Court, and practised with Erickson & Partners, focusing on legal issues impacting Indigenous peoples, human rights, and civil litigation. Professor Drake is currently the principal investigator, in partnership with the Sarnia-Lambton Native Friendship Centre, on a SSHRC Partnership Engage Grant, which will be used to develop a methodology for assessing the effectiveness of the Bkejwanong (Walpole Island) First Nation Court and the Sarnia Indigenous Persons Court. Professor Drake has presented at education seminars held for Canada’s Department of Justice, Ontario’s Ministry of Indigenous Relations and Reconciliation, the Ontario Human Rights Commission, and the National Judicial Institute. She was the recipient of the Osgoode Legal and Literary Society’s Equity Award in 2018, and of the Osgoode Hall Law School Teaching Award in 2019. She is a member of the legal advisory panel for RAVEN and previously served as a Commissioner of the Ontario Human Rights Commission, on the Board of Directors of the Indigenous Bar Association, and on the Board of Directors of the Human Rights Legal Support Centre.",
    "listed_research_areas":null
  },
  {
    "faculty":"osgoode",
    "name":"Susan G. Drummond",
    "title":"Associate Professor",
    "email":"sdrummond@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/drummond-susan-g\/",
    "bio":"Professor Susan Drummond joined Osgoode’s faculty in 1999, and specializes in the areas of legal anthropology, comparative law, civil law, family law, and wills and estates. She was the first student in Canada to graduate with both a civil and common law degree as well as a Master’s in Social Work. She has a doctorate in law from McGill University. Her BA in philosophy and her postgraduate Diplôme d’Etudes Approfondies from the Université d’Aix-Marseille, specializing in legal theory and legal anthropology, make her a truly interdisciplinary scholar. Beyond her publications in scholarly journals, she has published three books, Incorporating the Familiar: An Investigation into Legal Sensibilities in Nunavik, based on fieldwork on the interactions between state and non-state criminal law sensibilities in Inuit communities in northern Quebec; Mapping Marriage Law in Spanish Gitano Communities, based on field work on non-state family law in Andalucia, which won the Canadian Law and Society Association\/Association canadienne droit et société 2006 Book Prize; and Unthinkable Thoughts; Academic Freedom and the One State Model for Israel and Palestine, based on fieldwork on the intersections between politically controversial ideas and the Canadian academy, was published in November, 2013. Professor Drummond is currently engaged in an extensive, fine-grained ethnographic study of elder law, elder financial abuse, and estates and trust law and litigation in Ontario, with a focus on legal practice, legal ethics, and legal professionalism in the associated bar. Research Interests: Family Law, Estates and Trusts, Legal Theory, Comparative Law, Legal Anthropology",
    "listed_research_areas":"Family Law; Estates and Trusts; Legal Theory; Comparative Law; Legal Anthropology"
  },
  {
    "faculty":"osgoode",
    "name":"Lisa Dufraimont",
    "title":"Professor",
    "email":"ldufraimont@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/lisa-dufraimont\/",
    "bio":"Professor Lisa Dufraimont joined Osgoode Hall Law School in July 2015. She teaches and conducts research in the areas of criminal law and procedure and evidence. Prior to joining Osgoode, Professor Dufraimont held a faculty position at the Queen’s University Faculty of Law, where she began teaching as an Assistant Professor in 2006, became an Associate Professor in 2012, and served as Acting Associate Dean (Academic) for the first half of 2015. She earned her JD from the University of Toronto Faculty of Law, and was awarded both the Gold Medal and the Dean’s Key. She also holds an LLM and JSD from Yale University. She served as law clerk to the Honourable Justices Catzman, Carthy, Laskin and Rosenberg at the Court of Appeal for Ontario and was admitted to the Bar of Ontario in 2003. Professor Dufraimont has published extensively on subjects related to criminal law and evidence, with a particular focus on the jury system and the psychological aspect of procedural and evidentiary rules. Her work has appeared in edited collections and in leading law journals including the McGill Law Journal, the Queen’s Law Journal, the UBC Law Review, the Supreme Court Law Review, the Canadian Criminal Law Review and the Criminal Law Quarterly. She was Co-Investigator on a SSHRC-funded psycho-legal research project investigating the effects of Canadian jury pattern jury instructions on the criminal standard of proof beyond a reasonable doubt. She is co-author of Evidence: Principles and Problems, 10th ed. (with Delisle, Stuart & Tanovich, 2012) and Canadian Evidence Law in a Nutshell, 3rd ed. (with Delisle, 2009). She is Associate Editor of the Criminal Reports and a regular contributor to the National Judicial Institute’s Criminal Essentials Eletter, which is distributed monthly to about 1000 Canadian judges. Professor Dufraimont presents regularly at legal and judicial education seminars. While at Queen’s, she received the Law Students’ Society Teaching Excellence Award. Research Interests: Evidence, Criminal Law and Procedure, Law and Psychology",
    "listed_research_areas":"Evidence; Criminal Law and Procedure; Law and Psychology"
  },
  {
    "faculty":"osgoode",
    "name":"Fay Faraday",
    "title":"Associate Professor",
    "email":"ffaraday@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/faraday-fay\/",
    "bio":"Fay Faraday joined the Osgoode faculty as an Assistant Professor in 2018. She graduated as the gold medalist from Osgoode in 1993 and has taught at Osgoode since 2010. She was an inaugural McMurtry Visiting Clinical Fellow in 2012, and a Visiting Professor at the law school until June 2018. She also held York University’s Packer Visiting Chair in Social Justice at the Politics Department from 2014 to 2018. She has been a scholar in residence and faculty affiliate with York University’s Global Labour Research Centre since 2014. Professor Faraday teaches in the areas of social and economic justice, including labour and employment law, labour migration, human rights, appellate advocacy, ethical lawyering, clinical legal education, and social justice and political activism. She has published extensively in the areas of Charter rights, constitutional law, human rights and labour law. She is the co-author and co-editor of a book on equality rights under the Charter: Making Equality Rights Real: Securing Substantive Equality Under the Charter (Irwin Law, 2006), the co-author of a book on equality rights under Ontario’s Human Rights Code: Enforcing Human Rights in Ontario (Canada Law Book, 2009), and co-author and co-editor of a book on labour rights under the Charter: Constitutional Labour Rights in Canada: Farm Workers and the Fraser Case (Irwin Law, 2012). She also holds an Innovation Fellowship with the Metcalf Foundation and is engaged in legal and community-based research on the rights of migrant workers. She has published three landmark reports on migrant worker rights in Canada: Made in Canada: How the Law Constructs Migrant Workers’ Insecurity (2012); Profiting from the Precarious: How Recruitment Practices Exploit Migrant Workers (2014); and Canada’s Choice: Decent Work or Entrenched Exploitation for Canada’s Migrant Workers? (2016). She is also a social justice lawyer, strategic adviser and policy consultant at Faraday Law. She represents unions, community organizations and coalitions in constitutional and appellate litigation, human rights, administrative\/public law, labour and pay equity. She also works collaboratively with community groups and coalitions to provide strategic and policy advice on constitutional and human rights issues, and on law reform. In her work as a lawyer, she has addressed a wide range of issues relating to equality and fundamental freedoms under the Charter, gender and work, rights of migrant workers, rights of persons with disabilities, race discrimination, employment equity, poverty, income security, socioeconomic rights, and international human rights norms. She has represented clients in constitutional litigation at all levels of court, including numerous cases at the Supreme Court of Canada. Since 2017 she has served as the Discrimination and Harassment Counsel for the Law Society of Ontario. Active in community organizing with migrant and marginalized workers for over 25 years, she is currently the co-chair of the Equal Pay Coalition. Research Interests: Labour and employment, Migrant Workers, Equality, Human Rights, Charter of Rights and Freedoms, Constitutional Law, Public Law, Ethical Lawyering, Social Justice and Political Activism, Race, Gender.",
    "listed_research_areas":"Labour and employment; Migrant Workers; Equality; Human Rights; Charter of Rights and Freedoms; Constitutional Law; Public Law; Ethical Lawyering; Social Justice and Political Activism; Race; Gender"
  },
  {
    "faculty":"osgoode",
    "name":"Trevor C. W. Farrow",
    "title":"Dean & Professor",
    "email":"lawdean@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/farrow-trevor-c-w\/",
    "bio":"Trevor Farrow is Dean of Osgoode Hall Law School. Research. Professor Farrow is internationally recognized as a leading scholar on access to justice, legal process and the profession. He is regularly consulted and invited to participate at conferences, expert panels, policy initiatives and justice projects in Canada and around the world, including as a research expert on the OECD’s Advisory Justice Research Consortium. Professor Farrow has been awarded numerous Canadian and international grants to conduct innovative and ground-breaking research, including his $1 million SSHRC “Costs of Justice” grant, which was the first national study of its kind to look at financial and other costs associated with access to justice in Canada. Professor Farrow is consistently ranked in the top 10% of authors on SSRN by all-time and annual downloads and his research is widely cited and relied on by researchers, policy makers, governments, judges and the media in Canada and around the world. Teaching. Professor Farrow’s undergraduate, graduate and professional teaching focuses on the administration of civil justice, including access to justice, legal process, legal and judicial ethics, advocacy and globalization. He has taught and lectured at universities across Canada and around the world. Professor Farrow has received teaching awards from Harvard University and Osgoode Hall Law School. Administration. Professor Farrow has held numerous administrative and leadership appointments at Osgoode Hall Law School, including Associate Dean, Associate Dean (Academic), Associate Dean (Research & Institutional Relations), and Faculty Council Chair. He is the Chair of the Canadian Forum on Civil Justice, the founding Academic Director of the Winkler Institute for Dispute Resolution, and was the Director of the York Centre for Public Policy and Law. He also serves on numerous research and policy panels and committees, including Canada’s Action Committee on Access to Justice in Civil and Family Matters (he was credited as “the holder of the pen” on the Action Committee’s ground-breaking and often nationally and internationally cited Roadmap for Change report). Professor Farrow was formerly a litigation lawyer at the Torys law firm in Toronto. Research Interests. Access to justice; legal process and dispute resolution; professional and judicial ethics; advocacy; legal education; political theory and globalization.",
    "listed_research_areas":null
  },
  {
    "faculty":"osgoode",
    "name":"Benjamin Geva",
    "title":"Professor",
    "email":"bgeva@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/geva-benjamin\/",
    "bio":"Dr. Benjamin Geva is a Professor of Law at Osgoode Hall Law School in Toronto. He specializes in (domestic, comparative and international) commercial, financial and banking law, particularly in payment and credit instruments, fund transfers, electronic transferable transport documents, letters of credit, electronic banking, central banking, money & currency, digital currencies, and assets, and the regulation of the payment system. He obtained his LLB (cum laude) at the Hebrew University of Jerusalem (1970) and his LLM and SJD at Harvard, and was admitted to the Ontario Bar in 1982. He has been on the Osgoode faculty since 1977. He practised with Blake, Cassels and Graydon in Toronto and is now (part-time) counsel with Torys where he is a member of the Payments and Cards Practice Group. He was awarded prestigious competitive grants among others by the Social Sciences and Humanities Research Council of Canada and the Foundation of Legal Research of the Canadian Bar Association and has written extensively in his areas of expertise, including a monograph on Financing Consumer Sales and Product Defences in Canada and the US (Toronto: Carswell, 1984), a treatise on the Law of Electronic Funds Transfer (New York: Matthew Bender, 1992, kept current with annual updates (since 1997 with contributors) until 2020, a comparative law text on Bank Collections and Payment Transactions (Oxford: OUP, 2001), a monograph on The Payment Order of Antiquity and the Middle Ages – A Legal History (Oxford and Oregon: Hart Publishing, 2011), and a text co-written with Dr. Sagi Peari on International Negotiable Instruments (Oxford: OUP, 2020). As well, he is the founding editor in chief of the Banking and Finance Law Review (BFLR) (1986- 2018) and is now Chair of its Advisory Board. He held visiting positions, in the United States at the University of Chicago, the University of Illinois, the University of Utah and Northwestern University as well as in the summer program of Duke University in Hong Kong; in Israel at Tel Aviv University; in Australia in Monash, Deakin, Melbourne and Sydney Universities; in Singapore at the National University of Singapore, in Germany in the University of Hamburg, and in France at the faculté de droit et de science politique d’Aix-Marseille. He has been a Visitor at the law faculties of Oxford and Cambridge Universities in England and at Max-Planck Institute for Comparative and Private International Law in Hamburg (Germany), as well as a Senior Global Research Fellow at the Hauser Global Visitors Program at New York University School of Law, Senior Research Fellow at the University of Vienna (Austria), and Visiting Scholar at the International Trade Law Division of the United Nations Office of Legal Affairs, (the substantive secretariat of the United Nations Commission on International Trade Law (UNCITRAL) in Vienna). Under the IMF technical assistance program he has advised and drafted key financial sector and payment systems legislation for the authorities of several countries, particularly, on missions for Bosnia and Herzegovina, Kosovo, Haiti, Serbia, Cambodia, Afghanistan, Timor-Leste, and Sri Lanka. For UNCITRAL he has been working on electronic transferable transport documents. Both in Canada and the United States and also in the international arena he has been either a member or an observer in legislative committees and drafting working or study groups in the areas of personal property security, securities transfers, letters of credits & independent guarantees, and payment laws. His current research is on digital currencies and assets, payment and settlement laws and systems, electronic transferable transport documents, and a text on General Principles of Canadian Law on Negotiable Instruments and Payment Transactions (to be published by Irwin Law)",
    "listed_research_areas":null
  },
  {
    "faculty":"osgoode",
    "name":"Richard A. Haigh",
    "title":"Assistant Professor",
    "email":"rhaigh@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/haigh-richard\/",
    "bio":"Richard A. Haigh is an Assistant Professor at Osgoode Hall Law School and Director of York’s Centre for Public Policy and Law and Co-Director of the Part-Time LLM program in Constitutional Law at Osgoode Professional Development. He was, until December 2007, the Associate Director, Graduate Program at Osgoode Professional Development. He has been a Senior Lecturer at Deakin University in Melbourne, Australia, a Senior Advisor at the National Judicial Institute in Ottawa, and a Legal Research and Writing Lecturer at Osgoode. His research and teaching interests include Constitutional Law, Public Law, and Equity and Trusts, particularly the areas of freedom of conscience and religion. His recent works include papers on the use of conscience and religion in legislative policies, whistleblowing, dialogue theory and freedom of expression’s relation to noise by-laws; he has also contributed a chapter to a book on legislating statutory interpretation, and a chapter to the casebook on public law (Emond, 3rd ed., 2015).",
    "listed_research_areas":null
  },
  {
    "faculty":"osgoode",
    "name":"Jeffery G. Hewitt",
    "title":"Associate Professor",
    "email":"jhewitt@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/jeffery-g-hewitt\/",
    "bio":"Jeffery G. Hewitt joined Osgoode Hall Law School in 2019 as an Assistant Professor. After graduating from Osgoode with an LLB in 1996, Professor Hewitt returned to complete his LLM in 2015. He focuses a lot on matters starting with “I” – such as Indigenous, Interdisciplinary and Iconic. Professor Hewitt’s research interests include Indigenous legal orders and governance, constitutional law, human rights, legal education, business law, as well as art + law and visual legal studies. He mainly teaches constitutional law and Indigenous-related courses and seminars. Professor Hewitt has also presented his research work nationally and internationally to a range of audiences. He is mixed-descent Cree, was called to the Bar in Ontario in 1998 and works with Rama First Nation as well as various Indigenous Elders, leaders and organizers in the promotion of Indigenous legal orders. He has done a mix of other things as well, serving as past-President of the Indigenous Bar Association of Canada, director of Aboriginal Legal Services of Toronto, and he once wore an iconic NASA space suit. Currently, Professor Hewitt is on the Executive of Legal Leaders for Diversity, and serves as a director of both the Indigenous Bar Association Foundation as well as the National Theatre School of Canada. Somehow, along the way Professor Hewitt has managed to collect a few acknowledgments including a 2019 Law Society of Ontario Medal; a 2019 Excellence in Research Award, University of Windsor; a 2017 Teaching Award from the University of Windsor; the 2015 Charles D. Gonthier Fellowship from the Canadian Institute for the Administration of Justice; a 2014 Teaching Award from Osgoode; a 2013-14 McMurtry Fellow at Osgoode Hall Law School; and a 2011 Canadian General Counsel Award for Social Responsibility.",
    "listed_research_areas":null
  },
  {
    "faculty":"osgoode",
    "name":"Steven Hoffman",
    "title":"Professor \/ Dahdaleh Distinguished Chair \/ Director, Global Strategy Lab",
    "email":"hoffmans@yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/hoffman-steven\/",
    "bio":"Dr. Steven J. Hoffman is the Dahdaleh Distinguished Chair in Global Governance & Legal Epidemiology and a Professor of Global Health, Law, and Political Science at York University, the Director of the Global Strategy Lab, the Director of the WHO Collaborating Centre on Global Governance of Antimicrobial Resistance, and the Scientific Director of the CIHR Institute of Population & Public Health at the Canadian Institutes of Health Research. He holds a courtesy appointment as a Professor of Clinical Epidemiology & Biostatistics (Part-Time) at McMaster University. He is an international lawyer licensed in both Ontario and New York who specializes in global health law, global governance and institutional design. His research leverages various methodological approaches to craft global strategies that better address transnational health threats and social inequalities. Past studies have focused on access to medicines, antimicrobial resistance, health misinformation, pandemics and tobacco control. Steven previously worked as a Project Manager for the World Health Organization in Geneva, Switzerland, and as a Fellow in the Executive Office of United Nations Secretary-General Ban Ki-moon in New York City, where he offered strategic and technical input on a range of global health issues. He also previously worked for a Toronto law firm specializing in cross-border intellectual property litigation, health product regulation, and government relations. Steven advised the World Health Organization on development of a global strategy for health systems research and was lead author on the background paper that provided the strategy’s conceptual underpinnings. For three years he convened an academic advisory committee on science reporting for Canada’s only national weekly current affairs magazine. He was previously an Associate Professor of Law at the University of Ottawa (2014-2017), Adjunct Professor of Global Health & Population at Harvard University (2015-2020) and a Visiting Fellow at the University of Oxford (2018-2019).",
    "listed_research_areas":null
  },
  {
    "faculty":"osgoode",
    "name":"Allan C. Hutchinson",
    "title":"Professor",
    "email":"ahutchinson@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/hutchinson-allan-c\/",
    "bio":"A member of Osgoode’s faculty since 1982, Professor Allan Hutchinson served as Associate Dean from 1994 to 1996 and later, in 2003, he was named Associate Dean (Research, Graduate Studies and External Relations). Professor Hutchinson is a legal theorist with an international reputation for his original and provocative writings. He was elected to the Royal Society of Canada in 2004 and named a Distinguished Research Professor by York University in 2006. His research interests are law and politics; legal theory; the legal profession; constitutional law; torts; jurisprudence; civil procedure; and racism and law. As well as publishing in most of the common-law world’s leading law journals, he has written or edited many books. Much of his work has been devoted to examining the failure of law to live up to its democratic promise. His latest publications are Evolution and the Common Law (Cambridge University Press, 2005) and The Companies We Keep: Corporate Governance for a Democratic Society (Irwin Law, 2006). In 2007, he received the University-wide Teaching Award and was a Visiting Professor at Harvard Law School. Research Interests: Public Law, Legal Profession, Legal Theory",
    "listed_research_areas":"Public Law; Legal Profession; Legal Theory"
  },
  {
    "faculty":"osgoode",
    "name":"Shelley Kierstead",
    "title":"Assistant Professor",
    "email":"skierstead@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/kierstead-shelley\/",
    "bio":"Professor Shelley Kierstead’s research interests lie in the areas of family law, access to justice, and dispute resolution. She has also conducted research in the conflict of laws area, completing a Master of Laws degree focusing on this topic at the University of Toronto 1993. Professor Kierstead first taught Legal Research and Writing (LRW) at Osgoode in 1993, and became Director of the LRW program at Osgoode in 2002. In 2005, she completed a doctoral dissertation in the family law area and obtained a Doctor of Jurisprudence degree from Osgoode Hall Law School. Since 1997, Professor Kierstead has also coordinated a parent education program for separating parents entitled the “Parent Information Program.” This program is an initiative of Osgoode’s Centre for Public Law and Public Policy. Research Interests: Family Law, Legal Process",
    "listed_research_areas":"Family Law; Legal Process"
  },
  {
    "faculty":"osgoode",
    "name":"Sonia Lawrence",
    "title":"Associate Professor",
    "email":"slawrence@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/lawrence-sonia\/",
    "bio":"Professor Sonia Lawrence joined Osgoode’s faculty in 2001. She graduated from the University of Toronto’s joint LLB\/MSW program, went on to serve as law clerk to Chief Justice Beverley McLachlin of the Supreme Court of Canada, and pursued graduate work at Yale Law School. Her work centers on the critical analysis of legal conception of equality. Sonia has served as Assistant Dean of First Year, Director of Osgoode’s Graduate Program, and Director of the Institute for Feminist Legal Studies. She is current the President of the Canadian Association of Law Teachers. Professor Lawrence has taught constitutional and public law, a seminar in gender and equality, criminal law, a graduate methods seminar and a graduate research seminar and a graduate reading group organized around the concept of “social justice”, and in Osgoode’s ADI Program. Research Interests: Public Law, Gender, Race, Critical Race Feminism, Feminism, Equality Law, Charter of Rights and Freedoms",
    "listed_research_areas":"Public Law; Gender; Race; Critical Race Feminism; Feminism; Equality Law; Charter of Rights and Freedoms"
  },
  {
    "faculty":"osgoode",
    "name":"Jinyan Li",
    "title":"Professor",
    "email":"jli@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/li-jinyan\/",
    "bio":"Jinyan Li is Professor of Tax Law and former Interim Dean of Osgoode Hall Law School, York University. She is currently the co-director of the LLM Tax program and academic director, Professional Graduate Studies Program. Professor Li has authored, co-authored and co-edited numerous books, including: Income Tax at 100 Years: Essays and Reflections on the Income War Tax Act (2017); International Taxation in Canada (multiple editions); Principles of Canadian Income Tax Law (multiple editions); International Taxation in the Age of Electronic Commerce: A Comparative Study, and International Taxation in China: A Contextualized Analysis. She is the co-author chapter 13 (Capital Gains) of the Global Tax Treaty Commentaries on IBFD Tax Research Platform. She is the co-editor of Current Tax Readings, Canadian Tax Journal and a member of the editorial board of World Tax Journal. She has organized conferences and symposiums, the most recent of which are a symposium on Pillar Two (2022) and Women with Disabilities: Income Security and Tax Policy (2022). Her work has been cited by Canadian courts, including the Supreme Court of Canada in Deans Knight Income Corp., Alta Energy and MacDonald. She has recently served on the Panel of Experts advising the Minister of Finance, Canada on reviewing tax expenditures and a member of the advisory committee to the Minister of National Revenue on the taxation of e-commerce. She has also been a consultant to the Asian Development Bank, the International Monetary Fund (IMF), the Organisation for Economic Co-operation and Development (OECD), the Auditor General of Canada, and the Department of Justice of Canada. Professor Li has received numerous awards from external organizations, including: Tax Excellence Award (2021) from the Ontario Bar Association), Lifetime Contribution Award (2017) from the Canadian Tax Foundation, Academic Excellence Award (2007) from the Canadian Association of Law Teachers, and D.J. Sherbaniuk Distinguished Writing Award (1999). She was a York University Research Leader (2017) and recipient of teaching awards (2004 and 2014). She is currently on the Council of IFA Canada and a speaker at Canadian and international conferences.",
    "listed_research_areas":null
  },
  {
    "faculty":"osgoode",
    "name":"Heidi Matthews",
    "title":"Assistant Professor",
    "email":"hmatthews@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/matthews-heidi\/",
    "bio":"Professor Heidi Matthews researches and teaches in the areas of international criminal law, the law of war, international legal history and political theory. Her work theorizes contemporary shifts in the practice and discourse of the global legal regulation of political violence, with particular attention to history and gender, as well as political, critical and aesthetic theory. Prior to joining Osgoode, Professor Matthews held a British Academy Newton International Fellowship at the SOAS School of Law, University of London. She served as a law clerk to the judges of the Appeals Chamber at the Special Court for Sierra Leone, and as an intern at the Immediate Office of the Prosecutor at the Special Tribunal for Lebanon. Her doctoral dissertation, “From Aggression to Atrocity: Interrogating the Jus in Bello Turn in International Criminal Law” was awarded Harvard Law School’s Laylin Prize. Professor Matthews has been a Fellow of the Institute for Global Law and Policy and a Clark Byse Fellow at Harvard Law School, as well as a Fellow at the Film Study Center, the Edmund J. Safra Center for Ethics, and the Weatherhead Center for International Affairs at Harvard University. Professor Matthews’ current projects include a critical legal evaluation of American, Canadian and British counterinsurgency policy and practice, a reevaluation of the role of international criminal law during the Cold War, and an intellectual and political history of the concept of military necessity in international law. She is also working on a research and documentary film project that examines narratives of Allied sexual violence perpetrated against German women at the end of World War II. Professor Matthews is active in several international research networks, including the Critical Approaches to International Criminal Law and Cold War International Law projects. Research Interests: International Criminal Law; Law of War\/International Humanitarian Law; Public International Law; International Human Rights Law; Feminist, Legal and Political Theory; Law and the Arts.",
    "listed_research_areas":"International Criminal Law; Law of War\/International Humanitarian Law; Public International Law; International Human Rights Law; Feminist; Legal and Political Theory; Law and the Arts"
  },
  {
    "faculty":"osgoode",
    "name":"Deborah McGregor",
    "title":"Associate Professor & Canada Research Chair in Indigenous Environmental Justice",
    "email":"dmcgregor@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/mcgregor-deborah\/",
    "bio":"Professor Deborah McGregor joined York University’s Osgoode Hall law faculty in 2015 as a cross-appointee with the Faculty of Environmental Studies & Urban Change. Professor McGregor’s research has focused on Indigenous knowledge systems and their various applications in diverse contexts including water and environmental governance, environmental justice, forest policy and management, and sustainable development. Her research has been published in a variety of national and international journals and she has delivered numerous public and academic presentations relating to Indigenous knowledge systems, governance and sustainability. She co-edited Indigenous Peoples and Autonomy: Insights for a Global Age with Mario Blaser, Ravi De Costa and William Coleman (2010). She is co-editor (with Alan Corbiere, Mary Ann Corbiere and Crystal Migwans) of the Anishinaabewin conference proceedings series. Professor McGregor, who is Anishinaabe from Whitefish River First Nation, Birch Island, Ontario, is the Primary Investigator on two current SSHRC-funded projects: Indigenous Environmental (In)Justice: theory and practice. (Insight Grant). Co-applicants: Dayna Nadine Scott (Osgoode Hall Law School), Brenda Murphy (Wilfred Laurier University), Martha Stiegman (Faculty of Environmental Studies & Urban Change). Collaborators: Mary Ann Corbiere (Laurentian University), Kathleen Padulo (Chiefs of Ontario), Sue Chiblow (Garden River First Nation), Nancy DeLeary (Chippewas of the Thames). Indigenizing the First Nations Land Management Regime. (Insight Development Grant). Co-applicants: Heather Dorries (Carleton University) and Gabrielle Slowey (York University). She is a co-applicant in two other current SSHRC projects: Indigenous Knowledge Transfer in Urban Aboriginal Communities with Professor Kim Anderson (Wilfred Laurier University); and Exploring Distinct Indigenous Knowledge Systems to Inform Fisheries Governance and Management on Canada’s Coasts with Professor Lucia Fanning (Dalhousie University). Prior to joining Osgoode, Professor McGregor was an associate professor in the Department of Geography at the University of Toronto and served as Director of the Centre for Aboriginal Initiatives and the Aboriginal Studies program. She has also served as Senior Policy Advisor, Aboriginal Relations at Environment Canada-Ontario Region. In addition to such posts, Professor McGregor remains actively involved in a variety of Indigenous communities, serving as an advisor and continuing to engage in community-based research and initiatives. Professor McGregor coordinated an Indigenous Environmental Justice (IEJ) Symposium in May 2016 featuring the voices of women and youth. She also recently launched an IEJ website. Research Interests: Indigenous environmental justice, Indigenous governance and law, sustainability, water governance and security, and Indigenous knowledge systems.",
    "listed_research_areas":"Indigenous environmental justice; Indigenous governance and law; sustainability; water governance and security; and Indigenous knowledge systems"
  },
  {
    "faculty":"osgoode",
    "name":"Patricia McMahon",
    "title":"Assistant Professor",
    "email":"pmcmahon@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/patricia-mcmahon\/",
    "bio":"Professor Patricia McMahon’s areas of teaching and research are civil procedure, law and equity and legal history broadly defined. She is also the Director and Lead Interviewer of the Oral History Program at the Osgoode Society for Canadian Legal History and the Co-Academic Director of the Winkler Institute for Dispute Resolution. She joined the faculty in July 2022 after a number of years in private practice. Professor McMahon holds a BA in history from Huron University College at Western University and an MA in history from the University of Toronto. She was awarded a SSHRC Doctoral Fellowship for her work on how protest movements influenced Canada’s nuclear policy from 1957 to 1963, the subject of her PhD in Canadian diplomatic and political history from the University of Toronto. This was followed by an LLB (with honours) from the University of Toronto, where she served as co-editor-in-chief of the University of Toronto Faculty of Law Review and received the Dean Cecil A. Wright Key. Following a clerkship with the Honorable Justice Ian Binnie at the Supreme Court of Canada, she attended Yale Law School as a Fulbright Fellow, where she completed an LLM and JSD. Her dissertation dealt with the influence of law reform movements on the procedural fusion of law and equity in Victorian England, which led to the Judicature Acts and modern conceptions of civil procedure. At Yale, she was also a student director in a clinic engaged in civil liberties litigation related to the policies of the U.S. government following the attacks of September 11, 2001. This included cases involving detentions, search and seizure, due process, international human rights and humanitarian law. From 2004 to 2008, she served as a regional representative for the executive committee of Yale Law School. While in private practice, Professor McMahon focused on complex litigation, including class actions, public law and tax litigation. She appeared before all levels of court, including the Supreme Court of Canada. Professor McMahon has published widely in her fields of study, including two books. The Persons Case: The Origins and Legacy of the Fight for Legal Personhood (with Robert J. Sharpe) was published jointly by the University of Toronto Press and Osgoode Society for Canadian Legal History in 2007. The book was the members’ selection for that year, won the Canadian Law and Society Association Book Prize and was short-listed for the John Wesley Dafoe Book Prize. Essence of Indecision: Diefenbaker’s Nuclear Policy 1957-1963 was published by McGill-Queen’s University Press in 2009 and is considered the leading text on the topic. In addition, Professor McMahon has published widely on aspects of legal history, access to information, the fusion of law and equity and equitable procedure. She is currently working on two manuscripts: one related to the history of the fusion of law and equity and another with co-author Robert Bothwell on a multi-million-dollar fraud that involved the Canadian company that supplied uranium to the Manhattan Project during the Second World War. Professor McMahon’s work with the Osgoode Society involves overseeing the oral history collection, which is the largest collection of its kind in the world. She is also the lead interviewer and regularly conducts interviews with lawyers and judges about their contributions to the legal profession. Research Interests: civil procedure; legal process; the impact of COVID-19 on the courts and the legal profession; lawyers in public life; law reform (both modern and historical); the fusion of law and equity; equitable procedure; and legal history broadly defined, including legal biography.",
    "listed_research_areas":"civil procedure; legal process; the impact of COVID-19 on the courts and the legal profession; lawyers in public life; law reform (both modern and historical); the fusion of law and equity; equitable procedure; and legal history broadly defined; including legal biography"
  },
  {
    "faculty":"osgoode",
    "name":"Ikechi Mgbeoji",
    "title":"Professor",
    "email":"imgbeoji@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/mgbeoji-ikechi\/",
    "bio":"Following five years of practice in civil litigation specializing in Commercial Litigation and Intellectual Property Law, Professor Mgbeoji enrolled in the graduate program of Dalhousie University where he graduated, summa cum laude, with an LLM in 1999. A recipient of the Governor-General’s Gold Medal for the highest academic standing at the graduate level in Dalhousie University, he undertook his doctoral research in Patent Law, graduating, summa cum laude, in 2001. Throughout his academic career, Professor Mgbeoji has won numerous academic awards, scholarships and fellowships including the Killam Scholarship and the Carl Duisberg Gesellschaft Award. His teaching and research interests are in Patent Law, Trademarks, Copyrights, Trade Secrets, International Law on the Use of Force, International Environmental Law, Biotechnology and Law, Comparative Intellectual Property Law, Indigenous Peoples, and Anthropology. Professor Mgbeoji is the author of two books – Collective Insecurity: The Liberian Crisis, Unilateralism, & Global Order and Patents and Indigenous Peoples – and he is the co-author of Environmental Law in Developing Countries: Selected Issues. Prior to joining Osgoode in July 2003, he taught at the University of British Columbia Faculty of Law.",
    "listed_research_areas":null
  },
  {
    "faculty":"osgoode",
    "name":"Janet Mosher",
    "title":"Associate Professor",
    "email":"jmosher@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/mosher-janet\/",
    "bio":"Professor Mosher joined the faculty of Osgoode Hall Law School in 2001 after teaching at the Faculties of Law and Social Work at the University of Toronto, where she was also the Director of the Combined LLB\/MSW program. Between 2001 to 2005 and 2011 to 2013 she was the Academic Director of Osgoode’s Intensive Program in Poverty Law at Parkdale Community Legal Services. She is the co-founder of the Feminist Advocacy: Ending Violence Against Women Clinical Program and has served on many occasions as the program’s co-director. Professor Mosher has served as the editor-in-chief of Osgoode’s Journal of Law and Social Policy, as the English language editor of the Canadian Journal of Women and the Law, and on the boards of several community-based social justice organizations. Research Interests: Gender-based violence and legal interventions, access to justice for marginalized populations, welfare policy, poverty law, homelessness, legal aid, and clinical legal education Teaching Areas: Feminist Advocacy: Ending Violence Against Women, Legal Process, Law & Poverty, Legal Ethics. Recent Publications: Domestic Violence and Access to Justice: A Mapping of Relevant Laws, Polices and Justice System Components Across Canada, co-authored ebook (CanLii) “Domestic Violence, Precarious Immigration Status, and the Complex Interplay of Family Law and Immigration Law” (2023) 35:1 Canadian Journal of Family Law 297-358 “Introduction: Domestic Violence and Access to Justice within the Family Law and Intersection Legal Systems,” co-authored, (2023) 35:1 Canadian Journal of Family Law 1-32 “A Comparison of Gender-Based Violence Laws in Canada: A Report for the National Action Plan on Gender-Based Violence Working Group on Responsive Legal and Justice Systems,” commissioned by Women’s Shelters Canada for the Roadmap for the National Action Plan on Violence Against Women and Gender-Based Violence report (appendix F), co-authored, 30 April 2021 “COVID-19, the Shadow Pandemic, and Access to Justice for Survivors of Domestic Violence,” co-authored, (2020) 57:3 Osgoode Hall Law Journal 739-799 “The Costs of Justice in Domestic Violence Cases – Mapping Canadian Law and Policy,” co-authored, in Trevor CW Farrow & Lesley A Jacobs, eds, The Justice Crisis: The Cost and Value of Accessing Law (UBC Press, 2020) 149-172; version with extended footnotes on SSRN at “Introduction” to “Reimagining Child Welfare,” a special volume of the Journal of Law and Social Policy, co-authored (2018) 28 JLSP “Grounding Access to Justice Theory and Practice in the Experiences of Women Abused by Their Intimate Partners,” (2015) 32:2 Windsor Yearbook of Access to Justice 149-176 “Accessing Justice Amid Threats of Contagion,” (2014) 51:3 Osgoode Hall Law Journal 919-56 (refereed), reprinted in Kristy Buccieri and Rebecca Schiff, eds, Pandemic preparedness & homelessness: lessons from H1N1 in Canada (Toronto, ON : Canadian Observatory on Homelessness, 2016) “From Research to Action: Four theories and their implications for knowledge mobilization,” (2014) 5:4 Scholarly and Research Communication 1-17 (lead author with Uzo Anucha, Henry Appiah & Sue Levesque) (refereed)",
    "listed_research_areas":"Gender-based violence and legal interventions; access to justice for marginalized populations; welfare policy; poverty law; homelessness; legal aid; and clinical legal education"
  },
  {
    "faculty":"osgoode",
    "name":"Roxanne Mykitiuk",
    "title":"Professor",
    "email":"rmykitiuk@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/mykitiuk-roxanne\/",
    "bio":"Roxanne Mykitiuk is a Full Professor at Osgoode Hall Law School, where she engages in research and teaching in the areas of Disability Law, Health Law, Bioethics and Family Law. She is the founder and Director of the Disability Law Intensive clinical program and the Director of Osgoode’s part-time LLM program specializing in Health Law. She is a member of the core faculty in the graduate program in Critical Disability Studies at York University. From 2018-2021 Professor Mykitiuk was the Faculty Co-Chair of Enable York and was the Chair of York University’s Senate from 2013-2015. Professor Mykitiuk is nationally and internationally recognized for her work in disability law and the regulation of reproductive and genetic technologies and reproductive health more generally. From 1990-1992 she was Senior Legal Researcher for the Canadian Royal Commission on New Reproductive Technologies. From 2002-2006 she was a member of the Ontario Advisory Committee on Genetics and from 2005-2008, she was a member of the Ethics Committee of the Society of Obstetricians and Gynecologists of Canada. In 2009 Professor Mykitiuk was scholar in residence at the Law Commission of Ontario working on the Disability and Law Project. She is currently on the Board of Directors of ARCH Disability Law Clinic. Professor Mykitiuk has been consulted by a range of actors in policy making and litigation contexts and provided expert opinion related to her areas of expertise. Professor Mykitiuk is an active, engaged and collaborative researcher. She is the author or co-author of numerous articles, book chapters and books investigating the legal, ethical and social implications of reproductive and genetic technologies and the legal construction and regulation of embodiment and disability. Some of her more recent research created and investigated arts-based methods – digital stories and drama-based narratives – as a means of challenging and re-representing experiences, images and conceptions of disability and normalcy. Professor Mykitiuk’s research has been funded by CIHR, SSHRC, the Australian Research Council, Genome Canada and the European Research Council, among other funding bodies. In a currently funded SSHRC project, she is using legal research and digital story making to investigate episodic disability in the workplace and to assist employers to adopt policies that are accommodating to the needs of variously positioned workers with episodic disabilities. With a York Innovation funded grant, Professor Mykitiuk is working with colleagues in nursing and in digital media to devise a cell phone resource to support the communication and accommodation needs of students with disabilities and instructors in clinical placements. And as part of a New Frontiers in Research Fund, supporting research on Zero-Gravity 3D Bioprinting of Super-Soft Materials, she is combining her interests in the regulation of embodiment, health law and new technologies to better understand how to regulate in this new area of research and development. Under an NSERC CREATE grant, she is contributing to a collaborative project on artificial intelligence in aerospace engineering, with her contribution focussing on equity, diversity and inclusion issues presently and potentially engaged in the area. Research Interests: Disability Law, critical disability studies, feminist legal studies, law and embodiment, genetic and reproductive technologies, critical science and technology studies and law, health law, family law, reproductive health law.",
    "listed_research_areas":"Disability Law; critical disability studies; feminist legal studies; law and embodiment; genetic and reproductive technologies; critical science and technology studies and law; health law; family law; reproductive health law"
  },
  {
    "faculty":"osgoode",
    "name":"Jennifer Nadler",
    "title":"Associate Professor",
    "email":"jnadler@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/nadler-jennifer-2\/",
    "bio":"Professor Jennifer Nadler has been appointed a full-time faculty member, effective July 1, 2017. Professor Nadler has been a Visiting Scholar at Osgoode and an instructor of Contract Law and Property Law in Osgoode Professional Development’s Common Law LLM Program since 2013. The recipient of numerous academic honours over the past several years, she received the Osgoode Hall Law School Teaching Award in 2014. She has BA, JD and SJD degrees from the University of Toronto as well as an LLM from New York University. Her doctoral dissertation was a study of the private law implications of the conceptions of freedom portrayed in the novels of Henry James. She publishes in the areas of private law, theoretical jurisprudence, and law and literature.",
    "listed_research_areas":null
  },
  {
    "faculty":"osgoode",
    "name":"Jennifer Nedelsky",
    "title":"Professor",
    "email":"jnedelsky@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/nedelsky-jennifer\/",
    "bio":"Professor Jennifer Nedelsky joined Osgoode in January 2018. She was previously Professor of Law and Political Science at the University of Toronto and Professorial Fellow at the Institute for Social Justice. Her teaching and scholarship have been concentrated on Feminist Theory, Legal Theory, American Constitutional History and Interpretation, and Comparative Constitutionalism. Her most recent book, Law’s Relations: A Relational Theory of Self, Autonomy, and Law (2011) won the C.B. Macpherson Prize, awarded by the Canadian Political Science Association. She is currently completing a jointly authored manuscript (with Tom Malleson), A Care Manifesto: (Part) Time for All (forthcoming, Oxford University Press). Once the book is done, Professor Nedelsky [BA (Rochester); MA and PhD (Chicago)] will return to her book manuscript, Judgment in Law and Life, building on Hannah Arendt’s unfinished theory of judgment. She will also be developing a larger partnership project on restructuring work and care.",
    "listed_research_areas":null
  },
  {
    "faculty":"osgoode",
    "name":"Obiora Chinedu Okafor",
    "title":"Professor & York Research Chair in International and Transnational Legal Studies",
    "email":"ookafor@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/okafor-obiora-chinedu\/",
    "bio":"Professor Obiora Chinedu Okafor is the Inaugural York Research Chair in International and Transnational Legal Studies. He joined Osgoode Hall Law School after holding faculty positions at the University of Nigeria, Enugu Campus, Nigeria, and at Carleton University, Ottawa, Canada. He has served as an SSRC-MacArthur Foundation Visiting Scholar at Harvard Law School’s Human Rights Program; a Canada-US Fulbright Scholar at MIT; a Visiting Professor at the International Institute of Human Rights in Strasbourg, France; a Visiting Professor at the St. Augustine International University, Kampala, Uganda; and as the Gani Fawehinmi Distinguished Chair of Human Rights Law at the Nigerian Institute of Advanced Legal Studies. Professor Okafor has published extensively in the fields of international human rights law and immigration\/refugee law, as well as general public international law (especially with regard to third world approaches to international law). He is the author of Refugee Law after 9\/11: Sanctuary and Security in Canada and the United States (Vancouver: The University of British Columbia Press, 2020); The African Human Rights System, Activist Forces, and International Institutions (Cambridge: Cambridge University Press, 2007); Legitimizing Human Rights NGOs: Lessons from Nigeria (Trenton, New Jersey: Africa World Press, 2006); and Re-Defining Legitimate Statehood (The Hague: Martinus Nijhoff, 2000). He has co-edited three books: Legitimate Governance in Africa: International and Domestic Legal Perspectives (The Hague: Kluwer, 1999); Humanizing Our Global Order: Essays in Honour of Ivan Head (University of Toronto Press, 2003); and The Third World and International Order: Law, Politics and Globalization (Leiden: Martinus Nijhoff, 2003). He has edited four special journal issues, and published over one hundred (100) journal articles, book chapters and other scholarly writings. He is a Co-Editor-in-Chief, and was founding General Editor, of the Transnational Human Rights Review, and sits on the editorial advisory board of a number of scholarly periodicals. He is currently leading a major SSHRC-funded partnership development, research and dissemination project covering six countries relating to Canadian\/African human rights engagements, and another project on the dissemination of the African Human Rights Action Plan. These projects follow on the recent completion under his leadership of two related, collaborative research and dissemination projects on the African Union’s African Human Rights Action Plan\/planning process, and on Canada’s human rights engagements with state and civil society actors in Nigeria. Professor Okafor received the 2010 Award of Excellence from the Canadian Association of Law Teachers, and has been awarded the Gold Medal for Exceptional Research and Major Contributions to Jurisprudence of the Nigerian Institute of Advanced Legal Studies (2013). He has also won Osgoode’s Teaching Excellence Award twice, in 2002 and 2007. His doctoral dissertation at the University of British Columbia received the Governor General’s Gold Medal (the university prize for overall best dissertation). Professor Okafor has served, since August 2017, as the UN Independent Expert on Human Rights and International Solidarity (one of the principal groups of human rights experts who advise and report to the UN Human Rights Council and General Assembly) and a former Chairperson of the United Nations Human Rights Council Advisory Committee (a Geneva-based committee of experts elected by the Human Rights Council to serve as its think tank and principal subsidiary organ). In these two capacities, he has authored over ten UN Reports. He has also served as an expert panelist for the United Nations Security Council’s Counter-Terrorism Committee and United Nations Working Group on People of African Descent. And he has worked as a consultant or adviser for several international organizations, government agencies, parliaments, and law firms. Professor Okafor is the founder and convenor of Osgoode’s Research Seminar Series on International Law in the Global South (ILIGS), and of the Annual York University Oputa Lectures on governance in Africa, which has been held at Osgoode since 2004. Between 2009 and 2011, Professor Okafor chaired the Curriculum Reform Working Group, whose work led to important reforms in Osgoode’s upper-year JD curriculum, including the introduction of the praxicum, and additional upper-year writing requirements. He also founded the international and transnational law intensive program at Osgoode, and engineered Osgoode’s participation in the prestigious International Court of Justice University Traineeship Program. Research Interests: International Law, International Human Rights, Immigration\/Refugee Law, Nigerian Legal Studies Currently on leave.",
    "listed_research_areas":"International Law; International Human Rights; Immigration\/Refugee Law; Nigerian Legal Studies"
  },
  {
    "faculty":"osgoode",
    "name":"Ivan Ozai",
    "title":"Assistant Professor",
    "email":"iozai@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/ozai-ivan\/",
    "bio":"Ivan Ozai researches and teaches national and international tax law and policy, with a particular focus on the intersection of tax law with legal theory and political philosophy. His academic writing has appeared in various law reviews and peer-reviewed journals, such as the Canadian Journal of Law and Jurisprudence, the Columbia Journal of Tax Law, the Fordham International Law Journal, the Dalhousie Law Journal, the World Tax Journal, the Canadian Tax Journal, and the Journal of Tax Studies. He is the author of Expenditures in the Value-Added Tax (2019), published in Portuguese by Editora Lumen Juris, and has participated in several edited volumes, including Tax Justice and Tax Law: Understanding Unfairness in Tax Systems (Hart Publishing, 2020). Professor Ozai has been the recipient of multiple awards for his scholarly work, including the IFA USA Writing Award (2018) by the International Fiscal Association and the Paul-Gérin-Lajoie Rising Star Award (2019) by the Fonds de Recherche du Québec, Société et Culture (FRQSC). His recent work was shortlisted for the Frans Vanistendael Award (2023) by the International Bureau of Fiscal Documentation. Before moving into academia, he practised tax for more than ten years as a litigator, legal adviser, and chartered professional accountant. In Brazil, he was appointed a tax court judge and held several senior government positions, including as the Director-General of the Advance Tax Rulings Directorate of the Department of Finance of the State of Sao Paulo. Professor Ozai was awarded the Osgoode Hall Law School Teaching Award in 2023. He currently sits on the editorial board and serves as a reviewer for several journals and book publishers in law and philosophy. He is also a board member of the YIN Steering Committee (Canada) of the International Fiscal Association. During his doctoral studies at McGill University Faculty of Law, where he was a Richard H. Tomlinson fellow, he was a visiting scholar at the International Bureau of Fiscal Documentation (IBFD) in Amsterdam, the Centre d’études et de recherches internationales de Montréal (CÉRIUM), and the Centre for International Governance Innovation (CIGI) in Waterloo, Ontario. Research Interests: National, International and Comparative Tax Law; Fiscal Policy; Fiscal Federalism; Statutory Interpretation; Deontic Logic; Jurisprudence",
    "listed_research_areas":"National; International and Comparative Tax Law; Fiscal Policy; Fiscal Federalism; Statutory Interpretation; Deontic Logic; Jurisprudence"
  },
  {
    "faculty":"osgoode",
    "name":"Palma Paciocco",
    "title":"Associate Professor",
    "email":"ppaciocco@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/paciocco-palma\/",
    "bio":"Professor Palma Paciocco’s teaching and research interests are in the areas of criminal law and theory, criminal procedure, evidence, sentencing, and professional ethics. She holds an SJD from Harvard Law School, where she studied as a SSHRC Doctoral Fellow. Before beginning her doctoral studies, she completed the Harvard Law School LLM program as a Thomas Shearer Stewart Travelling Fellow and a Landon H. Gammon Fellow (degree waived). She also holds BCL and LLB degrees from the McGill Faculty of Law, where she was awarded the gold medal, and a BA in philosophy and history from the McGill Faculty of Arts. Professor Paciocco served as a law clerk to the Honourable Justice Louise Charron of the Supreme Court of Canada, and she is called to the bars of Ontario and New York. Her scholarship examines a wide variety of criminal justice issues and has been published in leading journals. She is co-author of The Law of Evidence, 8th Ed. (with D.M. Paciocco and L. Steusser, 2020), which is among Canada’s leading texts in evidence law. Her doctoral dissertation examined the ethical obligations of prosecutors engaged in plea bargaining. Professor Paciocco co-directs the Juris Doctor\/Master of Arts in Philosophy Program and is on the Board of Directors of the Canadian Law and Society Association. She is a frequent lecturer at continuing education programs for judges and lawyers. She was awarded the Osgoode Hall Law School Teaching Award in 2018. Research Interests: Criminal Law and Theory, Criminal Procedure, the Law of Evidence, Sentencing, Professional Ethics, Law and the Humanities.",
    "listed_research_areas":"Criminal Law and Theory; Criminal Procedure; the Law of Evidence; Sentencing; Professional Ethics; Law and the Humanities"
  },
  {
    "faculty":"osgoode",
    "name":"Adam Parachin",
    "title":"Associate Professor",
    "email":"aparachin@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/parachin-adam-2\/",
    "bio":"Professor Adam Parachin teaches and researches in the areas of charity, trust, property and personal income tax law. His research specialization in charity law is concerned with the various ways the law defines and celebrates charity – defined as “doing good by others”. His publications in the field are generally concerned with three questions raised this formulation of charity: What constitutes “doing good”? Who qualifies as an “other”? How and why does the law affirm, incentivize and promote the voluntary choice to do good by others? Prior to joining Osgoode Hall, Professor Parachin was an associate professor at the Faculty of Law at Western University, where he began teaching in 2004. While at Western University, he was a three-time recipient of the Professor of the Year Award and eight-time recipient of the Teaching Honour Roll Award of Excellence. Professor Parachin’s research was awarded the Douglas J. Sherbaniuk Distinguished Writing Award by the Canadian Tax Foundation. He is also a past recipient of a SSHRC Insight Grant for a multi-year project dealing with the income tax treatment of charitable gifts. Professor Parachin is active in professional and public education. He is an Adjunct Research Professor at the School of Public Policy and Administration at Carleton University. In addition, he is a board member (and writer) for the Pemsel Case Foundation – a charitable foundation established to study and advance the common law of charity. He is also a member of the Canada Revenue Agency’s Charity Directorate Technical Issues Working Group. Research Interests: Charity law, Estates Law, Trust Law, Property Law, Personal Income Tax Law, Human Rights in Private Law",
    "listed_research_areas":"Charity law; Estates Law; Trust Law; Property Law; Personal Income Tax Law; Human Rights in Private Law"
  },
  {
    "faculty":"osgoode",
    "name":"Jonathon Penney",
    "title":"Associate Professor",
    "email":"jpenney@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/penney-jonathon\/",
    "bio":"Jon is a legal scholar and social scientist who joined the Faculty at Osgoode Hall Law School in July 2020. He is also presently a Visiting Scholar at Harvard’s Institute for Rebooting Social Media; a Faculty Associate at Harvard’s Berkman Klein Center for Internet & Society; and a long time Research Fellow at the Citizen Lab based at the University of Toronto’s Munk School of Global Affairs and Public Policy. A native of Halifax, Nova Scotia, he has studied law at Columbia Law School as a Fulbright Scholar and at Oxford University as a Mackenzie King Scholar. He holds a doctorate in “Information, Communication, and the Social Sciences” from the Oxford Internet Institute at the University of Oxford (Balliol College, 2016). Before joining Osgoode, he taught law at Schulich School of Law at Dalhousie University and spent time as a Senior Research Fellow at the Technology and Social Change (TaSC) Project at the Harvard Kennedy School’s Shorenstein Center on Media, Politics, and Public Policy and as a Research Affiliate of Princeton’s Center for Information Technology Policy. Jon’s research and teaching expertise lies at the intersection of law, technology, and human rights, with strong interdisciplinary and empirical dimensions. From established technologies like the internet and social media to emerging ones like artificial intelligence and machine learning, he aims to understand the legal, ethical, and human rights implications of technology and its role in public and private sector practices such as surveillance, privacy\/data protection, cybersecurity, disinformation\/manipulation, online abuse, and automated legal enforcement. His work has received national and international attention, including coverage in the Washington Post, Reuters International, New York Times, Newsweek, TIME Magazine, NBC News, and The Intercept among others. Recently, his research on privacy and chilling effects was chronicled by Harvard Magazine and won the Reidenberg—Kerr Paper Award at the 2020 Privacy Law Scholars Conference at UC Berkeley Law. Beyond research and teaching, Jon serves on Advisory Boards for the Cyber Civil Rights Initiative (CCRI), a non-profit whose mission is to combat online abuse that threatens civil rights and civil liberties, and the Law Commission of Ontario’s AI and Administrative Decision-Making Project. Additionally, he serves on the Board of Directors for The Canadian Technology Law Association and the Steering Committee for the Free and Open Communications on the Internet (FOCI) workshop, which is co-located at the annual USENIX Security Symposium. Follow him on Twitter here. Research Interests: Technology Law, Privacy\/Surveillance, Cybersecurity, Artificial Intelligence\/Machine Learning, Human Rights, Online Abuse\/Harassment, Disinformation\/Manipulation, Empirical\/Computational Legal Studies, Private Law.",
    "listed_research_areas":"Technology Law; Privacy\/Surveillance; Cybersecurity; Artificial Intelligence\/Machine Learning; Human Rights; Online Abuse\/Harassment; Disinformation\/Manipulation; Empirical\/Computational Legal Studies; Private Law"
  },
  {
    "faculty":"osgoode",
    "name":"Lisa Philipps",
    "title":"Professor",
    "email":"lphilipps@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/philipps-lisa\/",
    "bio":"Professor Lisa Philipps teaches and writes about taxation law and fiscal policy. She is known for incisive expert commentary on budgets, taxes, law, gender and social policy, and higher education policy. On faculty at Osgoode Hall Law School since 1996, Philipps has published widely on topics such as registered savings plans, tax expenditures, income splitting and family taxation, balanced budget laws, judicial approaches to tax law, taxes and disability, and charitable donation tax incentives. In her scholarship and in the classroom, she explores the basic values and policy choices at play in designing a fair and efficient tax system. Professor Philipps has provided commissioned research and advice to a number of bodies. In 2015 she was appointed as Special Counsel to Ontario’s Ministry of Finance. She practised tax law with the firm of Blake, Cassels & Graydon prior to embarking on her academic career, and taught at the Universities of Victoria and British Columbia before joining York University. She has held a number of leadership roles at the Law School and University levels, most recently as Interim Dean of the Bora Laskin Faculty of Law at Lakehead University (fall 2015), and Associate Vice-President Research at York University from 2011-14. She is currently serving a five-year term until June 30, 2022 as York’s Provost and Vice-President Academic. An active volunteer, she serves as Director of Research Policy on the Board of the Federation for the Humanities and Social Sciences, a national non-profit organization. She is also appointed as a member of the Provincial Judges Pension Board. Professor Philipps received her LLB from the University of Toronto and her LLM from York University. She was called to the Bar of Ontario in 1988. Current Funded Research: Principal Investigator, “Legal Frameworks for Work Integrated Learning: The Role of Law in Promoting Expansion of Quality WIL Programs” (Funded by the Higher Education Quality Council of Ontario (HEQCO) Recent Media: “In Praise of Secondments“, University Affairs, March 29, 2017 “Ontario the Indebted”, panellist on TVO’s The Agenda with Steve Paikin”, September 20, 2016. “The principal-residence exemption is a fixable piece of the housing puzzle”, The Globe and Mail, September 16, 2016. “We need Canadian courts to uphold the spirit of our tax laws”, The Globe and Mail, June 3, 2016. Recent Publications: “Registered Savings Plans and the Making of the Canadian Middle Class: Toward a Performative Theory of Tax Policy” (2016) 84:6 Fordham Law Review (forthcoming). Canadian Income Tax Law, 5th ed. (with David G. Duff, Benjamin Alarie, Kim Brooks and Geoffrey Loomer) (Toronto: LexisNexis, 2015). “Real versus Notional Income Splitting: What Canada Should Learn from the US ‘Innocent Spouse’ Problem” (2013) 61:3 Canadian Tax Journal 709. “Bringing Evidence to Tax Expenditure Design: Lesson’s from Canada’s Innovation Policy Review 2006-12” in Evidence-Based Policy-Making in Canada, ed. S.Young (Oxford University Press, 2013). “The Globalization of Tax Expenditure Reporting: Transplanting Transparency in India and the Global South” in Tax Law and Development, ed. Y. Brauner and M. Stewart (Edward Elgar Publishing Ltd., 2013).",
    "listed_research_areas":null
  },
  {
    "faculty":"osgoode",
    "name":"Dan Priel",
    "title":"Professor",
    "email":"dpriel@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/priel-dan\/",
    "bio":"Dan Priel joined Osgoode’s full-time faculty in 2011. Prior to that, he was a Visiting Professor at Osgoode during the 2010-11 academic year and an Assistant Professor at the University of Warwick in the UK. From 2005 to 2007, he was Oscar M. Ruebhausen Fellow-in-Law at Yale Law School, and before that a postgraduate student at the University of Oxford, where he wrote his doctoral dissertation. He served as law clerk in the Israeli Supreme Court, and was co-editor-in-chief of the student-edited law journal at the Hebrew University Law Faculty. His current research interests include legal theory, private law (especially tort law and restitution), and he is also interested in legal history and in the application of the social sciences, in particular psychology, to legal research. His published work appeared in Law and Philosophy, Legal Theory, Oxford Journal of Legal Studies, and Texas Law Review.",
    "listed_research_areas":null
  },
  {
    "faculty":"osgoode",
    "name":"Poonam Puri",
    "title":"Professor and York Research Chair in Corporate Governance, Investor Protection & Financial Markets",
    "email":"ppuri@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/puri-poonam\/",
    "bio":"Professor Poonam Puri is a nationally and internationally recognized scholar of corporate law, corporate governance, investor protection and capital markets regulation. Appointed to Osgoode Hall Law School over twenty-five years ago, she has served as both Associate Dean and Associate Dean, Research, Graduate Studies and Institutional Relations at Osgoode. Professor Puri has also chaired Osgoode’s Faculty Council several times and she is currently serving as Chair of York University’s Senate. She holds the York Research Chair in Corporate Governance, Investor Protection and Financial Markets. Professor Puri is Co-Founder and Director of the Osgoode Investor Protection Clinic, a clinic that provides pro bono legal assistance to individuals who have suffered financial harm. She is also Founder and Director of the Business Law LLM at Osgoode Professional Development. Both are the first of their kind in Canada. A prolific scholar, Professor Puri has co-authored\/co-edited close to 100 books, book chapters, scholarly articles in leading journals, and commissioned research reports. She has presented at over 200 invited keynotes, conferences and public addresses in Canada and around the world. Professor Puri is a recipient of several prestigious fellowships and has received over $5 million in external research and program funding, including five SSHRC grants. Together with her co-investigators, she recently received $775,000 from both York University and the University of Toronto in order to conduct research on digital currencies. Professor Puri’s scholarship is academically rigorous and firmly grounded in the realities of policy-making and law in action. Governments and regulators in Canada and internationally, including the Bank of Canada, Ministry of Finance, Treasury Board Secretariat, Industry Canada, and the International Finance Corporation of the World Bank, have called upon her expertise for financial regulation that serves the public interest. In the community, Professor Puri currently serves on multiple boards, including the Canada Infrastructure Bank and Holland Bloorview Kids Rehabilitation Hospital, the latter as Chair. She has previously served as a Commissioner of the Ontario Securities Commission and on the boards of Women’s College Hospital and the Greater Toronto Airport Authority (Pearson Airport), among others. Her public and private sector board work has provided her with valuable experience and skills in financial management, strategic planning, operational oversight, labour relations and stakeholder engagement. Poonam has been recognized with the Attorney General of Ontario’s David Walter Mundell Medal, the Royal Society of Canada’s Yvan Allaire Medal, the Law Society of Ontario’s Law Society Medal, among other distinctions. She has also previously been named one of Canada’s Top 25 Most Influential Lawyers and one of Canada’s Top 40 under 40 leaders. Awards and Professional Honours (Selected) Osgoode Hall Law School Award for Excellence in Teaching (1999, 2009, 2022) Peter Dey Governance Achievement Award, Governance Professionals of Canada (2022) Yvan Allaire Medal for Outstanding Contributions in Governance, Royal Society of Canada (2021) Law Society Medal, Law Society of Ontario (2021) Walter Mundell Medal for Excellence in Legal Writing, Ontario Ministry of the Attorney General (2020) Top 25 Most Influential Lawyers in Canada, Canadian Lawyer Magazine (2015, 2017) Canada’s 100 Most Powerful Women Award: Trailblazers & Trendsetters (2011) Female Lawyer of the Year, South Asian Bar Association of Toronto (2010) Female Professional of the Year, Indo-Canada Chamber of Commerce (2008) Canada’s Top 40 under 40 Award (2005) Arbor Award, University of Toronto’s highest award for alumni volunteers (2004) Visiting Professorships University of Toronto, Faculty of Law (2022-2023, 2023-2024) National University of Singapore, Faculty of Law (2021) P. Jindal Global University, Jindal Global Law School (2017) University of Western Ontario, Faculty of Law (2007) University of Toronto, Rotman School of Management (2006 – 2007) Cornell Law School (2001 – 2002) Research Fellowships Pierre Elliott Trudeau Foundation Fellowship (2016). Ninth Annual Lloyd Houlden Fellowship (2015). Walter Gordon Fellowship (2010 – 2011). Fulbright Faculty Fellowship (2000 – 2001). Representative Publications Veneris, Andreas, Fan Long, Andreas Park & Poonam Puri, “Central Bank Digital Loonie: Canadian Cash for a New Global Economy” (2021) Osgoode Legal Studies Research Paper Puri, Poonam, “Governance in a Time of Crisis” in Ben-Ishai, ed, Dangerous Opportunities: Examining the Home Capital Crisis (U of T Press, 2021) Anand, Anita, Stephen Choi, Adam C. Pritchard & Poonam Puri, “An Empirical Comparison of Insider Trading Enforcement in Canada and the United States” (2019) 57Intl Rev L & Econ 49 Puri, Poonam, “Securities Class Actions in Canada: 10 Years Later” in Jessica Erickson (Richmond), Sean Griffith (Fordham), David Webber (Boston) and Verity Winship (Illinois), eds, Research Handbook on Representative Shareholder Litigation (Edward Elgar, 2018) Halpern, Paul, Caroline Cakebread, Chris Nichols & Poonam Puri, Back from the Brink: Lessons from the Canadian Asset Backed Commercial Paper Crisis (Toronto: U of T Press, 2016) Puri, Poonam, Anita Anand, Ron Daniels, Edward Iacobucci, Ian Lee, & Jacob Ziegel, Cases and Materials on the Law of Partnerships and Business Organizations in Canada, 6th ed. (Toronto: Carswell, 2016) Teaching Expertise (Selected) Boards of Directors Corporate Governance Corporations Corporate & White Collar Crime Investor Protection Mergers & Acquisitions Securities Regulation X (Twitter): @PPuri_Osgoode Osgoode Investor Protection Clinic",
    "listed_research_areas":null
  },
  {
    "faculty":"osgoode",
    "name":"Sean Rehaag",
    "title":"Associate Professor",
    "email":"srehaag@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/rehaag-sean\/",
    "bio":"Professor Sean Rehaag is the Director of the Centre for Refugee Studies and the Director of the Refugee Law Laboratory. He specializes in immigration and refugee law, administrative law, legal process, access to justice, and new legal technologies. He frequently contributes to public debates about immigration and refugee law, and he engages in law reform efforts in these areas. He is also committed to exploring innovative teaching methodologies, with a particular interest in clinical and experiential education. From 2015 to 2018, he served as the Academic Director at Parkdale Community Legal Services. Professor Rehaag’s interdisciplinary academic research focuses on empirical studies of immigration and refugee law decision-making processes. He currently holds an SSHRC grant involving new legal technologies, artificial intelligence and quantitative research on Canadian refugee adjudication. He is also pursuing research using experiments to better understand how refugee adjudicators make credibility assessments. In 2013, he received the Canadian Association of Law Teachers Scholarly Paper Award for an article entitled “Judicial Review of Refugee Determinations: The Luck of the Draw?”. He publishes yearly statistics on Canada’s refugee determination system. Many of his publications are available open-access on SSRN. Prior to joining the Osgoode faculty in 2008, Professor Rehaag was a visiting scholar at the Université de Montreal’s Chaire de recherche du Canada en droit international des migrations. He has also been a visiting scholar with the Center for Gender and Refugee Studies at UC Hastings, a visiting researcher at the International Gay and Lesbian Human Rights Commission, and an instructor at the University of Victoria and the Université de Sherbrooke. He holds a doctorate from the University of Toronto, bachelor’s degrees in civil law and common law from McGill University, and a bachelor’s degree in political science from the University of British Columbia. Research Interests: Immigration and Refugee Law, Empirical Legal Studies, Judicial\/Administrative Decision-Making, New Legal Technologies, Legal Process, Access to Justice, Gender and Sexuality",
    "listed_research_areas":"Immigration and Refugee Law; Empirical Legal Studies; Judicial\/Administrative Decision-Making; New Legal Technologies; Legal Process; Access to Justice; Gender and Sexuality"
  },
  {
    "faculty":"osgoode",
    "name":"Bruce B. Ryder",
    "title":"Associate Professor",
    "email":"bryder@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/ryder-bruce-b\/",
    "bio":"Professor Ryder joined Osgoode Hall Law School’s faculty in 1987. His research and publications focus on a range of contemporary constitutional issues, including those related to federalism, equality rights, freedom of expression, Aboriginal rights, and Quebec secession. He has also published articles that explore the historical evolution of constitutional principles and is currently researching the history of book censorship in Canada. Research Interests: Public Law",
    "listed_research_areas":"Public Law"
  },
  {
    "faculty":"osgoode",
    "name":"Hengameh Saberi",
    "title":"Associate Professor",
    "email":"hsaberi@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/saberi-hengameh\/",
    "bio":"Professor Hengameh Saberi’s main areas of interest are international law,international legal theory and history, jurisprudence, disability law and human rights, philosophy of pragmatism, and Islamic political and legal thought. She has previously taught at Brown University, University of Tennessee College of Law, Boston University School of Law, and Harvard University. Prior to joining Osgoode Hall Law School in July 2012, she was a post-doctoral fellow jointly at Harvard Law School’s Institute for Global Law and Policy and the Harvard Law School Project on Disability.",
    "listed_research_areas":null
  },
  {
    "faculty":"osgoode",
    "name":"Craig M. Scott",
    "title":"Professor & Associate Dean (Academic)",
    "email":"cscott@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/scott-craig-m\/",
    "bio":"As of July 2021, Professor Craig Scott is serving as the Associate Dean (Academic) of Osgoode. Professor Scott’s teaching and research have been primarily in the fields of public international law and private international law, with a focus on the place of international human rights law in both of these fields. His most recent work draws on all three of these fields, including in the areas of human rights torts across borders, transnational corporate accountability and transitional justice. He has also written on constitutional rights protection in Canada and abroad. Much of his work has been on the theory and doctrine of economic, social and cultural rights. His work and teaching is strongly influenced by his interests in legal theory and in policy responses to globalization. He is series editor of Hart Monographs in Transnational and International Law, and is Founding Editor of Transnational Legal Theory. Professor Scott has sought to create productive linkages between his academic work and various external commitments, particularly engagement with civil society. On the Canadian scene, he was one of the drafters of the Alternative Social Charter put forward during the Charlottetown constitutional round. He has been closely involved in advising equality-seeking, notably anti-poverty, groups on Canadian Charter of Rights litigation and on preparing interventions before various UN human rights bodies on Canada’s record of treaty compliance. He has been involved in appeals or interventions in the Supreme Court of Canada in major cases which have dealt with the interface of international law and Canadian law (Pushpanathan, Reference re Secession of Quebec, Baker). He advised in the formulation of the statement of claim in the civil lawsuit of Maher Arar against the Government of Canada and provided an expert report on Arar’s travel security during the settlement process. Professor Scott was closely involved in the development of key aspects of the current South African constitution, beginning with his role advising the African National Congress on these matters while the ANC was still in exile. In 1993-1994, he served as co-counsel for the government of Bosnia in a case before the International Court of Justice, with responsibility for developing arguments on the limits of the powers of the UN Security Council. He has given academic opinions on international law to various governments and international organizations on issues related to such matters as the law of the sea, territorial claims and adjudicative procedures; he has also given opinions to non-governmental organizations and aboriginal government representatives on matters ranging from the legality of economic sanctions on Iraq to inland fisheries jurisdiction to transfer of environmental technology to counter global climate change. More recently, he was heavily involved with the London-based Sri Lanka Campaign for Peace and Justice and with the civil-society truth commission in Honduras known as the Comisión de Verdad, on which he served as a Commissioner. Professor Scott was a member of the Faculty of Law, University of Toronto, from 1989 to 2001. He joined Osgoode Hall Law School in 2000 following a term as a Jean Monnet Fellow at the European University Institute in Florence. From 2001 to 2004, he was Osgoode’s inaugural Associate Dean (Research and Graduate Studies). During the 2010-2011 academic year, he was an Ikerbasque Fellow with the Basque Government’s Foundation for Science, based in Bilbao at the Universidad de Deusto. He was Director of the Jack and Mae Nathanson Centre on Transnational Human Rights, Crime and Security from 2006 until the end of 2011. He served in 2020-21 as the Graduate Program Director for Osgoode’s PhD and research-stream LLM programs. Prior to starting his academic career, Professor Scott served as law clerk to the former Chief Justice of the Supreme Court of Canada, Brian Dickson. He attended the Universities of Oxford and London on a Rhodes Scholarship. From March 2012 to October 2015, he served as Member of Parliament for Toronto-Danforth in Canada’s House of Commons, and was the New Democratic Party’s Official Opposition Critic for Democratic and Parliamentary Reform. Proud to be banned for life from Russia, as of August 31, 2022. Research Interests: Transnational Law, Legal Theory, Law and Social Justice, Democratic Theory and Institutions, Law and the Arts, Constitutional Law",
    "listed_research_areas":"Transnational Law; Legal Theory; Law and Social Justice; Democratic Theory and Institutions; Law and the Arts; Constitutional Law"
  },
  {
    "faculty":"osgoode",
    "name":"Dayna N. Scott",
    "title":"Associate Professor & York Research Chair in Environmental Law & Justice in the Green Economy",
    "email":"dscott@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/scott-dayna-n\/",
    "bio":"Professor Dayna Nadine Scott was appointed as York Research Chair in Environmental Law & Justice in the Green Economy in 2018. She is cross-appointed with York’s Faculty of Environmental Studies & Urban Change. Professor Scott is a Co-Director of Osgoode’s Environmental Justice and Sustainability Clinic and a Co-Coordinator of the joint MES\/JD program. Professor Scott joined Osgoode’s faculty in 2006 after completing a SSHRC Post-Doctoral Fellowship at McGill’s Faculty of Law and a Hauser Global Research Fellowship at NYU. Professor Scott’s research interests focus on contestation over extraction; exercises of Indigenous jurisdiction over lands and resources; the distribution of pollution burdens affecting marginalized communities and vulnerable populations; gender and environmental health; and the justice dimensions of the transition to a greener economy. Professor Scott is currently the co-Principal Investigator, with Professor Heidi Kiiwetinepinesiik Stark of the University of Victoria’s Center for Indigenous Research and Community-led Engagement (CIRCLE), of a project funded by the SSHRC New Frontiers in Research Fund called “Jurisdiction Back: Infrastructure Beyond Extractivism”. In a partnership between the Yellowhead Institute, the University of Toronto’s Department of Geography and Planning and York University, this project includes 14 academics and land defenders from across the country pursuing research oriented towards how the “just transition” to sustainable economies can be imagined and infrastructured to restore Indigenous jurisdiction, laws and governance systems. Professor Scott has been the Primary Investigator on several SSHRC-funded projects, including “Consent & Contract: Authorizing Extraction in Ontario’s Ring of Fire” with colleagues Andrée Boisselle, Deborah McGregor and Estair Van Wagner, and the Partnership Development Grant, “Reconciling Sovereignties: New Techniques for ‘Authorizing’ Extraction on Indigenous Territories” led by Professor Shiri Pasternak, in partnership with the Indigenous Network on Economies and Trade (INET) and MiningWatch Canada. She also completed research in partnership with environmental justice activists from the Aamjiwnaang First Nation, near Sarnia`s Chemical Valley, that applied a critical, feminist perspective to the examination of law’s treatment of the risks of long-term, low-dose exposures to pollutants, and another SSHRC-funded project (“Investigating Regulatory Chill”) that examined constraints on regulation to protect the environment, with a focus on investor rights in the resource extraction context. Professor Scott and collaborators recently completed a major report for the Impact Assessment Agency of Canada entitled, “Implementing a Regional, Indigenous-Led, and Sustainability-Informed Impact Assessment in Ontario’s Ring of Fire.” This project was undertaken in partnership with Chief and Council of Neskantaga First Nation, a remote Anishinaabe community in Ontario’s far north.. Recent publications explore impact-benefit agreements in “Extraction Contracting: The Struggle for Control of Indigenous Lands” (2020) in a special issue of South Atlantic Quarterly, co-edited with Shiri Pasternak; “Extractivism” in Mariana Valverde, Kamari Clarke, Eve Darian-Smith and Prabha Kotiswaran, eds, The Routledge Handbook of Law and Society (Abingdon: Routledge, 2021); the resurgence of Indigenous law in Treaty 9, with Andrée Boisselle (2019 UNB Law Review); the dynamics of “sacrifice zones” in the context of the emerging green energy economy (McGill Law Journal 2017, with Adrian A. Smith); anti-toxics politics (“Wanna-be Toxic Free? From Precautionary Consumption to Corporeal Citizenship” in Environmental Politics 2016); and the tactics of activists resisting tar sands extraction in Peace River Alberta (“‘We are the Monitors Now’: Experiential Knowledge, Transcorporeality and Environmental Justice” (2015) in Social & Legal Studies). Professor Scott is the co-editor with Professor Deborah Curran, of a new journal of Canadian Environmental Law scholarship, the editor of Our Chemical Selves: Gender, Toxics and Environmental Health (UBC Press, 2015) and the past Director of the National Network on Environments and Women`s Health. Among other awards, Professor Scott has been a recipient of a York-Massey Fellowship, a Fulbright Fellowship, and the Law Commission of Canada’s “Audacity of Imagination” Prize.",
    "listed_research_areas":null
  },
  {
    "faculty":"osgoode",
    "name":"Sara Slinn",
    "title":"Associate Professor",
    "email":"sslinn@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/slinn-sara\/",
    "bio":"Sara Slinn joined the Osgoode faculty in 2007, after five years at Queen’s Faculty of Law. Professor Slinn’s research interests are in the areas of labour and employment law, focusing on different approaches and impediments to collective employee representation, and the intersection of Charter rights and labour law. Reflecting her interdisciplinary graduate work, including a PhD in Industrial Relations from the University of Toronto, Professor Slinn’s research is interdisciplinary and uses empirical methods of analysis. She has also practised labour and employment law with both the British Columbia Labour Relations Board and a private law firm in Vancouver.Research Interests: Labour Law, Employment Law, Industrial Relations, Constitutional Law, Contracts",
    "listed_research_areas":"Labour Law; Employment Law; Industrial Relations; Constitutional Law; Contracts"
  },
  {
    "faculty":"osgoode",
    "name":"Adrian A. Smith",
    "title":"Associate Professor",
    "email":"adriansmith@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/smith-adrian\/",
    "bio":"Professor Adrian Smith joined the Osgoode Hall Law School faculty in July 2018 as Associate Professor and will serve a term as Academic Director of Parkdale Community Legal Services (PCLS), teaching the intensive seminar in poverty law. He arrives from Carleton University’s Department of Law and Legal Studies where he enjoyed cross-appointment to the Institute of Political Economy and the Institute of African Studies. Prior to his appointment in 2011, he completed a Bachelor of Arts (BA, Honours) in Political Science and History at Western, a Bachelor of Laws (LLB) and Master of Laws (LLM) at Osgoode, and doctoral studies at McGill Faculty of Law, for which he received a SSHRC ‘CGS’ Doctoral Scholarship. His areas of interest broadly relate to law, political economy and development. He researches the regulation of labour in colonial and settler colonial contexts, including temporary labour migration in Canada. He also has interests in popular legal education in social movements, anti-imperialism, anti-racism, and visual legal studies — among other areas. His research projects have taken him to northern Africa, western Europe, South America, the Caribbean, Australia, Mexico and throughout the U.S. and Canada. He has been privileged to work with youth environmental justice activists from Aamjiwnaang First Nation, near Sarnia’s Chemical Valley, and has undertaken research in relation to renewable energy in the territory of Batchewana First Nation, near Sault Ste. Marie. He is a researcher in the SSHRC Partnership Development Grant, “Reconciling Sovereignties: New Techniques for ‘Authorizing’ Extraction on Indigenous Territories” in partnership with the Indigenous Network on Economies and Trade (INET) and Mining Watch Canada (led by Professor Shiri Pasternak). Professor Smith’s work can be found in a range of journals and edited collections. He is co-editor of Unfree Labour? Struggles of Migrant and Immigrant Workers in Canada (PM Press, with Professor Aziz Choudry). While at Carleton, Professor Smith taught Regulating Work in the Global Economy, Settler Colonialism and Belonging In Canada (Research Methods), Historical Perspectives on Law and Society, Law and Development, and Labour Law. For two years he also co-taught the core doctoral seminar in political economy. Following his term at PCLS, he will teach labour law. Professor Smith is a youth basketball coach, with Toronto Triple Threat Basketball Club and Ontario Basketball’s Summer Development and Centre for Performance (CP) Programs. Research Interests: regulation of labour, law and development, critical political economy approaches to law, temporary labour migration, racism, settler colonialism, social movements and law.",
    "listed_research_areas":"regulation of labour; law and development; critical political economy approaches to law; temporary labour migration; racism; settler colonialism; social movements and law"
  },
  {
    "faculty":"osgoode",
    "name":"Kate Sutherland",
    "title":"Associate Professor",
    "email":"ksutherland@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/sutherland-kate\/",
    "bio":"Professor Kate Sutherland joined Osgoode’s faculty in 1998, and has taught law at the University of Saskatchewan. She was Osgoode’s Assistant Dean, First Year from July 1, 2012 to July 1, 2015. She has served as law clerk to Chief Justice Antonio Lamer of the Supreme Court of Canada, as well as Chief Justice E. D. Bayda of the Court of Appeal for Saskatchewan. Professor Sutherland is former Acting Director of the Centre for Constitutional Studies at the University of Alberta. She was the recipient of a Fulbright Fellowship in 1995 and the Law Society of Saskatchewan Gold Medal in 1989. Professor Sutherland has written and presented in areas such as charter equality rights, sexual harassment, childhood sexual abuse, and tort law. She has served as editor or co-editor of several publications, including Review of Constitutional Studies, Constitutional Forum, Points of View, and Saskatchewan Law Review . Professor Sutherland has also written several literary pieces, including “The Necklace” in The New Quarterly , Winter (1997), Summer Reading: A Collection of Short Fiction (Saskatoon: Thistledown Press, 1995), and “Lucia” in Prairie Fire (1992). Professor Sutherland’s community involvement has included her work for the Boston AIDS Care Project, University of Saskatchewan Women’s Centre, Her Story Calendar Collective, Saskatchewan Action Committee on the Status of Women, and the Saskatchewan Writers Guild. Research Interests: Legal Theory, Feminist Legal Studies",
    "listed_research_areas":"Legal Theory; Feminist Legal Studies"
  },
  {
    "faculty":"osgoode",
    "name":"François Tanguay-Renaud",
    "title":"Associate Professor",
    "email":"ftanguay-renaud@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/tanguay-renaud-francois\/",
    "bio":"Professor François Tanguay-Renaud has been a professor at Osgoode since 2008. He is currently the Program Director of the Osgoode Certificate in the Laws of Emergency, and of the Professional LLM in Canadian Common Law. From 2012 until 2021, he was Director of York’s Jack & Mae Nathanson Centre on Transnational Human Rights, Crime and Security (a position he shared with Professor Heidi Matthews from 2018 to 2021). He is also one of the founders and first Director of York’s Juris Doctor\/Master of Arts (JD\/MA) combined program in law and philosophy, and a former Associate Dean Research, Graduate Studies, and Institutional Relations. Professor Tanguay-Renaud holds degrees in both civil and common law from McGill University, where he was both a Loran Scholar and a Greville-Smith Scholar. He also studied at the National University of Singapore, and completed his graduate work (BCL, MPhil, DPhil) at the University of Oxford, where he was in turn a Rhodes Scholar, holder of the Studentship of the Centre for Ethics and Philosophy of Law, as well as doctoral fellow of the Fonds québécois de la recherche sur la société et la culture (FQRSC) and of the Social Sciences and Humanities Research Council of Canada (SSHRC). Prior to joining Osgoode, Professor Tanguay-Renaud was a Lecturer in Law at Corpus Christi College, University of Oxford. He also served as a law clerk to Justice Marie Deschamps of the Supreme Court of Canada, and worked with the Asian Forum for Human Rights and Development and the Asian Network for Free Elections in Thailand, as well as with the Human Rights Commission of Pakistan. Since starting at Osgoode, he has held Visiting Professor appointments at the University of Minnesota Law School (Robina Institute for Criminal Law and Criminal Justice), the University of Oxford (H.L.A. Hart Fellow), the National University of Singapore, the University of Toronto Centre for Ethics and Faculty of Law, Massey College, and the National Law School of India University (NLSIU). He currently also holds an appointment as Adjunct Associate Professor in the Department of Philosophy of McMaster University. His current academic interests span a wide range of subject areas — but notably, criminal law, criminal procedure, constitutional and public law, emergency law, AI and the law, and public international law — viewed mostly through the lens of analytical legal theory. He is editor of Rethinking Criminal Law Theory: New Canadian Perspectives in the Philosophy of Domestic, Transnational, and International Criminal Law (with James Stribopoulos, Hart Publishing, 2012), From Morality to Law and Back Again: Liber Amicorum for John Gardner (with Michelle Madden Dempsey, Oxford University Press, 2023), and has published articles in leading journals such as Ethics, Legal Theory, Res Publica, Law and Philosophy, Criminal Law and Philosophy, the UBC Law Review, the Asian Yearbook of International Law, as well as in many leading edited collections. He currently holds an Insight Grant from the Social Sciences and Humanities Research Council for a research project on “Reconceiving Procedural Fairness” in light of the advent of Artificial Intelligence (with Vincent Chiao). Professor Tanguay-Renaud regularly teaches courses on criminal law, criminal procedure, emergency law, the philosophical foundations of criminal law, jurisprudence, and the rule of law. He was the recipient of the Osgoode Hall Law School Teaching Award in 2017, and of the Osgoode Hall Law School Faculty Service Award in 2020. Research Interests: Theory of criminal law, criminal procedure, constitutional and public law, international law, and associated areas of political and moral philosophy; the regulation of state surveillance; artificial intelligence and the law (with a focus on criminal law); emergencies and the law; jurisprudence; the rule of law; collective, corporate, and state responsibility; war ethics; Canadian, American and South Asian constitutional law and politics.",
    "listed_research_areas":"Theory of criminal law; criminal procedure; constitutional and public law; international law; and associated areas of political and moral philosophy; the regulation of state surveillance; artificial intelligence and the law (with a focus on criminal law); emergencies and the law; jurisprudence; the rule of law; collective; corporate; and state responsibility; war ethics; Canadian; American and South Asian constitutional law and politics"
  },
  {
    "faculty":"osgoode",
    "name":"Gus Van Harten",
    "title":"Professor",
    "email":"gvanharten@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/van-harten-gus\/",
    "bio":"Gus Van Harten joined the faculty in January 2008 and teaches Administrative Law, Constitutional Law, International Investment Law, and Governance of the International Financial System. Previously he was a faculty member in the Law Department of the London School of Economics. He has received the William Robson Memorial Prize from LSE, a Scholar in Residence fellowship from the Law Commission of Ontario, a doctoral fellowship from the Social Sciences and Humanities Research Council of Canada, an Overseas Research Award from Universities UK, and a Research Award from the Canadian International Development Agency. Van Harten’s most recent book is The Trouble with Foreign Investor Protection (OUP, 2020). His previous books include Investment Treaty Arbitration and Public Law (OUP, 2007); Sovereign Choices and Sovereign Constraints (OUP, 2013); and Sold Down the Yangtze: Canada’s Lopsided Investment Deal with China (Lorimer, 2015). He also co-edits a leading Canadian text: Administrative Law — Cases and Materials (Emond Montgomery, 2010, 2015, and 2021). His academic articles have been published in the Canadian Yearbook of International Law, European Journal of International Law, International and Comparative Law Quarterly, International Journal of Evidence and Proof, Journal of International Dispute Settlement, Osgoode Hall Law Journal, Queen’s Law Journal, Review of International Political Economy, Supreme Court Law Review, University of Toronto Law Journal, Yearbook of International Investment Law and Policy, and other journals. Most of his academic articles are freely available here. Van Harten participates in policy debates with a view to providing accessible information on issues of public importance, especially on trade agreements and investor-state dispute settlement (ISDS). He has made submissions to parliamentary committees in Canada, Denmark, the Netherlands, and Germany and has advised various governments and non-governmental organizations. He has also appeared in media in Canada, such as L’actualité, CBC, CTV, Canadian Press, The Globe and Mail, Radio Canada International, The Toronto Star, and TV Ontario; and in international media such as American Lawyer, ARD (Germany), Ariran Korea TV, Austrian Public TV, Bloomberg, CCTV News (China), Channel 2 (Netherlands), Der Spiegel, L’Echo, The Guardian, Japan Broadcasting Corporation, National Public Radio (USA), Reuters, and Telesur. Before becoming an academic, Van Harten worked for two judicial inquiries in Canada – the Arar Inquiry of 2004-06 and the Walkerton Inquiry of 2000-02 – and as a law clerk at the Ontario Court of Appeal. He is also proud of his past work as a teaching assistant, lifeguard and swimming instructor, dishwasher, temporary labourer, and grocery clerk. Research Interests: Administrative Law; International Investment Law and Arbitration; International Monetary Law and Policy; Inquiries and Investigations Research website on International Investment Arbitration and Public Policy Blog",
    "listed_research_areas":"Administrative Law; International Investment Law and Arbitration; International Monetary Law and Policy; Inquiries and Investigations"
  },
  {
    "faculty":"osgoode",
    "name":"Estair Van Wagner",
    "title":"Associate Professor",
    "email":"evanwagner@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/van-wagner-estair\/",
    "bio":"Professor Estair Van Wagner researches and teaches in the areas of natural resource law and property law and is co-director of Osgoode’s Environmental Justice and Sustainability Clinic. Her work explores how law is used to structure relations with the environment. Professor Van Wagner joined Osgoode in 2017 from the Victoria University of Wellington Faculty of Law in Aotearoa New Zealand where she taught Property, Natural Resource, and Resource Management Law. She is involved in a number of SSHRC funded research grants, including as the PI of a large-collaborative SSHRC grant examining the relationship between Aboriginal title, Indigenous property and land use systems, and private property on Vancouver Island with Dr Sarah Morales and Dr Mike Ekers. She is a member of the Domestic Law Stream of the Conservation through Reconciliation Partnership, a Canada-wide network working to support Indigenous-led conservation. Professor Van Wagner is working with Professor Dayna Scott on a national project examining Indigenous-led impact assessment to inform the development of federal assessment practice. She also continues to do research on Maori law and mining Aotearoa New Zealand in an ongoing collaboration with Dr Maria Bargh. Professor Van Wagner is also the PI on a grant with the Shift, a global movement for the right to housing, examining the human rights dimensions of homeless encampments in Canadian cities with Dr Kaitlin Schwan, Dr Alexandra Flynn, Dr Priya Gupta, and Dr Deborah Curran. Professor Van Wagner is also co-leading the Feminist Judgments Project – Canada in which feminist legal scholars are reimagining judicial decisions and legislative frameworks to articulate alternative legal relations and futures. Professor Van Wagner completed undergraduate and postgraduate studies in political science, law, and environmental studies at the University of Victoria, Osgoode Hall Law School, and York University in Canada. Following this, she served as a judicial law clerk at the Ontario Superior Court of Justice. She worked as a labour and human rights lawyer, as an academic researcher on a number of interdisciplinary projects, and as a political advisor at the local and federal level in Canada.",
    "listed_research_areas":null
  },
  {
    "faculty":"osgoode",
    "name":"David Vaver",
    "title":"Professor of Intellectual Property Law",
    "email":"dvaver@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/vaver-david\/",
    "bio":"David Vaver is a member of IP Osgoode and Emeritus Professor of Intellectual Property & Information Technology Law in the University of Oxford, Emeritus Fellow of St Peter’s College, Oxford, and former Director of the Oxford Intellectual Property Research Centre. He was previously a faculty member at Osgoode (1985-98), UBC (1978-85), and the University of Auckland (1972-78). He rejoined Osgoode in 2009. Professor Vaver’s main field is intellectual property law and policy. Besides authoring Intellectual Property Law: Copyright, Patents, Trade-marks (2nd ed. 2011), Copyright Law (2000), and (as co-editor) Competition Policy and Intellectual Property Law (2009), all published by Irwin Law, he has edited a five-volume compilation, Intellectual Property Rights: Critical Concepts in Law (Routledge, 2006). He founded the Intellectual Property Journal in 1984, from which he retired as editor-in-chief in 2016 but remains on the advisory board. Professor Vaver is an associate member of the Chambers of Iain Purvis QC (11 South Square, Gray’s Inn), a former board member of the Intellectual Property Institute (London), and a former member of the UK government’s IP Advisory Committee. He is a Fellow of the Royal Society of Canada and was appointed in 2016 to the Order of Canada for his “leadership in intellectual property law as a scholar and mentor.”",
    "listed_research_areas":null
  },
  {
    "faculty":"osgoode",
    "name":"Robert S. Wai",
    "title":"Associate Professor",
    "email":"rwai@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/wai-robert-s\/",
    "bio":"Robert Wai has been a member of the faculty at Osgoode Hall Law School since 1998, where he researches and teaches in various areas of international economic law including International Trade Regulation and International Business Transactions. His teaching has also included Contracts, Ethical Lawyering in a Global Community, and Law and Economic Relations. He has served in a number of governance roles including as Associate Dean, as a member of the Osgoode Hall Faculty Association executive and the Board of Trustees of the York University Pension Plan, and as chair of Faculty Council and a number of its standing committees. Professor Wai has been a Jean Monnet Fellow and Fernand Braudel Senior Fellow at the European University Institute in Florence, Senior Visiting Fellow at the London School of Economics, and a visiting professor at other international institutions including the University of Hong Kong, Sciences Po Law School in Paris, and Brown University. Since 2010 Professor Wai has served on the Academic Council of the Harvard Law School Institute for Global Law and Policy (IGLP) and as a regular core faculty at its workshops. Professor Wai graduated with a BCom in economics from McGill University (Beatty Gold Medalist), and an MPhil degree in international relations at Oxford University as a Rhodes Scholar. After completing an LLB from the University of British Columbia, he clerked at the Supreme Court of Canada for Justice Gérard La Forest, and worked at law firms in Vancouver and New York. He completed his doctorate at Harvard Law School, where his dissertation critically examined structures of policy argumentation in private international law. Professor Wai’s research explores how the contemporary global economy is constituted and regulated by plural regimes of transnational law including public and private law, domestic and international law, substantive and procedural law, and state and non-state norms. In 2019, he was the Donald Mawhinney Lecturer in Professional Ethics at UBC, and in the summer of 2021 he will deliver a course on Liberalism and Private International Law at the Hague Academy of International Law.",
    "listed_research_areas":null
  },
  {
    "faculty":"osgoode",
    "name":"Janet Walker",
    "title":"Professor",
    "email":"jwalker@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/walker-janet\/",
    "bio":"Janet Walker is a full professor and past Associate Dean. She currently teaches private international law, international commercial arbitration and complex litigation in the JD and the professional LLM programs and is Director of the Professional LLM in Civil Litigation and Dispute Resolution. She has also taught Civil Procedure, Professional Responsibility and International Business Transactions and has served as Convener of the Litigation, Dispute Resolution and the Administration of Justice Stream, and Director of the Mooting Program. Professor Walker is the author of Castel and Walker: Canadian Conflict of Laws, and the Halsbury’s Laws of Canada volume on the Conflict of Laws; she is the General Editor of The Civil Litigation Process, and of Class Actions in Canada, and co-editor of Common Law, Civil Law and the Future of Categories. She is also a co-author of Irwin Essentials: Civil Procedure, Private International Law in Common Law Canada, and A Practical Guide to Mooting. Professor Walker has lectured in Wuhan and Xi’an, and she has taught Conflict of Laws as a visitor at Monash, University of Haifa and University of Toronto, as a Hauser Global Visiting Professor at NYU in New York and in its joint program with NUS in Singapore, and at Monash University’s Prato Campus. She taught comparative procedure as Leverhulme Visiting Professor at Oxford, and advocacy at University of Zagreb’s Zadar Program, and for the past thirteen years, she has taught private international law as a Foreign Research Professor at Tunis II, where she has also led the International Lawyers for Africa Tunisian National Committee. Professor Walker has led the Osgoode summer program at Hebrew University of Jerusalem on five occasions, and served as faculty advisor to the Osgoode Vis International Commercial Arbitration Moot for the past thirteen years and the Tunis team for four years. Professor Walker has lectured at The Hague Academy of International Law Summer Program and co-chaired the 72nd Biennial Conference of the International Law Association and the International Association of Procedural Law’s Toronto Conference; and she led the Project on Teaching Procedure, which produced the OHLJ Special Issue on Teaching Procedure. Professor Walker has served as an International Advisor to the American Law Institute in its project with Unidroit to develop Principles and Rules of Transnational Civil Procedure; and as a member of the Uniform Law Conference of Canada Committee on National Class Actions, of the IBA Task Force on Guidelines on Recognition and Enforcement of Collective Redress Judgments, of the ILA Committee on International Civil Litigation, the ABA Canada\/US Class Working Group on Protocols for Parallel Class Actions and the Uniform Law Conference of Canada’s Project on Uniform International Arbitration Legislation. She has served as President of the Canadian Branch of the International Law Association, Chair of the Toronto Chapter of the Chartered Institute of Arbitrators, and she is Secretary General of the International Association of Procedural Law. Professor Walker was the Law Commission of Ontario’s first Scholar in Residence, she has been the Common Law Advisor to the Federal Courts Rules Committee since 2006, and she is currently serving as Academic Advisor to the Chartered Institute of Arbitrators. Professor Walker is a member of the American Law Institute and a Senior Fellow of Massey College. She is a member of the University Club of Toronto, the Athenaeum Club in London. Professor Walker has served as an ICC and ICDR arbitrator in various matters and she consults and serves as expert in matters of international litigation and arbitration and complex litigation. She is a member of the panel of foreign arbitrators of the ICDR, CIETAC, SHIAC, KLRCA and a member arbitrator of Arbitration Place, Toronto, and Outer Temple Chambers, London. Research Interests: International Litigation and Arbitration, Comparative Procedure, Advocacy.",
    "listed_research_areas":"International Litigation and Arbitration; Comparative Procedure; Advocacy"
  },
  {
    "faculty":"osgoode",
    "name":"Emily Kidd White",
    "title":"Assistant Professor",
    "email":"ekwhite@osgoode.yorku.ca",
    "href":"https:\/\/www.osgoode.yorku.ca\/faculty-and-staff\/white-emily-kidd\/",
    "bio":"Professor Emily Kidd White’s areas of teaching and research specialization are in legal and political philosophy, constitutional law, and public international law. Professor Kidd White completed her doctoral studies at New York University School of Law as a Trudeau Foundation Scholar, having previously graduated from the LLM in International Legal Studies with the Jerome Lipper Prize for distinction. Kidd White holds a JD from the Faculty of Law at Queen’s University (Dean’s Honour List) and a BAH (Politics\/Philosophy) from Queen’s University (First Class Degree). Professor Kidd White began her association at Osgoode Hall Law School as a Postdoctoral Fellow at the Jack & Mae Nathanson Centre on Transnational Human Rights, Crime and Security. Prior to joining the faculty at Osgoode Hall Law School, Professor Kidd White held a two-year research fellowship at the Jean Monnet Center for Regional and International Economic Law and Justice, and a teaching position with the Institute for International Law and Justice. Professor Kidd White is a faculty member of the Ontario Legal Philosophy Partnership Professor Kidd White Kidd White is a General Editor of the Supreme Court Law Review Annual Osgoode Constitutional Cases Review. Previously, she served as the Associate Editor of the European Journal of International Law, a world-leading peer-reviewed international law journal. Professor Kidd White’s current research interests consider legal argumentation, and the public nature and promise of law. A particular focus is on the ways in which political communities interpret the legal values and principles embedded in legal texts and judgements, and the ways in which they draw upon local, regional, or international histories and experiences to provide these legal values and principles with shape and clarity. Professor Kidd White is an emerging scholar in the field of law and emotions, holding an extensive international and interdisciplinary network on the subject. Her manuscript on Judicial Emotions is under contract with Oxford University Press, and has been accepted into its distinguished Law and Philosophy Series. Along with Susan Bandes, Jody Madeira, and Kathryn Temple, Professor Kidd White is editing the Edward Elgar Research Handbook on Law and Emotions. Professor Kidd White has presented her research at leading institutions around the world, including Oxford University, Yale Law School, UNAM, the Allard School of Law at the University of British Columbia, New York University School of Law, Cardoza Law School, Georgetown Law School, the London School of Economics, and Melbourne Law School. Research Interests: Legal and Political Philosophy, Constitutional Law, Comparative Constitutional Law, Human Rights, Discrimination Law, Public International Law, Law and Emotions, Law and Literature, Legal Reasoning.",
    "listed_research_areas":"Legal and Political Philosophy; Constitutional Law; Comparative Constitutional Law; Human Rights; Discrimination Law; Public International Law; Law and Emotions; Law and Literature; Legal Reasoning"
  }
]