[
  {
    "faculty":"queens",
    "name":"Mark Walters",
    "title":"Dean and Professor of Law",
    "email":"mark.walters@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/_mark-walters",
    "bio":"Mark Walters began his five-year term as Dean of Law on July 1, 2019. He is recognized as one of Canada’s leading scholars in public and constitutional law, legal history and legal theory. Dean Walters has researched and published extensively in these areas, with a special emphasis on the rights of Indigenous peoples, institutional structures and the history of legal ideas. His work on the rights of Indigenous peoples, focused on treaty relations between the Crown and Canada’s Indigenous nations, has been cited by the Supreme Court of Canada, as well as by courts in Australia and New Zealand. He held the distinguished F.R. Scott Chair in Public and Constitutional Law at the McGill University Faculty of Law from July 1, 2016, until June 30, 2019. For the 17 years before that, he was a faculty member at Queen’s Law, where he was appointed the school’s the inaugural Associate Dean of Graduate Studies and Research, led the 2008 launch of its doctoral program and co-chaired the committee that developed its 2014-2019 strategic plan. Previously, he taught at Oxford University after practising law Toronto in the area of Aboriginal title and treaty rights. Over his academic career, he has held a number of fellowships, including the H.L.A. Hart Fellowship (Oxford University, 2013), the Herbert Smith Fellowship (Cambridge University 2013 and 2005), the Sir Neil MacCormick Fellowship (University of Edinburgh, 2010), and the Jules and Gabrielle Léger Fellowship (Social Sciences and Humanities Research Council, 2002-2003). He received the Canadian Association of Law Teachers’ Award for Academic Excellence in 2006. Selected Publications Books A.V. Dicey and the Common Law Constitutional Tradition: ‘A Legal Turn of Mind’ (Cambridge University Press, forthcoming in 2020) Book Chapters “Deliberating about Constitutionalism” in Hoi Kong, Ron Levy, Graeme Orr and Jeff King (eds.), The Cambridge Handbook of Deliberative Constitutionalism (Cambridge: Cambridge University Press, 2018), chapter 12, 167-180 “The British Legal Tradition in Canadian Constitutional Law” in Nathalie Des Rosiers, Patrick Macklem and Peter Oliver (eds.), The Oxford Handbook of the Canadian Constitution (Oxford: Oxford University Press, 2017), chapter 5, 105-134 “Rights and Remedies within Common Law and Indigenous Legal Traditions: Can the Covenant Chain be Judicially Enforced Today?” in John Borrows and Michael Coyle (eds.), The Right(s) Relationship: Reimagining the Implementation of Historical Treaties (Toronto: University of Toronto Press, 2017), chapter 7, 187-205 “The Unwritten Constitution as a Legal Concept” in David Dyzenhaus and Malcolm Thorburn (eds.), The Philosophical Foundations of Constitutional Law (Oxford: Oxford University Press, 2016), chapter 3, 33-52 “‘Looking for a knot in a bulrush’: Reflections on Aboriginal and Crown Sovereignty”, in Patrick Macklem and Douglas Sanderson (eds.), From Recognition to Reconciliation: Essays on the Constitutional Entrenchment of Aboriginal and Treaty Rights (Toronto: University of Toronto Press, 2016), chapter 2, 35-64 “The Aboriginal Charter of Rights: The Royal Proclamation of 1763 and the Constitution of Canada” in Terry Fenge and Jim Aldridge (eds.), Creating Canada: From the Royal Proclamation of 1763 to Modern Treaties (Montreal and Kingston: McGill-Queen’s University Press, 2015), chapter 5, 49-68 “Respecting Deference as Respect: Rights, Reasonableness and Proportionality in Canadian Administrative Law” in Mark Elliott and Hanna Wilberg (eds.), The Scope and Intensity of Substantive Review: Traversing Taggart’s Rainbow (Oxford: Hart Publishing, 2015), chapter 15, pp. 395-422 “Succession to the Throne and the Architecture of the Constitution of Canada” in Philippe Lagassé and Michel Bédard (eds.), The Crown and Parliament (Montreal: Éditions Yvon Blais, 2015), chapter 10, 263-292 “‘Your Sovereign and Our Father’: The Imperial Crown and the Idea of Legal-Ethnohistory” in Shaunnagh Dorsett and Ian Hunter (eds.), Law and Politics in British Colonial Thought: Transpositions of Empire (Houndmills: Palgrave Macmillan, 2010), chapter 5, pp. 91-108 “Jurisdiction, Functionalism and Constitutionalism in Canadian Administrative Law”, in Christopher Forsyth, Mark Elliott, Swati Jhaveri, Michael Ramsden, & Anne Scully Hill (eds.), Effective Judicial Review: A Cornerstone of Good Governance (Oxford: Oxford University Press, 2010), chapter 18, pp. 300-316 “The Jurisprudence of Reconciliation: Aboriginal Rights in Canada” in Will Kymlicka & Bashir Bashir (eds.), The Politics of Reconciliation in Multicultural Societies (Oxford: Oxford University Press, 2008), chapter 8, pp. 165-191 “Written Constitutions and Unwritten Constitutionalism” in Grant Huscroft (ed.), Expounding the Constitution: Essays in Constitutional Theory (Cambridge: Cambridge University Press, 2008), chapter 10, pp. 245-276 “The Common Law Constitution and Legal Cosmopolitanism” in David Dyzenhaus (ed.), The Unity of Public Law (Oxford: Hart Publishing, 2004), chapter 16, 431-454 “Towards a 'Taxonomy' for the Common Law, Legal History, and the Recognition of Aboriginal Customary Law” in Cathy Colborne and Diane Kirkby (eds.), Law, History, Colonialism: The Reach of Empire (Manchester: Manchester University Press, 2001), chapter 8, 125-139 (with Paul Craig) “The Courts, Devolution and Judicial Review” in Christopher Forsyth (ed), Judicial Review and the Constitution (Oxford: Hart Publishing, 2000), chapter 10, pp. 213-243 [reprint of “The Courts, Devolution and Judicial Review” [1999] Public Law 274-303] Journal Articles, Essays, and Reviews “Theorizing Administrative Law—Does Dunsmuir have a Philosophy?” (2018) Canadian Journal of Administrative Law and Practice 43-46 “Toward the Unity of Constitutional Value—or, How to Capture a Pluralistic Hedgehog” (2017) 63 McGill Law Journal 1-21 “The Judicial Recognition of Indigenous Legal Traditions: Connolly v. Woolrich at 150” (2017) 22 Review of Constitutional Studies 347-378 “Judicial Review of Ministerial Advice to the Crown” (2016) 25 Constitutional Forum 33-42 “Public Law and Ordinary Legal Method: Revisiting Dicey’s Approach to Droit Administratif” (2016) 66 University of Toronto Law Journal 53-82 “The Constitutional Form and Reform of the Senate: Thoughts on the Constitutionality of Bill C-7” (2013) 7 Journal of Parliamentary and Political Law 37-61 “Is Public Law Ordinary?” (2012) 75 Modern Law Review 899-918 “Dicey on Writing the Law of the Constitution” (2012) 32 Oxford Journal of Legal Studies 21-49 “The Law behind the Conventions of the Constitution: Reassessing the Prorogation Debate” (2011) 5 Journal of Parliamentary and Political Law 131-154 “Legality as Reason: Dicey, Rand and the Rule of Law” (2010) 55 McGill Law Journal 563-586 “Legal Humanism and Law as Integrity” (2008) 67 Cambridge Law Journal 352-375 “Histories of Colonialism, Legality and Aboriginality” (2007) 57 University of Toronto Law Journal 819-832 “The Morality of Aboriginal Law” (2006) 31 Queen’s Law Journal 470-520 “St. German on Reason and Parliamentary Sovereignty” (2003) 62 Cambridge Law Journal 335-370 “Brightening the Covenant Chain: Aboriginal Treaty Meanings in Law and History after Marshall” (2001) 24 Dalhousie Law Journal 75-138 “The Common Law Constitution in Canada: Return of Lex Non Scripta as Fundamental Law” (2001) 51 University of Toronto Law Journal 91-141 “The ‘Golden Thread’ of Continuity: Aboriginal Customs at Common Law and Under the Constitution Act, 1982” (1999) 44 McGill Law Journal 711-752 “Nationalism and the Pathology of Legal Systems: Considering the Quebec Secession Reference and Its Lessons for the United Kingdom” (1999) 62 Modern Law Review 371-396 “‘According to the Old Customs of Our Nation’: Aboriginal Self-Government on the Credit River Mississauga Reserve, 1826-1847\" (1999) 30 Ottawa Law Review 1-45 “The Extension of Colonial Criminal Jurisdiction over the Aboriginal Peoples of Upper Canada: Reconsidering the Shawanakiskie Case (1822-26)” (1996) 46 University of Toronto Law Journal 273-310 “Mohegan Indians v. Connecticut (1705-1773) and the Legal Status of Aboriginal Customary Laws and Government in British North America” (1995) 33 Osgoode Hall Law Journal 785-829 “British Imperial Constitutional Law and Aboriginal Rights: A Comment on Delgamuukw v. British Columbia” (1992) 17 Queen's Law Journal 350-413 “Ecological Unity and Political Fragmentation: The Implications of the Brundtland Report for the Canadian Constitutional Order” (1991) 29 Alberta Law Review 420-449 Dean and Professor of Law BA (Western) LLB (Queen’s) DPhil (Oxford) Room 509, 128 Union Street 613-533-6000 ext. 74285 mark.walters@queensu.ca CV Teaching and Research Topics Aboriginal Law Constitutional Law Legal & Political Thought Public Law Offices, Clinics and Programs Administration Directory Teams and Committees Leadership Team",
    "listed_research_areas":"Aboriginal Law; Constitutional Law; Legal & Political Thought; Public Law"
  },
  {
    "faculty":"queens",
    "name":"Sharry Aiken",
    "title":"Associate Professor",
    "email":"aiken@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/sharryn-aiken",
    "bio":"Sharry Aiken is an Associate Professor at Queen’s Law with a cross appointment to Cultural Studies. She is an expert on immigration and refugee law and has appeared before the Supreme Court of Canada in a number of precedent setting immigration cases. Professor Aiken studied political science at York University and the University of Toronto and law at Osgoode Hall Law School. She teaches immigration law, refugee law, administrative law, law and poverty, public international law, and international human rights law. She has taught international refugee law at the American University in Cairo, and international criminal law in Osgoode’s professional LLM program. She is a two-time winner of the Queen’s LSS Award for Teaching Excellence. Professor Aiken has spent a great deal of her career advocating for human rights and social justice. She launched and managed an innovative legal literacy project in Northern Ontario, worked as a staff lawyer with community legal clinics in Toronto, and established a private practice in immigration and refugee law. She is a past president of the Canadian Council for Refugees (CCR), a former member of the Equality Rights Panel of the Court Challenges Programme of Canada, and the former Editor-in-Chief of the journal Refuge. Currently she is Co-Chair of the Board of Directors of the Canadian Centre for International Justice and an active member of the CCR’s Legal Affairs Committee. Professor Aiken convened the workshop “De-Carceral Futures: Bridging Prison and Immigration Justice” at Queen’s Law in May 2019., which sparked a broader public conversation about immigration detention and its consequences. Research: Migration law and policy Border security and critical terrorism studies Constructions of citizenship in ethnically divided societies Recent Professional Achievements Seneca College, 6th Annual Immigrant and Refugees Forum Award, 2016 Visiting Professor, Faculty of Law, Tel Aviv University, 2016 Appeared in the documentary film, The Secret Trial 5 (premiered at Hot Docs Festival, Toronto, 2014) Associate Dean (Graduate Studies and Research) 2010–2014 Associate Professor B.A. (York) M.A. (Toronto) LL.B., LL.M. (Osgoode) Room 505, 128 Union Street 613-533-6000 ext. 78007 aiken@queensu.ca Academia.edu SSRN CV Teaching and Research Topics Constitutional Law Immigration Law International Law Law and Society",
    "listed_research_areas":"Constitutional Law; Immigration Law; International Law; Law And Society"
  },
  {
    "faculty":"queens",
    "name":"Bita Amani",
    "title":"Associate Professor",
    "email":"amanib@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/bita-amani",
    "bio":"Dr. Bita Amani is an Associate Professor of Law at Queen’s University and is affiliated faculty with the Cultural Studies Graduate Program. She is Co-Director of Feminist Legal Studies Queen’s. She obtained her Bachelor of Arts from York University (with Distinction) in Sociology, her Bachelor of Laws from Osgoode Hall Law School, and received her Doctor of Juridical Science from the University of Toronto, Faculty of Law, with doctoral fellowships from SSHRC and the Centre for Innovation Law and Policy. Professor Amani teaches courses in intellectual property, information privacy, and feminist legal studies (workshop). She is currently working on a number of issues related to food law and governance, intellectual property, algorithmic error and privacy law. Dr. Amani has served as consultant to the provincial government on gene patenting as a member of the Subcommittee to the Ontario Advisory Committee on Predictive Genetic Technology (2001). She was editor and annotations editor on the e-Laws project for the Ministry of the Attorney General (Ontario, 2000-2) Office of the Legislative Counsel (OLC). Professor Amani was co-investigator on the policy implications for women and children of expanding recognition of foreign polygamous marriages in Canada, funded by the Status of Women Canada and the Department of Justice (2005). Her research on “Consuming ‘DNA as Chemicals’ and Chemicals as Food: A Fresh Policy Perspective for Women’s Health” was funded by the National Network on Environments and Women’s Health (NNEWH), through the Bureau of Women’s Health and Gender Analysis, Health Canada. She has been a consultant to, and served briefly as a legislative drafter for, the Ministry of the Attorney General (Ontario), Office of the Legislative Counsel (37th Legislative Session, 2001). She occasionally teaches as an Adjunct Professor of Law at Osgoode Hall Law School, in the Part-Time Professional Development Program (LLM) and is called to the Bar of Ontario (2000). Professor Amani enjoys traveling extensively to deliver lectures, papers, and presentations and has published on a number of topics. Current Research Current research is focused on various issues in food law, intellectual property law, policy, and politics (domestic and international), innovation and sustainable development, regulating new technologies (from biotech to AI\/robotics), biopiracy and protection of traditional and cultural knowledge, regulatory issues in medical\/scientific research and its commercialization, privacy and data protection, regulatory diversity, feminist and critical legal studies. Visiting Positions Osgoode Hall Law School, Distinguished Visiting Scholar, Institute for Feminist Legal Studies, Canada, 2009-10 University of Oxford, Visiting Scholar and Research Fellow, Guest Lecturer, Intellectual Property Research Centre, UK, Spring 2008 University of Leeds School of Law, Visiting Scholar and Research Fellow, Guest Lecturer, Centre for International Governance, UK, Spring 2008 Brocher Foundation, Visiting Scholar and Research Resident, Geneva Switzerland, Spring\/Summer 2008 Select Recognitions Iranian Women’s Organization of Ontario (IWOO) High Achiever Award (2017) Elected to the Board of IT.CAN (2009-11) Professor of the Month, IranianProfessors.com Tribute to Iranian Canadian Academe Award Recipient Select Publications Books and Monographs Trade-marks and Unfair Competition: Cases and Commentary on Canadian Law Second Edition (with Carys Craig), (Toronto: Carswell, 2014). Trade-marks and Unfair Competition: Cases and Commentary on Canadian Law First Edition (with Carys Craig), (Toronto: Carswell, 2011). State Agency and the Patenting of Life in International Law: Merchants and Missionaries in a Global Society, (Aldershott: Ashgate Publishing Company, 2009). Other Recent Scholarship “Of at Least Equal Importance: (Intellectual Property) Rights Mapping with a Moral Compass” (2018) 31.1 Intellectual Property Journal, 105- “The Jus of Use: Trademarks in Transition” (2018) 30 Intellectual Property Journal, 217-270. “Disabused of Copyright’s Use?: Not Quite But You Had Me at Non-use”, (December 2016) 29 Intellectual Property Journal, 141-154 (Book Review). ““Consuming “DNA as Chemicals” and Chemicals as Food” in Dayna Nadine Scott (ed.), Our Chemical Selves: Gender, Toxics, and Environmental Health (Vancouver: UBC Press, 2015) 142-187. “Biopatenting and Industrial Policy Discourse: Decoding the Message of Biomedia on the Limits of Agents and Audiences”, in Courtney Doagoo et al.(eds.) Intellectual Property for the 21st Century: Interdisciplinary Approaches (Toronto: Irwin Law, 2014) 137-161 “Copyright and Freedom of Expression: Fair Dealing Between Work and Play” in Rosemary Coombe et. al., (eds.), Dynamic Fair Dealing: Creating Canadian Culture Online (Toronto: University of Toronto Press, 2014) 43-55. “Access Copyright and the Proposed Model Copyright License Agreement: A Shakespearean Tragedy” (2012) 24 Intellectual Property Journal, 221-246. Associate Professor BA (York) LLB (Osgoode) SJD (Toronto) 613-533-6000 ext. 74252 amanib@queensu.ca Teaching and Research Topics Feminist Legal Studies Intellectual Property Privacy",
    "listed_research_areas":"Feminist Legal Studies; Intellectual Property; Privacy"
  },
  {
    "faculty":"queens",
    "name":"Martha Bailey",
    "title":"Professor",
    "email":"baileym@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/martha-bailey",
    "bio":"Martha Bailey, is a Professor of law at Queen’s, where her courses include property law and private international law. In addition to her LLB, LLM and DPhil in Law, she holds a MSc degree in neuroscience and is cross-appointed to Queen’s Centre for Neuroscience Studies. Her research focuses on cross-border family law and, more recently, indigenous self-governance in private family law. She has been a visiting scholar\/professor at several law faculties, including Otago, Laval, Melbourne, Emory, and India’s NALSAR University. Publications: “Revisiting the Best Interests of the Child Principle” (2016) Supreme Court Law Review, forthcoming “Canada’s Conflicted Approach to International Child Abduction” in William Atkin, ed, International Survey of Family Law (Jordans, 2016) 81 “Setting Boundaries” in William Atkin, ed, International Survey of Family Law (Jordans, 2015) 21 (with Amy Kaufman) “Should Civil Marriage be Opened up to Multiple Parties?” (2015) 64 Emory Law Journal 1747 “Criminal Law and Polygamy,” in Janet Bennion, ed, The Polygamy Question (Utah State UP, 2015) “Cross-border Child Welfare: The Lev Tahor Case” (2014) Canadian Family Law Quarterly 367 Conference Presentations: “Family Law and the Realities of Family Life,” paper presentation at the International Society of Family Law conference, Moran, Wyoming, 22-24 May 2016 “The Hague Abduction Convention and Immigration Law Issues,” paper presentation at the Government of Canada Workshop on Intersecting Issues in Family and Immigration Law, 24 February 2016 “Marriage Law in Jane Austen’s World,” paper presentation at the Jane Austen Society of North American conference, Living in Jane Austen’s World, Louisville, Kentucky, 9-11 October 2015 Professor LLB (Toronto) LLM (Queen's) MSc (Queen's) DPhil (Oxford) 613-533-6000 ext. 77734 baileym@queensu.ca SSRN CV Teaching and Research Topics Comparative Law Family Law International Law",
    "listed_research_areas":"Comparative Law; Family Law; International Law"
  },
  {
    "faculty":"queens",
    "name":"Beverley Baines",
    "title":"Professor",
    "email":"bainesb@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/beverley-baines",
    "bio":"Beverley Baines is a Professor of Public and Constitutional Law with a passion for illuminating the legal strategies the patriarchal state deploys to deny women their right to equality which is guaranteed in the Canadian Charter of Rights and Freedoms. Her passion dates from her involvement as a feminist constitutional consultant, first to the Canadian Advisory Council on the Status of Women and then to the Ad Hoc Committee of Women on the Constitution during the Charter debates of 1980-1982. Professor Baines earned a BA Hons (Economics and Political Science) from McGill and a JD from Queen’s, following which she articled with Trumpour and Kennedy in Kingston, joined Queen’s Law as a faculty member, was admitted to the Law Society of Upper Canada, and served as Associate Dean in the Faculty of Law (1994-1997). Seconded twice to the Faculty of Arts and Science, she was Co-Coordinator of the Institute of Women’s Studies (1991-1993) and Head of the Department of Gender Studies (2004-2011). Professor Baines co-edited two books on women and constitutional law: The Gender of Constitutional Jurisprudence (2005) and Feminist Constitutionalism: Global Perspectives (2012). She has published papers and delivered international conference presentations that focus on giving voice to the intersectional claims of religious women living polygamously, accessing faith-based family law arbitrations, and wearing the niqab in Ontario courtrooms or when delivering and receiving public services in Quebec. She also writes about gender and the legal profession, including the Trinity Western law school controversy, United States Supreme Court Justice Ruth Bader Ginsburg’s call for the appointment of nine women justices on the American Supreme Court, and the history of women law professors in Canada. Research Sex equality rights under the Charter Intersectionality and the Charter Gender, Religion, and the Charter Women Judges Women Law Professors Recent Accomplishments Law Students’ Society Teaching Award, 2012 Head, Department of Gender Studies, Faculty of Arts & Science, Queen's 2004-2011 Organized second International Conference on Feminist Constitutionalism, Queen’s University, with Professors Daphne Barak-Erez and Tsvi Kahana (2009) Organized First International Conference on Women and Constitutional Law, University of Seville, with Professor Ruth Rubio-Marin (2000) Associate Dean, Faculty of Law 1994–1997 Co-Coordinator, Institute of Women’s Studies, Faculty of Arts & Science, Queen’s University, 1991–1993. Books: Beverley Baines, Daphne Barak-Erez, Tsvi Kahana (eds.). Feminist Constitutionalism: Global Perspectives. New York: Cambridge, 2012. Beverley Baines and Ruth Rubio-Marin, The Gender of Constitutional Jurisprudence. New York: Cambridge, 2004. Articles and Book Chapters: “Women Judges on Constitutional Courts: Why not nine women?” in Helen Irving ed., Constitutions and Gender (Edward Elgar Research Handbook, forthcoming 2017) “Constitutionalizing Women’s Equality Rights: There is Always Room for Improvement” (2015\/16) 37.2 (1) Atlantis 112-119. “Polygamy: Who Speaks for Women? in Kim Rubenstein and Katharine G. Young (eds.), The Public Law of Gender: From the Local to the Global (Cambridge University Press, 2016), 219-245. “Must Feminist Judges Self-identify as Feminist” in Ulrike Schultz and Gisela Shaw (eds.), Gender and Judging (Oxford: Hart Publishing, 2013) 369-388. “Banning the Niqab in the Canadian Courtroom: Different Standards for Judges” (2013) Jurist Forum January 24, 2013 http:\/\/jurist.org\/forum\/2013\/01\/bev-baines-canada-niqab.php “Comparing Women in Canada” (2012) 20 (no.2) Feminist Legal Studies 89-103. “Polygamy and Feminist Constitutionalism” in B. Baines, D. Barak-Erez, and T. Kahana, eds., Feminist Constitutionalism: Global Perspectives (Cambridge University Press, 2012) 452-73. “The Challenge of our Charter Identity” (2012) 21 no. 2 Canadian Bar National 30-33. “Gender Equality in the Constitution: Canadian Experience” (Anayasa'da Kadın-Erkek Eşitliği: Kanada Tecrübesi) in Dr. Fatih Ozturk (ed.), Road Map for the New Constitution (Yeni Anayasa İçin Yol Haritası) (Istanbul, 2012). Presentations: “Personalizing Feminist Critique” to Legal Research Methods and Perspectives Law 880, Queen’s University Faculty of Law, October 11, 2016. “Does Sex Equality Have a Future?” at Section 15 of the Charter Conference, Osgoode Hall Law School, May 13, 2016 “Identifying Canada’s First Women Law Professors” at Gender and Careers in the Legal Academy Conference of International Working Group for Comparative Studies of Legal Professions, Women\/Gender in the Legal Profession Subgroup, Schonburg\/Oberwesel, Germany, May 8-11, 2016 “Canada: Framing Litigation as Constitution-Enhancing” at Gender and Constitution-Making Workshop, European University Institute, Florence, Italy, October 16-17, 2015 “Constitutional Culture and Competing Rights” at Constitutional Culture: Identities, Texts, Institutions Conference, Faculty of Law, Queen’s University, October 2-3, 2015 “Designing Canadian Parity: Preliminary Thoughts” at Women and Legal Pluralism: Extending Parity Governance? Workshop at European University Institute Florence Italy Feb 13-14, 2015 “Religion, Sexuality and Lawyering: Two Canadian Feminist Perspectives” presentation to doctoral student seminar Gender and Sexuality Across the Disciplines II at European University Institute, Faculty of Law, Florence Italy February 12, 2015. “Beyond Competing Rights” at Women, Equality and Religious Rights Symposium, LEAF, Toronto January 30, 2015 Professor BA (McGill) JD (Queen's) 613-533-6000 ext. 79589 bainesb@queensu.ca SSRN CV Teaching and Research Topics Charter of Rights and Freedoms",
    "listed_research_areas":"Charter Of Rights And Freedoms"
  },
  {
    "faculty":"queens",
    "name":"Nicholas C. Bala",
    "title":"William R. Lederman Distinguished University Professor",
    "email":"bala@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/nicholas-c-bala",
    "bio":"Nicholas (Nick) Bala is an internationally recognized expert on issues related to children, youth and families in the justice system, and teaches in that area as well as Contract Law. He graduated from Queen’s law school in 1977. After articling in Ottawa, he worked as Review Counsel at Queen’s Legal Aid, and then obtained a LL.M. from Harvard. Since 1980 he has been on the Faculty at Queen's Law, as well as a Visiting Professor at McGill, Osgoode Hall Law School, Duke and the University of Calgary. Prof. Bala is an expert on Family and Children’s Law, with research focussing on issues related to parental separation issues including parental alienation and relocation; children in the family courts, including role of child’s counsel and judicial interviewing of children; spousal abuse and its effects on children; children in the criminal courts; and access to family justice. Much of his research work is interdisciplinary; he has undertaken many collaborative projects with psychologists, social workers, criminologists and health professionals to better understand the effects of involvement in the justice system on children, youth and families. He has published extensively in journals in law, medicine, psychology and social work. His work is often quoted by all levels of court in Canada, including the Supreme Court and courts of appeal across the country, and he has also been cited by courts in the United States, Britain, Australia, New Zealand and Singapore. Prof. Bala was awarded the Queen’s University Prize for Excellence in Research in 2006, and the Stanley Cohen Distinguished Research Award of the AFCC (Association of Family & Conciliation Court). He has written or co-authored 24 books and over 225 articles and book chapters. He is frequently invited to speak at law reform conferences and professional education programs for judges, lawyers, doctors, psychologists, child welfare workers, and social workers. His contributions to family law research and professional education were recognized in awards from Ontario’s Law Society and the Ontario Bar Association in 2009, and in 2013 he was elected a Fellow of the Royal Society of Canada. In 2019 he was named the William R. Lederman Distinguished Professor at Queen’s University. Prof. Bala has worked with Canada’s National Judicial Institute on planning and delivering educational programs for judges on such issues as high conflict separations, child witnesses, domestic violence and young offenders. He has presented briefs to Parliamentary Committees in Canada on many issues related to families, children and the justice system, and has appeared as an expert witness at public inquiries related to children and youth. He has been a consultant and written reports for the federal government, and provincial and territorial governments and their agencies in Ontario, Alberta, British Columbia and the Yukon, and played a significant role in such reforms as changing the laws governing: post-separation parenting; the assessment of the competency of child witnesses; and use of expert evidence in child-related cases. He has also had role in improving advocacy for children, responses to domestic violence, and increasing the use of post-separation parenting plans. Recent Professional Achievements Co-author of recent reports for government of Canada on family violence, child witnesses in the criminal justice system, and parental relocation after separation Frequently presenting to professional groups on issues relating to family and children's law, for such organizations as National Judicial Institute, Federation of Law Societies, Ontario Bar Association and Law Society of Ontario Three times winner of Law Students Society teaching award Ontario Bar Association, Award for Excellence in Family Law, 2009 Law Society Medal, 2009 Elected Fellow of the Royal Society of Canada, 2013 Principal investigator of interdisciplinary group of researchers on child witness issues with funding from Social Sciences & Humanities Research Council, 1999 - 2014 Principal investigator of interdisciplinary group of researchers on improving access and outcomes in the family justice system with funding from Social Sciences & Humanities Research Council, 2014 -2022 Work cited by all levels of court in Canada, includingby the Supreme Court of Canada in 36 cases, as well as courts in the United States, Great Britain and Australia Co-Investigator on Law Foundation of Ontario funded research projects on voice of the child reports, improving access to family justice and responding to high conflict separations, 2017-2022 Principal Investigator on research project funded by Canadian Foundation on Legal Research on long term effects of parental alienation, 2022-23 Co-editor of Special Issue of Family Court Review on parental alienation and children resisting contact with parents, 2020 Chair of multidisciplinary task force that prepared the AFCC-Ontario Parenting Plan Guide and Template, 2019-2022 Recent Publications Books Bala & Anand, Youth Criminal Justice Law, 3rd edition (Toronto: Irwin Law, 2012) Fidler, Bala & Saini, Children Resisting Post-Separation Contact: A Differential Approach for Legal and Mental Professionals (New York: Oxford University Press, 2013) Birnbaum & Bala, Making Parenting Plans in Canada’s Family Justice System: Challenges, Controversies, and the Role of Mental Health Professionals (Toronto: Thomson Reuters, 2019) Swan, Bala & Adamski, Contracts: Cases, Notes and Materials, 10th edition (Toronto: LexisNexis, 2020) Mary-Jo Maur, Nicholas Bala & Claire Houston, Family Law: Text, Cases, Materials and Notes, 10th edition (Toronto: Thomson Reuters, 2021) William R. Lederman Distinguished University Professor L.S.M., B.A. (Toronto) J.D. (Queen's) LL.M. (Harvard) Room 501, 128 Union Street 613-533-6000 ext. 74275 bala@queensu.ca SSRN CV YouTube Teaching and Research Topics Children’s Law Contracts Family Law",
    "listed_research_areas":"Children's Law; Contracts; Family Law"
  },
  {
    "faculty":"queens",
    "name":"Kevin Banks",
    "title":"Associate Dean (Faculty), Associate Professor; Director, Centre for Law in the Contemporary Workplace",
    "email":"banksk@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/kevin-banks",
    "bio":"Biography Kevin Banks is Associate Professor of Law at Queen’s and the Director of the Queen's Centre for Law in the Contemporary Workplace. He is the Editor-in-Chief of the Canadian Labour and Employment Law Journal, and a co-ordinating editor of Labour and Employment Law, Cases, Materials and Commentary. His research publications address efficiency and delay in Canadian labour arbitration, relationships between economic globalization and labour and employment law, the influence of originating political struggles on workplace equality law in North America and the European Union, the role, governance and potential influence of international and transnational labour labour law, the extent and causes of gaps in the workplace accommodation of persons with disability, the accessibility and effectiveness of employment standards compliance and enforcement, and the role of good faith in the contract of employment. He is a part time member of the Ontario Grievance Settlement Board and has been appointed to several dispute settlement rosters established pursuant to labour chapters of free trade agreements. He chaired the international arbitral panel that ruled on a dispute concerning the labour provisions of the US-Central America Tree Trade Agreement, the first such case decided anywhere in the world. Professor Banks previously served in a number of senior positions within the Public Service of Canada, including Director General, Labour Policy and Workplace Information, Director of Research with the Federal Labour Standards Review Commission, and Director, Inter-American Labour Co-operation. He holds an LL.B. (1989) and B.A. (1986) in economics from the University of Toronto, and an S.J.D. from Harvard Law School (2003). Recent Professional Achievements Director, Centre for Law in the Contemporary Workplace, Faculty of Law, Queen's University Editor-in-Chief, Canadian Labour and Employment Law Journal. Member, Roster of Panelists for Chapter 31 Dispute Settlement Panels, US-Mexico-Canada Free Trade Agreement Member, Chapter 23 Panel of Experts Roster, Canada-EU Comprehensive Economic and Trade Agreement Coordinating Editor, with Prof. Michael MacNeil, Labour and Employment Law: Cases, Materials and Commentary (9th edition) (2018), Canada’s leading labour law casebook. Chair of an arbitral panel appointed to hear and decide the first labour rights dispute under a free trade agreement to be arbitrated Academic Advisor to Ontario’s Changing Workplaces Review (2015-2017), authoring a report on enforcement and compliance under the Employment Standards Act Member, Advisory Committee on Private Commercial Disputes to the North American Free Trade Commission (2008 - 2020). Book Review Editor, Comparative Labor Law and Policy Journal Current Research Constitutional collective bargaining rights of employees not covered by labour relations statutes Renewing the institutional foundations of Canadian labour and employment law Purposes and extent of obligations of trade agreement labour chapters Legal responsibility of third parties for wage and hours violations under employment statutes and contracts Recent Publications K. Banks, “Fit for Purpose? The Extent and Enforcement of Trade Agreement Labor Obligations After the Guatemala – Labor Obligations Decision”, forthcoming in the Georgetown Journal of International Law, spring 2021 K. Banks, R. Chaykowski and G. Slotsve, \"Labour Rights Arbitration in Canada: An Empirical Investigation of Efficiency and Delay in a Changed Legal Environment\", 22 Canadian Labour and Employment Law Journal 231 (2020) Manoj Dias-Abey and Kevin Banks “Migrant Workers: Contesting Definitions, Institutional Responses, and Rights” 35 International Journal of Comparative Labour Law and Industrial Relations 153 (2019) K. Banks and M. MacNeil, coordinating editors, Labour and Employment Law: Cases, Materials and Commentary (9th edition) (2018) K. Banks and G. Trudeau “Introduction” Chapter 1 of Labour and Employment Law: Cases, Materials and Commentary (9th edition) (2018) K. Banks “Workplace Law without the State?”, in S. Archer, D. Drache, and P. Zumbansen eds. “The Daunting Enterprise of the Law: Essays in Honour of Harry W. Arthurs (McGill-Queen’s University Press, 2017) K. Banks, R. Chaykowski, G. Slotsve, “Did Weber Affect the Timeliness of Arbitration?” in E. Shilton and K. Schucher eds. “One Law for All? Weber v. Ontario Hydro 20 Years On” (Irwin Law, 2017) IN THE MATTER OF GUATEMALA – ISSUES RELATING TO THE OBLIGATIONS UNDER ARTICLE 16.2.1(a), Final Report, June 14, 2017. (299 pages) K. Banks, “Employment Standards Complaint Resolution, Compliance and Enforcement: A Review of the Literature on Access and Effectiveness”, Prepared for the Ontario Ministry of Labour, to support the Changing Workplaces Review of 2015 (Queen’s Printer, 2016) (108 pages) K. Banks, “Reasonable Accomodation as Equal Opportunity in Canadian Employment” 93 Bulletin of Comparative Labour Relations 47 (2016) K. Banks R. Nunin and A.Topo “The Lasting Influence of Legal Origins: Workplace Discrimination and Social Inclusion in Canada, the United States and the European Union”, in M. Finkin and G. Mundlak eds. “Handbook of Comparative Labour and Employment Law” (Elgar, 2015) K. Banks and Elizabeth Shilton, “The Changing Role of Labour Relations Boards in Canada: Key Research Questions for the 21st Century”, March 2014 (30 pages). K. Banks, R. Chaykowski, and G. Slotsve “Disability Accommodation in Employment: How Does an Aging Population Matter and What Does it Mean for Law and Policy?” 17 Canadian Labour and Employment Law Journal 295 (2013) K. Banks, “Must Canada Change its Labour and Employment Laws to Compete with the United States?”, 38 Queen’s Law Journal 419-460 (2013) K. Banks and Elizabeth Shilton, “Corporate Commitments to Freedom of Association: Is There a Role for Enforcement Under Canadian Law?” 33 Comparative Labor Law and Policy Journal 495 (2012) K. Banks, “The Role and Promise of International Law in Canada's New Labour Law Constitutionalism”, 16 Canadian Labour and Employment Law Journal 233 (2012) K. Banks, “Trade, Labor and International Governance: An Inquiry into the Potential Effectiveness of the New International Labor Law” 32 Berkeley Journal of Employment and Labor Law 45-144 (2011). K. Banks, “Progress and Paradox: The Remarkable Yet Limited Advance of Employer Good Faith Duties in Canadian Common Law”, 32 Comparative Labour Law and Policy Journal 547-592 (2011). Associate Dean (Faculty), Associate Professor; Director, Centre for Law in the Contemporary Workplace 613-533-6000, ext. 79244 banksk@queensu.ca SSRN Teaching and Research Topics Labour & Employment Labour Law Property Law Offices, Clinics and Programs Administration Directory Centre for Law in the Contemporary Workplace Teams and Committees Leadership Team",
    "listed_research_areas":"Labour & Employment; Labour Law; Property Law"
  },
  {
    "faculty":"queens",
    "name":"Lindsay Borrows",
    "title":"Assistant Professor",
    "email":"lindsay.borrows@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/lindsay-borrows",
    "bio":"Lindsay Borrows is an Assistant Professor at Queen’s University, Faculty of Law, where she teaches special topics in the field of Indigenous law. Previously she worked as a lawyer and researcher at the Indigenous Law Research Unit (University of Victoria Faculty of Law), and as a staff lawyer at West Coast Environmental Law. In both positions she provided legal support to Indigenous communities and organizations engaged in the revitalization of their own laws for application in contemporary contexts. She has worked on community-engaged projects with different legal traditions including Anishinaabe, Denezhu, Haíɫzaqv, Nlaka’pamux, nuučaan̓uł, St’át’imc, Syilx and Tsilhqot’in. She is particularly passionate about the possibilities within land-based legal education, and since 2014 she has co-facilitated various ‘on-the-land’, community-engaged Anishinaabe Law Camps in partnership with different law schools and communities across Ontario. Her book Otter’s Journey Through Indigenous Language and Law (UBC Press, 2018) explores the connections between language and law. Lindsay is Anishinaabe and a member of the Chippewas of Nawash First Nation. Research topics Indigenous Legal Methods; Indigenous Environmental Law and Ecological Governance; Select Topics of Anishinaabe Law (child well-being, human rights, criminal, torts, and the environment); Field School Courses in Indigenous Legal Traditions; and Indigenous Child Well-Being Research focus statement Indigenous peoples across Canada face serious challenges that require the application of law in its most healing forms to enable the necessary transformations towards a more just society. Indigenous peoples’ own laws are an essential component of confronting these challenges encountered within and beyond their communities. Lindsay Borrows’ work examines the different sources from which Indigenous laws flow including for example custom, deliberation, stories, songs, ceremony, dances, language, legislation, treaties (etc.). She also studies the methods people use to draw out law from these sources. Prof. Borrows is particularly interested in an emergent area of Indigenous legal research—looking to the natural world as legal precedent and exploring how reading the land as a legal archive introduces innovative practices of deliberation, decision-making, and dispute-resolution. Articles and Books Comox Valley Collective Magazine, “Blanketed in Hope: A Meeting of Art, Reconciliation, and the Law in the K’omoks Bighouse” (Spring 2020) Otter’s Journey Through Indigenous Language and Law (Vancouver: University of British Columbia Press, 2018) Book Review of “Unsettled Expectations” by Dr. Eva Mackey, AlterNative Journal, 2017 “Dabaadendiziwin: Practices of Humility in a Multi-Juridical Legal Landscape”, Windsor Year Book of Access to Justice, 2016 “On the Road Home: Stories and Reflections from Neyaashiinigmiing”, in Jill Doerfler, Heidi Stark, James Sinclair, eds., Centering Anishinaabeg Studies: Understanding the World Through Stories (Michigan State University Press, 2013) Publicly Available Reports St’át’imc Legal Traditions Report (Revitalizing Indigenous Law for Land, Air and Water Project), West Coast Environmental Law & St’át’imc Chiefs Council, co-author, (2018). Online: <https:\/\/www.wcel.org\/sites\/default\/files\/publications\/2018_statimc_relaw_legaltraditionsreport.pdf>. Anishinaabek Legal Traditions Report (Accessing Justice and Reconciliation Project), University of Victoria Indigenous Law Research Unit, co-author, (2012). Summary document online: <https:\/\/indigenousbar.ca\/indigenouslaw\/wp-content\/uploads\/2012\/12\/anishinabek_summary.pdf>. Mikomosis and the Wetiko, “A Teaching Guide for Youth, Community and Post-Secondary Educators”, co-author, (2013). Online: <https:\/\/www.indigenousbar.ca\/indigenouslaw\/wp-content\/uploads\/2013\/04\/M…; Teaching subjects Indigenous Law in Practice; Indigenous Law and Ecological Governance Assistant Professor BA (Dartmouth College) JD (University of Victoria) LLM (University of Alberta) Robert Sutherland 543 lindsay.borrows@queensu.ca Teaching and Research Topics Comparative Law Environmental Law Feminist Legal Studies Indigenous Law",
    "listed_research_areas":"Comparative Law; Environmental Law; Feminist Legal Studies; Indigenous Law"
  },
  {
    "faculty":"queens",
    "name":"Richard Chaykowski",
    "title":"Professor, MIR Program Director, Faculty of Arts and Science, and Professor Law",
    "email":"chaykows@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/richard-chaykowski",
    "bio":"Richard Chaykowski received his PhD from Cornell University. Dr. Chaykowski is currently a faculty member in the Faculty of Arts and Science and in the Faculty of Law (cross-appointed) at Queen's University. He has been a Visiting Scholar at the MIT and a visitor at the University of Toronto and at McGill University. Dr. Chaykowski has also been Visiting Chair at Human Resources and Social Development in the federal government, where he was situated in Strategic Policy. His role within government was to support the development of high-quality, evidence-based policy, and provide a ‘challenge function' as policies are being developed. Prof. Chaykowski's teaching and research interests include labour policy and its role in the new economy, the intersection of labour policy and law, labour market institutions, labour relations and collective bargaining, North American labour markets, workplace training and innovation, and the impacts of technological change in the workplace. He is frequently requested to speak on these issues in a wide range of forums in both the private and public sectors, including union and senior management groups as well as departments of the Government of Canada. He has also provided support to these stakeholders in a variety of capacities. His published work has included scholarly articles in journals in economics, such as the Canadian Journal of Economics, the North American Journal of Economics and Finance,Canadian Public Policy, Canadian Business Economics,and Research in Labor Economics, in industrial relations, such as the Industrial and Labor Relations Review, the British Journal of Industrial Relations, Industrial Relations, the Journal of Labor Research, Relations industrielles, and Advances in Industrial and Labor Relations, and law, such as the Canadian Labour and Employment Law Journal and the Saskatchewan Law Review. He has also published articles in such broader publications as the Workplace Gazette, Collective Bargaining Review, Policy Options, and The Financial Post. He has published over forty papers in edited volumes, periodicals, academic proceedings, and as other professional or technical reports. Has also been a guest co-editor of special issues of the journals Relations industrielles and Canadian Public Policy. Recent Publications Industrial Relations in Canadian Industry (co-edited with Anil Verma) Research in Workers' Compensation (co-edited with Terry Thomason) Transition and Structural Change in the North American Labour Market (co-edited with Charles Beach and Michael Abbott) Contract and Commitment: Employment Relations in the New Economy (co-edited with Anil Verma) 1999 Women and Work (co-edited with Lisa Powell) 1999 Globalization and the Canadian Economy 2001 Modern Labour Economics: Theory and Public Policy, First Canadian Edition (with R. Ehrenberg and R. Smith) 2004 Health Services Restructuring in Canada: New Evidence and New Directions, (co-edited with C. Beach, S. Shortt, F. St. Hilaire, and A. Sweetman) Kingston ON: John Deutsch Institute, Queen’s University; and Montreal: IRPP) 2006 Reform of the Conduct and Structure of Labour Relations in the Ontario Broader Public Service: Report to the Commission on the Reform of Ontario’s Public Service, (with R. Hickey). Kingston, ON: Queen’s University School of Policy Studies (Industrial Relations Series) 2012 Building More Effective Labour-Management Relationships, (co-edited with R. Hickey). Kingston ON: Queen’s University School of Policy Studies (in press). Professor, MIR Program Director, Faculty of Arts and Science, and Professor Law 613-533-6000 ext. 77071 chaykows@queensu.ca Teaching and Research Topics Labour & Employment Labour Law",
    "listed_research_areas":"Labour & Employment; Labour Law"
  },
  {
    "faculty":"queens",
    "name":"Samuel Dahan",
    "title":"Assistant Professor",
    "email":"samuel.dahan@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/samuel-dahan",
    "bio":"Samuel Dahan is professor of law at Queen’s University and is cross-appointed to Cornell Law School and Paris Dauphine Law School. He is the Chief of Policy and Chair of the Deel Lab for Global Employment, a consortium on global work and compliance analytics. A qualified lawyer and mediator, his areas of interest include employment policy, data science and dispute resolution. Dahan is the founder and Director of the Conflict Analytics Lab, a research consortium concerned with the application of analytics to dispute resolution. He is responsible for the development of MyOpenCourt, an open-access legal technology; and since 2020, he has served as an advisor to leading Canadian law firm BLG, offering guidance on optimizing dispute resolution practices. Dahan is a member of the stakeholder board of the European Union Intellectual Property Office (EUIPO) and is the recipient of both the 2021 Stanley M. Corbett Award for Excellence in Teaching, and the 2020 INFORMS UPS Prize for best program in analytics. Dahan’s research has been published in leading journals such as the International Journal of Economic Law; McGill Law Journal; European Labour Law Journal; Industrial Law Journal; Journal of Law and AI; AAAI; and ICML. His work has been featured on Global News, CTV, Semafore, and CBC. Prior to joining Queen’s University, Dahan was an EU official, serving as a cabinet member at the Court of Justice of the European Union and clerking for the Conseil d’Etat in France. During the financial crisis of 2008, he acted as an advisor to the financial assistance program in Latvia. Dahan also served as an affiliate faculty member at the Program on Negotiation at Harvard Law School. Dahan holds a doctorate from the University of Cambridge. He has studied law and dispute resolution at Harvard Law School; the Ecole Normale Supérieure (ENS-Ulm); the Sorbonne; Leuven University in Belgium; and the University of Nice. He was a bronze medalist at the French and UK championships in kickboxing and Taekwondo. Links Google Scholar Profile LinkedIn Areas of Expertise and Research Global Work Legal AI Workplace Mediation Achievements Founded the Conflict Analytics Lab, a research consortium for conflict resolution and Artificial Intelligence (2018) Appointed to the European Union Intellectual Property Office (2019) Commissioned to deliver a feasibility study on trademark dispute technologies for the European Union Intellectual Property Office (EUIPO) (2020) Recipient of more than $300,000 in grant money as Principal Investigator, including SSHRC New Frontiers Grant (2019–2021) Conflict Analytics Lab was co-recipient of the INFORMS Prize (as a founding member of the Smith Ecosystem) (2020) Developed AI legal aid platform with dispute resolution algorithm, www.MyOpenCourt.org (2020) Continuing cross-appointment at Cornell Law, Smith School of Business, Program on Negotiation at Harvard Law School, and Ingenuity Lab Publications ‘Investigating the State-of-the-Art Performance and Explainability of Legal Judgment Prediction’, AAAI (2021) ‘The Legal Case for a Central Bank Labour Mandate’, Rethinking the Foundations of Workplace Law (University of Toronto Press 2023) ‘Interpretable Low-Resource Legal Decision Making’ [2022] Canadian AI ‘Conflict Analytics: When Data Science Meets Dispute Resolution’ [2022] Management Business Review ‘Analytics and EU Courts: The Case of Trademark Disputes’ in Tamara Capeta and Iris Goldner Lang (eds), The Changing European Union: A critical view on the role of the Courts (Hart Publishing 2022) ‘The Use of AI in Legal Systems: Determining Independent Contractor vs. Employee Status’, Conference in Empirical Legal Studies (2022) (forthcoming in Journal of Law and AI) ‘The Case for AI-Powered Legal Aid’ [2021] Queen’s Law Journal ‘Detection of Similar Legal Cases on Personal Injury’, 2021 International Conference on Data Mining Workshops (ICDMW) (IEEE 2021) ‘Predicting Employment Notice Period with Machine Learning: Promises and Limitations’ (2020) 65 McGill Law Journal \/ Revue de droit de McGill 711 ‘AI-Powered Trademark Dispute Resolution’ (European Union Intellectual Property Office (EUIPO) 2020) Expert Opinion ‘Mediation in Canada’, Mediation: Regulations, Trends & Practices (LexisNexis 2020) ‘The Gap between Deep Learning and Law: Predicting Reasonable Notice’, International Conference on Machine Learning (ICML) (2020) ‘Determining Worker Type from Legal Text Data Using Machine Learning’ [2020] Pervasive Intelligence and Computing (IEEE PICom) ‘(Re-)Designing Institutions for EMU Wage Setting: Strengthened Coordination between Monetary and Economic Institutions’ (2017) 8 European Labour Law Journal 281 ‘A Path-Dependent Deadlock: Institutional Causes of the Euro Crisis’ (2016) 49 Cornell International Law Journal 309 ‘Whatever It Takes? Regarding the OMT Ruling of the German Federal Constitutional Court’ (2015) 18 Journal of International Economic Law 137 ‘The EU\/IMF Financial Stabilisation Process in Latvia and Its Implications for Labour Law and Social Policy’ (2012) 41 Industrial Law Journal 305 ‘Comment Favoriser l’essor de La Médiation Comme Solution Aux Conflits Liés à l’environnement et Aux Ressources Naturelles ?’ Ateliers de la Terres, ESSEC IRENE (Institute for Research and Education on Negotiation) 2011 Assistant Professor MA (Sorbonne-Ecole Normale Supérieure Ulm) LLM (Leuven) PhD (Cambridge) Room 519, 128 Union Street 613-533-6000 ext 75824 samuel.dahan@queensu.ca Conflict Analytics Lab LinkedIn Twitter Conflict Analytics Lab",
    "listed_research_areas":null
  },
  {
    "faculty":"queens",
    "name":"Benjamin Ewing",
    "title":"Assistant Professor",
    "email":"benjamin.ewing@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/benjamin-ewing",
    "bio":"Benjamin Ewing is an Assistant Professor at Queen’s Law. Prior to joining Queen’s, he was a Visiting Assistant Professor at Duke University School of Law. He earned his PhD in Politics from Princeton University, his JD from Yale Law School, and his AB in Applied Mathematics-Economics from Brown University, where he graduated magna cum laude. At Princeton, Ewing was a Laurance S. Rockefeller Graduate Prize Fellow in the University Center for Human Values. While a law student at Yale, he was a Coker Fellow and, in the fall of 2009, a research assistant to Associate Justice Stephen Breyer of the Supreme Court of the United States. In his scholarship, Ewing analyzes the moral and political foundations of different forms of legal responsibility for wrongdoing, particularly criminal punishment. He is especially interested in what it means to have a fair opportunity to avoid crime and punishment. He has developed a distinctive interpretation of fair opportunity to avoid crime that helps explain, among other things, the moral significance at sentencing of whether a defendant came from an unfairly disadvantaged background or committed prior offenses. Selected Publications: 2023. “Mass Incarceration as Distributive Injustice,” in The Palgrave Handbook on the Philosophy of Punishment, ed. Matthew C. Altman (Cham, Switzerland: Palgrave Macmillan) (forthcoming) 2022. “Do Unjust States Have the Standing to Blame? Three Reservations About Scepticism,” Oxford Journal of Legal Studies (forthcoming) 2021. “Criminal Responsibility and Fair Moral Opportunity,” Criminal Law and Philosophy (forthcoming) 2019. “Mitigating Factors: A Typology,” in The Palgrave Handbook of Applied Ethics and the Criminal Law, ed. Larry Alexander and Kimberly Kessler Ferzan, 423-42 (Cham, Switzerland: Palgrave Macmillan) 2019. “Prior Convictions as Moral Opportunities,” American Journal of Criminal Law 46(2): 283-332 2018. “Recent Work on Punishment and Criminogenic Disadvantage,” Law and Philosophy 37(1): 29-68 2017. “Conventionality, Disagreement, and Fidelity,” Canadian Journal of Law and Jurisprudence 30(1): 97-123 2015. “The Structure of Tort Law, Revisited: The Problem of Corporate Responsibility,” Journal of Tort Law 8(1-2): 1-28 (reviewed in Gregory Keating, “Are Corporations Responsible Agents?,” Jotwell) 2015. “The Political Legitimacy of Retribution: Two Reasons for Skepticism,” Law and Philosophy 34(4): 369-96 2011. “Prods and Pleas: Limited Government in an Era of Unlimited Harm,” Yale Law Journal 121(2): 350-424 (with Douglas A. Kysar) Assistant Professor AB (Brown) JD (Yale) PhD (Princeton) Room 523, Mackintosh-Corry 613-533-6000 ext. 74255 benjamin.ewing@queensu.ca SSRN Teaching and Research Topics Criminal Law Criminal Procedure Legal & Political Thought Philosophy of Law Sentencing Torts",
    "listed_research_areas":"Criminal Law; Criminal Procedure; Legal & Political Thought; Philosophy Of Law; Sentencing; Torts"
  },
  {
    "faculty":"queens",
    "name":"David Freedman",
    "title":"Associate Professor",
    "email":"david.freedman@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/david-freedman",
    "bio":"David Freedman is an Associate Professor at Queen’s Law. He earned his LLB at Osgoode before obtaining postgraduate degrees (MA, PhD) at Oxford and Cambridge, respectively. Professor Freedman has taught trusts, wills and estates, estate litigation, civil procedure, and trial advocacy, subjects about which he has published extensively. Professor Freedman maintains a practice with Wagner Sidlofsky LLP in Toronto. He practices in the areas in which his teaching and scholarship are concentrated—trusts and estates litigation, and disputes respecting capacity; complementary academic and practice work strengthens his areas of expertise and helps keep him current. Professor Freedman approaches teaching with a focus on foundational principles and skills so that students understand the content of the law and the manner in which it is applied in a real, contemporary context. Recent Accomplishments: Associate Dean, Graduate Studies & Research, Queen’s Law, 2016-17 Past director, Elder Law Clinic Certified Specialist in Estates & Trust Law, Law Society of Upper Canada. Professional Memberships: Law Society of Upper Canada Society of Trust and Estate Practitioners The Advocates Society The Frontenac Law Association Recreational blacksmith Recent publications: For a complete list of publications, please consult Professor Freedman’s website. Books: Oosterhoff on Wills and Succession, 8th edition (co-editor). Toronto: Carswell, 2017. Chapters: “Dependents’ Support” and “Substitute Decision-Making,” in Oosterhoff on Wills, 8th edition. Toronto: Carswell, 2017. “Administration of Trusts,” in The Law of Trusts: A Contextual Approach, 3rd edition. Mark R. Gillen, Faye Woodman (eds.). Toronto: Emond-Montgomery, 2015. Journals: “Probate Contests And The New Law Of Summary Judgment” (2014), 34 Estates, Trusts & Pensions Journal 199. “The ‘Opinion, Advice, and Direction’ of the Court: Principles, Procedures, and Judicial Blessings,” (2013), 32 Estates Trusts and Pensions Journal 41. “Disputes Amongst Multiple Trustees: What Rights Does A Minority Estate Trustee Have Against An Oppressive Majority?” (2012), 32 Estates Trusts and Pensions Journal 41 “Misfeasance, Nonfeasance and the Self-Interested Attorney,” (2011), 48 Osgoode Hall Law Journal 457 Presentations: “Drafting and Attacking Charging Clauses in a Will,” Law Society of Upper Canada, Annual Estates and Trusts Summit, 2016. “Accessorial Liability for Breach of Trust and Fiduciary Duty,” Law Society of Upper Canada, Annual Estates and Trusts Summit, 2015. “Trends in the Application of the Limitations Rules in Trusts & Estates Litigation,” 17th Annual Estates and Trusts Summit, Law Society of Upper Canada, 2014. “Why Passing of Accounts Matter,” Law Society of Upper Canada, 2014. “Variation of Trusts,” 16th Annual Estates and Trusts Summit, Law Society of Upper Canada, 2013. “Mediation of Estate Disputes,” Estates Planning Council, 2013. “Care of the Frail Elderly: Navigating the Maze,” Centre for Studies in Aging and Health, 2013. “Legal Issues Affecting Residents and Families of Residents in Long-Term Care,” Reach Canada, 2013. “Civil Law Seminar: Persons and Property from Cradle to Grave (and Beyond),” National Judicial Institute, 2013. 2nd Annual East Region Estates and Trusts Seminar (2013): “The Use of Insurance Trusts and other Family Trusts in Estates” “Review of Mutual and Mirror Wills” “Exculpatory Clauses” “Wills and Estates,” Civil Litigators Series, Law Society of Upper Canada, 2013. Associate Professor LLB (Osgoode) MA (Oxford) PhD (Cambridge) Room 517, 128 Union Street 613-533-6000 ext. 78528 david.freedman@queensu.ca Personal site SSRN Teaching and Research Topics Elder Law Estates Trusts and Fiduciary Law",
    "listed_research_areas":"Elder Law; Estates; Trusts And Fiduciary Law"
  },
  {
    "faculty":"queens",
    "name":"Colin Grey",
    "title":"Associate Professor",
    "email":"colin.grey@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/colin-grey",
    "bio":"Colin Grey joined the Faculty of Law at Queen’s University in 2019. Professor Grey teaches and writes about immigration law, refugee law, and administrative law. In the past he has taught courses in legal theory, international migration law, and an interdisciplinary methods course for doctoral students. At Queen’s he will be developing three online courses for the new Graduate Diploma in Immigration and Citizenship Law. Prior to joining Queen’s Law, Professor Grey taught for four years at the Université du Québec à Montréal and worked, also for four years, as legal counsel at the Immigration and Refugee Board of Canada. He clerked at the Ontario Court of Appeal. Professor Grey received his LLB from the University of Toronto Faculty of Law, where he graduated as Silver Medallist and was awarded the Dean’s Key. He received his LLM and JSD at New York University, where he was an Arthur T Vanderbilt Scholar. Professor Grey’s scholarship explores issues of public law theory in the domain of migration law and governance. His publications include Justice and Authority in Immigration Law (Hart Publishing, 2015), as well as articles in Philosophy & Social Criticism, the Canadian Journal of Law & Jurisprudence, and Legal Theory. He is co-editor, with Professor Sharry Aiken, of the only casebook on Canadian immigration and refugee law, as well as co-author with Professor Aiken, Donald Galloway, and Audrey Macklin of Migration Law in Canada, 2d ed (Kluwer Law International, International Encyclopedia of Laws, 2015). Recent Professional Achievements Co-editor of special issue of the Dalhousie Law Journal on Canadian Immigration Law, 2019 Lead organizer of the Conference of Canadian Immigration Law Scholars, 2018 Associate Professor JSD (NYU) LLM (NYU) LLB, (U of T) BA (Dartmouth) Sutherland 546 613-533-6000 ext. 74725 colin.grey@queensu.ca CV Teaching and Research Topics Immigration Law Legal & Political Thought",
    "listed_research_areas":"Immigration Law; Legal & Political Thought"
  },
  {
    "faculty":"queens",
    "name":"Gail Henderson",
    "title":"Associate Professor",
    "email":"gail.henderson@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/gail-henderson",
    "bio":"Professor Gail Henderson joined Queen's University Faculty of Law as assistant professor in July 2016. Her research interests include corporate law, corporate governance, corporate social responsibility, securities regulation and the regulation of financial institutions. Professor Henderson graduated from Osgoode Hall Law School as Gold Medalist in 2005, and served as law clerk to The Honourable Louise Charron of the Supreme Court of Canada. Prior to pursuing graduate studies at the University of Toronto, she practiced commercial litigation and environmental and municipal law at Osler, Hoskin & Harcourt LLP in Toronto. Her doctoral research focused on the role of corporate governance in encouraging greater corporate environmental responsibility. Professor Henderson has received funding for her research from the Ireland Canada University Foundation, the Social Sciences and Humanities Research Council, the Canadian Foundation for Governance Research and the Canadian Centre for Ethics & Corporate Policy. Prior to joining Queen's, Professor Henderson was Assistant Professor at the University of Alberta Faculty of Law. Ongoing research projects “This Little Piggy Went Banking: Examining Conflicts of Interest in Financial Literacy Education Materials”, funded by SSHRC Insight Development grant, awarded June 2017. For more information about the project, please see: https:\/\/finlitproject.org\/ Canadian Financial Diaries project. For more information, please see: https:\/\/financialdiariesca.wordpress.com\/. Recent Publications & Presentations Journal Articles and Book Chapters “Securities Regulators and Investor Education” in Stephanie Ben-Ishai, ed, Dangerous Opportunities (University of Toronto Press, 2021). Gail E Henderson, Pamela Beach and Andrew Coombs, “Financial Literacy Education in Ontario: An Exploratory Study of Elementary Teachers’ Perceptions, Attitudes, and Practices” (2021) 44:2 Canadian Journal of Education 308-336 (peer-reviewed, open access: 2.-4249-Henderson-et-al.-June-24_308-336.pdf (cje-rce.ca)). Kevin Akrong and Gail E Henderson, “COVID-19 and the Regulation of Alternative Financial Services”, (2021) 46 Queen’s Law Journal 357-372. Presentations With Katlin Abrahamson, “Informing the Debate on Lowering the Criminal Rate of Interest”, 6th Annual Canadian Commercial Law Symposium, online (Zoom), October 21, 2022. “The Regulatory Role of Financial Literacy Education”, University of Alberta, Edmonton, October 22, 2019. With Pamela Beach and Jen McConnel, “Examining Elementary Teachers’ Learning Experiences as They Use the Canadian Financial Literacy Database”, Canadian Society for the Study of Education annual conference, Vancouver, June 5, 2019. Associate Professor Hons. BA (Toronto) LLB (Osgoode Hall Law School) LLM, SJD (Toronto) 613-533-6000 ext. 75403 gail.henderson@queensu.ca SSRN CV October 2022.pdf ResearchGate Teaching and Research Topics Contracts Corporate Governance Corporate Law Financial Regulation Securities Regulation",
    "listed_research_areas":"Contracts; Corporate Governance; Corporate Law; Financial Regulation; Securities Regulation"
  },
  {
    "faculty":"queens",
    "name":"Ardi Imseis",
    "title":"Assistant Professor",
    "email":"a.imseis@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/ardi-imseis",
    "bio":"Ardi Imseis is interested in the intersection of power, politics, law, and justice, and the practical impact of those phenomena on international relations in general and on underrepresented peoples in particular. Professor Imseis is currently working on a book which critically examines the gulf between international law and United Nations action, using the question of Palestine as a case study. He joined the Queen’s Faculty of Law in 2018, following a 12-year career as a UN official in the Middle East, first with the United Nations Relief and Works Agency for Palestine Refugees in the Near East (UNRWA), and then with the United Nations High Commissioner for Refugees (UNHCR). Since leaving the UN, Imseis has continued to engage in high-level public advocacy on international law, peace and security, including a number of invited addresses to the UN Security Council. Between 2019-2021, Imseis was appointed by the United Nations High Commissioner for Human Rights to serve as a Member of the Group of Eminent International and Regional Experts, a commission of inquiry mandated by the UN Human Rights Council to investigate and report on violations of human rights and humanitarian law in the conflict in Yemen. He serves as the Academic Director of the International Law Programs that Queen's Law offers at the Bader International Study Centre, Herstmonceux Castle, East Sussex, United Kingdom. Professor Imseis’s scholarship has appeared in, inter alia, the American Journal of International Law, the Berkeley Journal of International Law, the Harvard International Law Journal, the Oxford Journal of Legal Studies, and the University of British Columbia Law Review. He is a member of the Advisory Board of the Third World Approaches to International Law Review. He is former Editor-in-Chief of the Palestine Yearbook of International Law (2008-2019), Visiting Research Scholar, Department of Law, American University in Cairo and Harlan Fiske Stone Scholar and Human Rights Fellow, Columbia Law School. Imseis is admitted to the practice of law in the province of Alberta. Between 2010 and 2011, he served as Senior Legal Counsel to the Honourable Catherine A. Fraser, Chief Justice of Alberta. Research Foci: Public international law; International humanitarian law; International human rights law; International refugee law; International criminal law; International legal history; Law and practice of the United Nations. Recent Professional Accomplishments Invited to address the United Nations Security Council on the Third Report of the Group of Eminent International and Regional Experts on Yemen, December 2020. See here for text. Invited to brief the European Parliament Subcommittee on Human Rights on accountability for war crimes and crimes against humanity in the situation in Yemen, December 2020 Member, Group of Eminent International and Regional Experts on Yemen, United Nations Human Rights Council (2019-2021) Invited by the European Council on Foreign Relations to brief British Members of Parliament and the Foreign and Commonwealth Office on recognition of states in international law, June 2018. Invited to address the United Nations Security Council on protection of civilians in armed conflict, May 2016. Invited to brief members of the French Sénat on the international law governing belligerent occupation, Palais du Luxembourg, Paris, France, December 2015. Selected Publications For a full list of Professor Imseis' publications, please consult his CV. Articles: \"On Membership of the United Nations and the State of Palestine: A Critical Account” (2021) 34:4 Leiden Journal of International Law. \"The United Nations Partition of Palestine Revisited: On the Origins of Palestine's International Legal Subalternity\" (2021) 57:1 Stanford Journal of International Law 1-54 \"State of Exception: Critical Reflections on the Amici Curiae Observations and Other Communications of States Parties to the Rome Statue in the Palestine Situation\" (2020) 18:4 Journal of International Criminal Justice 905-925. \"Negotiating the Illegal: On the United Nations and the Illegal Occupation of Palestine, 1967-2020\" (2020) 31:3 European Journal of International Law 1055-1085. This paper was the subject of a debate commissioned by the European Journal of International Law. See: Hughes, D. “Of Tactics, Illegal Occupation and the Boundaries of Legal Capability: A Reply to Ardi Imseis” (2020) 31:3 European Journal of International Law 1087-1103; and Imseis, A. “Of Straw Men, the United Nations and Illegal Occupation: A Rejoinder to David Hughes”, EJIL: Talk!, 18 February 2021. “Critical Reflections on the International Humanitarian Law Aspects of the ICJ Wall Advisory Opinion” (2005) 99:1 American Journal of International Law 102. “On the Fourth Geneva Convention and the Occupied Palestinian Territory” (2003) 44:1 Harvard International Law Journal 65. ‘Moderate’ Torture on Trial: Critical Reflections on the Israeli Supreme Court Judgment Concerning the Legality of General Security Service Interrogation Methods” (2001) 19:2 Berkeley Journal of International Law 328. “Law, Reality and the Oslo ‘Peace’ Process” (2000) 20:3 Oxford Journal of Legal Studies 469. (Extended review of From Occupation to Interim Accords: Israel and the Palestinian Territories (The Hague: Kluwer Law International, 1997). “Facts on the Ground: An Examination of Israeli Municipal Policy in East Jerusalem” (2000) 15:5 American University International Law Review 1039 Book Chapters: “Speaking Truth to Power: On Edward Said and the Palestinian Freedom Struggle\", in A. Iskandar & H. Rustom, eds., Edward Said: Emancipation and Representation (University of California Press, 2010). UN Publications: “Situation of Human Rights in Yemen including Violations and Abuses since September 2014, Report of the Group of International and Regional Experts on Yemen\", 10 September 2021, UN Doc. A\/HRC\/48\/20. \"Situation of human rights in Yemen, including violations and abuses since September 2014-Report of the Group of Eminent International and Regional Experts on Yemen\", 28 September 2020, UN Doc. A\/HRC\/45\/6 (Conference Room Paper, UN Doc. A\/HRC\/45\/CRP.7) PhD Thesis: Imseis, A. (2019). The United Nations and the Question of Palestine: A Study in International Legal Subalternity (Doctoral thesis) Opinion, Editorial and Media Interviews: “Russia Invades Ukraine – and violates international law”, Queen’s Law Faculty Insight, 24 February 2022. UN News: UN Catch Up – Dateline Geneva, Climate Warning, Afghanistan, Burundi, Yemen (from 4:31 min mark), 16 September 2021. “Story in Focus: Interview with Ms. Melissa Parke and Mr. Ardi Imseis, Members of the Group of Eminent International and Regional Experts on Yemen”, Global Rights Compliance, January 2021, available at: https:\/\/starvationaccountability.org\/news-and-events\/story-in-focus-interview-with-ms-melissa-parke-member-of-the-group-of-eminent-international-and-regional-experts-on-yemen. \"Quick Thoughts: Ardi Imseis on the ICC and Palestine”, Jadaliyya, 22 February 2021, available at: https:\/\/www.jadaliyya.com\/Details\/42409\/Quick-Thoughts-Ardi-Imseis-on-the-ICC-and-Palestine. \"UNRWA in a Time of Crisis: Seperating the Red Herrings from Legitimate Shortcomings\", Al-Shabaka, 8 October 2019, available at: https:\/\/al-shabaka.org\/commentaries\/unrwa-in-a-time-of-crisis-separating-the-red-herrings-from-legitimate-shortcomings\/ “Security Council Resolution 2334: An Old-New Approach to Palestine at the United Nations?”, Jadaliyya, 26 December 2016, available at: http:\/\/www.jadaliyya.com\/pages\/index\/25756\/security-council-resolution-2334_an-old-new-approa “Trudeau and Israel\/Palestine: Paragon of Progressives or Much Ado About Nothing?”, Embassy, 6 April 2016, available at: http:\/\/www.embassynews.ca\/opinion\/2016\/04\/06\/trudeau-and-israel\/palestine-paragon-of-progressives-or-much-ado-about-nothing\/48462 “Remembering the 2014 Gaza Conflict: One Year On” (Text of 20 July 2015 Address to the United Nations Security Council), Cambridge Review of International Affairs Views, 22 September 2015, available at: http:\/\/www.cria.polis.cam.ac.uk\/blog\/?p=404 “Palestine and the ICC: Why International Law Matters in the Middle East, Cambridge Review of International Affairs Views, 6 April 2015, available at: http:\/\/www.cria.polis.cam.ac.uk\/blog\/?p=277; republished by Al-Ahram Online, 16 April 2015, available at: http:\/\/english.ahram.org.eg\/NewsContentP\/4\/127852\/Opinion\/Palestine-and-the-ICC-Why-International-Law-Matter.aspx “Quebec Judge’s Ban on Hijab in Courtroom a Judicial Fiasco”, Law Times, 30 March 2015, available at: http:\/\/www.lawtimesnews.com\/201503304570\/commentary\/speaker-s-corner. Assistant Professor BA (Hons) (Toronto) LLB (Dalhousie) LLM (Columbia) PhD (Cambridge) Room 524, 128 Union Street 613-533-6000 a.imseis@queensu.ca Ardi Imseis CV Teaching and Research Topics Human Rights Law Immigration Law International Criminal Law International Law Legal & Political Thought",
    "listed_research_areas":"Human Rights Law; Immigration Law; International Criminal Law; International Law; Legal & Political Thought"
  },
  {
    "faculty":"queens",
    "name":"Joshua Karton",
    "title":"Associate Professor",
    "email":"joshua.karton@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/joshua-karton",
    "bio":"On leave in 2022-23 Joshua Karton teaches and writes about international dispute resolution (especially international commercial arbitration), international and comparative contract law, transnational legal theory, globalization and law, and linguistic issues in law. His writing explores what happens when private actors from different backgrounds—legal, cultural, and linguistic—meet in the international legal arena. Professor Karton has taught at Queen’s Law since 2009, and was until recently the Associate Dean for Graduate Studies and Research. He holds a BA from Yale, a JD from Columbia, a PhD from Cambridge, and a “Qualified Arbitrator” designation from the ADR Institute of Canada. Before commencing his academic career, he practiced in litigation and arbitration at Cleary Gottlieb Steen & Hamilton LLP in New York. In 2022-23, he is the Tsai Wan-Tsai Visiting Chair Professor of International Law at the National Taiwan University College of Law. He has also held visiting positions at the Chinese University of Hong Kong, Wuhan University, the University of Nagoya, and San Francisco de Quito University in Ecuador. Professor Karton is an internationally recognized expert on international dispute resolution especially international arbitration. He has written or edited four books and dozens of articles in his fields of interest, and has received wide recognition for his research, including most recently as an elected member of the International Academy of Comparative Law. Much of Professor Karton’s research is interdisciplinary, influenced in particular by sociological theories and methods. His sociology of the international arbitration field, The Culture of International Arbitration and the Evolution of Contract Law, was published in 2013 to great acclaim in the academic and practitioner press. Currently, he is a co-lead investigator on the largest-ever empirical study of international commercial arbitration practice, The Social and Psychological Underpinnings of Commercial Arbitration in Europe, funded by the UK Economic and Social Research Council. His most recent book, a co-edited volume, is Diversity in International Arbitration: Why it Matters and How to Sustain It. Professor Karton co-founded and remains the Managing Editor of the Canadian Journal of Commercial Arbitration, is a Book Review Editor of the American Journal of Comparative Law, a General Editor of Kluwer Arbitration Practical Insights (a leading online research guide for international arbitration practitioners), and sits on the editorial advisory committees of several other journals and blogs. He was formerly a member of the Executive Committee of the American Society of Comparative Law, and Chair of its Younger Comparativists Committee. Aside from his scholarly activities, Professor Karton practices as an independent arbitrator and legal consultant. He is deeply involved in professional organizations in the arbitration and comparative law fields, especially in training and capacity-building programs. He is a Vice Chair of the Institute for Transnational Arbitration's Academic Council, a member of the core faculty of the Toronto Commercial Arbitration Society's “Gold Standard” course in arbitration, an instructor and advisory board member of the Africa Arbitration Academy, and a member of the board of directors of the Vis East Foundation, the non-profit that operates the Willem C. Vis International Commercial Arbitration Moot East in Hong Kong. A winner of Queen’s Law Student Society Award for Teaching Excellence, Professor Karton is passionately dedicated to teaching. He is particularly proud of his involvement with the Vis Moot, at which he has coached four different universities to prize-winning results. A proficient speaker of French and Chinese, he is a member of the New York bar and his application to the Law Society of Ontario is pending. Research: Research Foci: International Arbitration Contract Law Transnational Commercial Law Globalization and Law International Legal Theory Teaching Subjects: International Commercial Arbitration Contracts Commercial Law Legal Research Methods and Perspectives Comparative Contract Law Selected Recent Professional Achievements: Delivered the keynote address at the Chartered Institute of Arbitrators (Canadian Branch) 2022 Annual Conference, entitled “Everyone Agrees that Arbitration Agreements are Contracts, but No One Does Anything About It” Named Tsai Wan-tsai Visiting Chair Professor of Law, National Taiwan University Designated a “Qualified Arbitrator” by the ADR Institute of Canada Selected to author two entries in the forthcoming 2nd Edition of the Elgar Encyclopedia of International Economic Law Elected to the Board of Directors of the Vis Moot East Foundation Elected as an Associate Member of the International Academy of Comparative Law Presented “International Commercial Arbitration as Comparative Law in Action” at the Opening Plenary of the American Society of Comparative Law 2019 Annual Meeting Selected Recent Publications: For a full list of publications, please consult Professor Karton's CV. “Diversity in Four Dimensions” in Shahla Ali, Filip Balcerzak, Giorgio Colombo & Joshua Karton, eds, Sustainable Diversity in International Arbitration (Edward Elgar, 2022) “Multi-Tier Dispute Resolution Agreements in Canada: Drafting, Enforcing, and Escaping” (2022) 3:1 Canadian Journal of Commercial Arbitration __ “The (Astonishingly) Rapid Turn to Remote Hearings in Commercial Arbitration” (2021) 46 Queen’s Law Journal 399-414 “International Arbitration as Comparative Law in Action” [2020], 2 Journal of Dispute Resolution 293-326 “Sectoral Fragmentation in Transnational Contract Law” (2019) 21:1 University of Pennsylvania Journal of Business Law 142-199 “The Structure of International Arbitration Law and the Exercise of Arbitral Authority” (2015) 8:2 Contemporary Asia Arbitration Journal 229-312 “The Arbitral Role in Contractual Interpretation” (2015) 6:1 Journal of international Dispute Settlement 1-38 Awarded the 2015 JIDS James Crawford Prize for best article of the year Associate Professor BA (Yale) JD (Columbia) PhD (Cambridge) Room 506, 128 Union Street 613-533-6000 ext. 79062 joshua.karton@queensu.ca SSRN CV Teaching and Research Topics Arbitration International Economic Law International Law International Trade Law Torts",
    "listed_research_areas":"Arbitration; International Economic Law; International Law; International Trade Law; Torts"
  },
  {
    "faculty":"queens",
    "name":"Lisa Kelly",
    "title":"Assistant Professor",
    "email":"lisa.kelly@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/lisa-kelly",
    "bio":"Lisa M. Kelly is an Assistant Professor at Queen’s University, Faculty of Law, where she teaches criminal law and evidence. She studied history and political science at the University of British Columbia (B.A) and is a graduate of the University of Toronto, Faculty of Law (J.D.) and Harvard Law School (S.J.D.), where she was a Trudeau Scholar. Kelly’s doctoral dissertation – Governing the Child: Parental Authority, State Power, and the School in North America – analyzed legal struggles over race and school discipline from the late-nineteenth century through the present. Before joining Queen’s, she held a postdoctoral fellowship at Columbia Law School and the Center for Reproductive Rights in New York City. She previously served as a law clerk to Justice Marshall E. Rothstein of the Supreme Court of Canada. Kelly has been a Fulbright Scholar, a Frank Knox Memorial Fellow, and a Fellow of the Institute for Global Law and Policy at Harvard Law School. In 2018, she received the Stanley M. Corbett Award for Teaching Excellence. Research Kelly’s research lies at the intersection of criminal law and family law, with a focus on the historical and contemporary legal regulation of sex, reproduction, and family life. She is specifically interested in the ways in which competing ideological conceptions of childhood, race, and sexuality influence the work of legal actors and shape our laws and institutions. Current projects include: Social and legal constructions of abortion travel Legal history of corporal punishment and the political economy of childhood Shifting boundaries in the disciplinary authority of public schools over students Professor Kelly is currently leading a SSHRC-funded project on police powers in Canadian schools. Selected Publications For a full list of Professor Kelly's publications, please consult her CV. \"Pandemic Schooling and the Politics of Safety” (with Deniz Kilinc, Sonia Lawrence & Cosimo Morin), (2021) 46 Queen’s Law Journal 343. “Confronting Cannibalism” (with Shelby Percival), Review Essay on Hadley Friedland, The Wetiko Principles: Cree and Anishinabek Responses to Violence and Victimization (Univ. Toronto Press, 2018) (2020) 33 Can. J. Family Law 359 “A Tale of Two Cameras: Sex and Surveillance in R. v. Jarvis” (2019) 52 Criminal Reports 126. “Contesting Criminal Law: Honouring the Work of Professor Don Stuart” (Introduction to Special Issue), (2019) 44 Queen’s Law Journal i. “Abortion Travel and the Limits of Choice” (2016) 12 FIU Law Review 27. “The Work of Ideology in Canadian Legal Thought” (2016) 74 Supreme Court Law Review 27. “Reckoning with Narratives of Innocent Suffering in Transnational Abortion Litigation,” in Rebecca Cook, Joanna Erdman, and Bernard Dickens, eds., Abortion Law in Transnational Perspective: Cases and Controversies (Philadelphia: University of Pennsylvania Press, 2014), 303-326. Assistant Professor BA (British Columbia) JD (University of Toronto) SJD (Harvard) Room C517, Mackintosh-Corry Hall 613-533-6000 x78531 lisa.kelly@queensu.ca Academia.edu Lisa Kelly CV",
    "listed_research_areas":null
  },
  {
    "faculty":"queens",
    "name":"Lisa Kerr",
    "title":"Associate Professor",
    "email":"lisa.kerr@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/lisa-kerr",
    "bio":"Lisa Kerr teaches courses on criminal law, evidence, sentencing and prison law and she serves as the Director of the Criminal Law Group at Queen's Law. Professor Kerr earned her JD at the University of British Columbia. She clerked with the BC Court of Appeal and was an associate at Fasken Martineau. She also served as staff lawyer at Prisoners’ Legal Services, Canada’s only dedicated legal aid office for prisoners. Professor Kerr earned an LLM and JSD at New York University, where she was named a Trudeau Scholar. Professor Kerr's research focuses on the law and policy of sentencing and prisons. Along with her academic publications, Professor Kerr regularly participates in judicial education and publishes opinion pieces in these areas. In 2017, she spoke with Michael Enright at The Sunday Edition about the central ideas animating much of her scholarship, namely the relationship between sentencing authorities and prison conditions. Professor Kerr provides pro bono consultation on litigation matters in sentencing and prison law, and she supports the strategic litigation work of the Queen's Prison Law Clinic. For several years, she worked with Pivot Legal Society on a campaign to decriminalize sex work. She also served on the Board of the B.C. Civil Liberties Association, where she supported work with the John Howard Society of Canada to abolish solitary confinement in Canadian prisons. Recent Publications Articles “Dignity Cannot Be Totally Denied: The Limits of Bissonnette” (2022) 81 Criminal Reports (7th), 330–342 “The Pains of Imprisonment in a Pandemic” (2021) 46 Queen’s Law Journal 2, 327–342 (with Kristy-Ann Dubé) \"Adjudicating the Risks of Confinement: Bail and Sentencing During COVID-19\" (2020) 64 Criminal Reports (7th), 311–333 (with Kristy-Ann Dubé) “Methods and Severity: The Two Tracks of Section 12” (2020) 94 S.C.L.R. (2d) 235 (co-authored with Benjamin Berger) “The End Stage of Solitary Confinement” (2019) 55 Criminal Reports (7th) 382. \"How the Prison is a Black Box in Punishment Theory\" (2019) University of Toronto Law Journal Vol. 69, Issue 1, 85-116 \"Sentencing Ashley Smith: How Prison Conditions Relate to the Aims of Punishment\" (2017) Canadian Journal of Law and Society Vol. 32, No. 2, 187–207 “The Legitimate Scope of Criminal Law: A Question for Legal History?” (2017) Critical Analysis of Law, Vol. 4, No. 1, 11–21 \"'They Want In': Sex Workers and Legitimacy Debates In the Law of Public Interest Standing\" (2017) 80 Supreme Court Law Review (2d) 145–175 “Judging a Joint Submission: Comparing the US and Canada on the Judicial Role in Plea Bargaining” (2017) 32 Criminal Reports (7th), 22–30 “The Right to Maximum Prisoner Liberty?” (2016) 26 Criminal Reports 7th, 245–250 “Easy Prisoner Cases” (2015) 71 Supreme Court Law Review (2d) 235-262 \"The Chronic Failure to Control Prisoner Isolation in US and Canadian Law” (2015) Queen's Law Journal, Vol. 40, No. 2, 483–530 “The Origins of Unlawful Prison Policies” (2015) Canadian Journal of Human Rights, Vol. 4, No. 1, 91-119 “Contesting Expertise in Prison Law” (2014) McGill Law Journal Vol. 60, No. 1, 43-94 Book Reviews and Review Essays “How to End Mass Imprisonment: the Legal and Cultural Strategies of Bryan Stevenson”(2017) University of Toronto Law Journal Vol. 67, 104-123 “Choice Talk” review of Sister Wives, Surrogates and Sex Workers: Outlaws by Choice? by Angela Campbell (Ashgate Publishing, 2013) in (2017) Canadian Journal of Women and the Law Vol. 28, No. 3 Review of Appealing to Justice: Prisoner Grievances, Rights and Carceral Logic by Kitty Calavita and Valerie Jenness (University of California Press, 2014) in British Journal of Criminology (2017) Book Chapters “How Sentencing Reform Movements Impact Women” in Julian Roberts and David Cole, eds, Sentencing in Canada: Essays in Law, Policy and Practice (Irwin Law Publishers, 2020). \"Making Prisoner Rights Real: the Case of Mothers\" in Sharon Dolovich and Alexandra Natapoff, eds, The New Criminal Justice Thinking (NYU Press, 2017) Editorials Saskatchewan stabbings: Why Myles Sanderson was granted statutory release from prison (The Conversation, September 2022) A return by Poilievre to Harper-era criminal sentences would be a terrible sequel (The Globe and Mail, Dec 2022) The Supreme Court’s ruling to end the death-in-prison penalty isn’t about the offender – it’s about our own moral code (Globe & Mail, May 27 2022) What Erin O’Toole is really saying when he says criminals shouldn’t get early access to vaccines (The Globe & Mail, 2021) Why Does the Indigenous Rate of Incarceration Only Grow? (Globe & Mail, January 2020) How can prisoners be rehabilitated without proper access to education? (with Paul Quick) (The Globe & Mail, January 2020) What happened to the Liberal promise of criminal justice reform? (with Anthony Doob) (The Ottawa Citizen, January 2020) Did the truck driver in the Humboldt crash deserve his sentence? (Globe and Mail, March 2019) Capay’s stay is one more unacceptable consequence of solitary confinement (The Globe & Mail, January 31, 2019) If Implemented Properly, new bill may end solitary confinement in Canada (The Globe & Mail, October 18, 2018) Yes, Law Schools Must Be Political (with Lisa Kelly) (The Globe & Mail, March 31, 2018) BC Solitary Ruling: A Bold Move that May Finally Bring Change (Globe & Mail, January 18 2018) Ontario solitary confinement ruling hardly counts as a victory (Globe & Mail, December 19 2017) Does the Law Apply when an Inmate Breaks Prison Rules? (Ottawa Citizen, December 11 2017) Solitary confinement: Bill C-56 not enough to eliminate risk of abuse (The Lawyer's Daily, July 12 2017) Solitary bill a first step, but doesn't go far enough (Globe & Mail, June 20 2017) Solitary confinement: Why is Ontario willing to do what Ottawa won’t? (Globe & Mail, May 8 2017) Why Rules on Solitary Confinement must be Written in Law (Globe & Mail, May 2 2016) Fewer inmates in solitary makes the case for reform (Globe & Mail, February 9 2016) The Conservative Take on Crime Policy (with Anthony N. Doob) (The Ottawa Citizen, August 20 2015) Court's use of remains did not respect Cindy Gladue's dignity (Toronto Star, April 6 2015) Solitary Confinement on Trial (The National Post, January 26 2015) Canada's law-and-order agenda weighs heavily on Aboriginal people (Toronto Star, March 12 2013) Mandatory Minimums for Drug Crimes have no Future in Canada (Toronto Star, June 3 2014) Associate Professor BA (Simon Fraser) JD (British Columbia) LLM, JSD (NYU) Room 542, Robert Sutherland Hall 613-533-6000 ext. 77603 lisa.kerr@queensu.ca Academia.edu SSRN Twitter Teaching and Research Topics Criminal Law Prison Law Punishment Theory Sentencing",
    "listed_research_areas":"Criminal Law; Prison Law; Punishment Theory; Sentencing"
  },
  {
    "faculty":"queens",
    "name":"Mohamed Khimji",
    "title":"Associate Dean (Academic Policy), David Allgood Professor in Business Law",
    "email":"mohamed.khimji@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/mohamed-khimji",
    "bio":"Mohamed Khimji is currently serving as the Associate Dean (Academic Policy). As the chief academic policy officer for the JD (including embedded programs such as ILS, the BISC and QLC programs), and the Certificate in Law programs, he provides strategic academic leadership to support the development and achievement of the Faculty’s academic goals and objectives. He is also the inaugural holder of the David Allgood Professorship in Business Law and the Director of the Queen’s Business Law Program. His research interests lie in the areas of corporate law, commercial transactions, and intermediated securities. He has acted as a consultant on issues in these areas to private law firms and government and regulatory agencies in Canada, the United States, and the United Kingdom. Prior to joining Queen’s University in 2016, he was the holder of the Stephen Dattels Chair in Corporate Finance Law at Western University. He has also held a faculty position at the Schulich School of Law at Dalhousie University and visiting appointments at the Faculty of Law, University of Valencia, Yale Law School, and Lincoln Alexander School of Law. Before beginning his academic career, he practiced corporate law in the Toronto office of Torys LLP. Associate Dean (Academic Policy), David Allgood Professor in Business Law LLB (Bristol) LLM (LSE) Room 520, 128 Union Street 613-533-6000 x74282 mohamed.khimji@queensu.ca CV Teaching and Research Topics Corporate Governance Corporate Law Mergers & Acquisitions Secured Transactions Shareholder Activism Offices, Clinics and Programs Administration Directory Teams and Committees Leadership Team",
    "listed_research_areas":"Corporate Governance; Corporate Law; Mergers & Acquisitions; Secured Transactions; Shareholder Activism"
  },
  {
    "faculty":"queens",
    "name":"Alyssa King",
    "title":"Assistant Professor",
    "email":"alyssa.king@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/alyssa-king",
    "bio":"Alyssa King studies how adjudicators define their own roles and sources of legitimacy as well as issues of access to justice. She is particularly interested in the intersection of normative systems through mechanisms such as federalism, arbitration, and the reception of international law. She comes to Queen’s from Yale Law School, where she is a PhD candidate and an Affiliate Fellow with the school’s Information Society Project. She received her JD from Yale Law School in 2012, and was an executive editor of the Yale Journal of International Law and a senior editor of the Yale Law Journal. She also holds a bachelor’s degree from Harvard University and a Master 2 from the École des Hautes Études en Sciences Sociales. A member of the New York Bar, she previously clerked for Judge Barrington D. Parker of the Second Circuit Court of Appeals and Judge Nicholas G. Garaufis of the Eastern District of New York. Recently, Alyssa King has been keeping track of COVID-19 related procedural changes to court and ADR procedures, click here, to learn more. Research: Courts Arbitration Collective Litigation Representative publications: For a full list of Professor King's publications, please consult her CV. Arbitrating Federalism, 93 IND. L. J. (forthcoming 2018) Too Much Power and Not Enough: Arbitrators Face the Class Dilemma, 21 LEWIS & CLARK L. REV. 1031 (2018) New Judicial Review in Old Europe, 44 GA. J. OF INT’L & COMP. L. 1 (2015) Assistant Professor AB (Harvard) Master 2 (EHESS) JD, PhD (Yale) Room 527, Mackintosh-Corry 613-533-6000 x74248 alyssa.king@queensu.ca SSRN CV Twitter Teaching and Research Topics Contracts International Law",
    "listed_research_areas":"Contracts; International Law"
  },
  {
    "faculty":"queens",
    "name":"Erik Knutsen",
    "title":"Professor",
    "email":"knutsen@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/erik-knutsen",
    "bio":"Erik S. Knutsen's areas of academic interest include insurance law, tort, accident law, medical malpractice, civil procedure and the civil litigation system. He is a co-author of Canadian Tort Law, one of the leading Canadian tort treatises, and also co-author of Stempel and Knutsen on Insurance Coverage, one of the leading American insurance law treatises. He has also co-authored the leading casebook on Canadian civil litigation, The Civil Litigation Process, and one of the core casebooks on American insurance law, Principles of Insurance Law. His articles have appeared in top-ranked Canadian, American, and international journals. His work has been cited by Canadian, American, and European appellate and trial courts. He has presented his work at academic and professional venues in Canada, the United States, the United Kingdom, and China. He has presented his work on costs at Oxford University, and has given the Canadian Studies Visiting Lecture at Fudan University School of Law in Shanghai, China. He also has been involved with judicial education at programs provided by the National Judicial Institute. He is frequently contacted by national and international media. Professor Knutsen was awarded the Queen’s University Chancellor Charles H. Baillie university-wide teaching award in 2018. He had also three times earned the faculty teaching award at Queens Faculty of Law. He was previously a Visiting Assistant Professor at Florida State University College of Law, where he also earned a teaching award. He served as Associate Dean (Academic) at the Faculty of Law from 2018 to 2020. Professor Knutsen is an elected member of the American Law Institute, a Fellow of the European Law Institute, and an Honorary Fellow of the American College of Coverage Counsel. He has practiced tort and insurance litigation in New York at Paul, Weiss LLP where he assisted with 9\/11 World Trade Center cases, in Toronto at Fasken Martineau LLP and in Thunder Bay at Carrel + Partners LLP. He is a member of the bar of Ontario, Canada. Professor Knutsen regularly consults with lawyers on cases heading to trial or appeal, including cases at the Supreme Court of Canada, American courts, and other courts and tribunals around the world. Research: Insurance law Torts Accident law Civil litigation and civil procedure Medical malpractice Recent Professional Achievements: Elected member of the American Law Institute, Fellow of the European Law Institute and Honorary Fellow of the American College of Coverage Counsel Awarded Queen’s University Chancellor Charles H. Baillie university-wide teaching award in 2018 Awarded federal SSHRC Insight Grant for project “Floods, Fires, Crashes: Resolving Post-Disaster Insurance Coverage Conflicts in Canada,” 2015-2019 Awarded Queen’s Law Teaching Award in 2014, 2010, and 2007 Recent Publications: For a complete list of publications, please consult Professor Knutsen's CV. Books Co-author with the late Allen Linden, Bruce Feldthusen, Margaret Hall and Hilary Houng, Canadian Tort Law, 11th ed. (LexisNexis: 2018). Jeffrey W. Stempel and Erik S. Knutsen, Stempel & Knutsen on Insurance Coverage, 4th ed. (WoltersKluewer: looseleaf) (2 volume, 3,006 page treatise on American insurance law). Co-author with Jeffrey Stempel and the late Peter N. Swisher, Principles of Insurance Law, 5th ed. (Carolina Academic Press: 2020) (American casebook). Co-author of Janet Walker et al, The Civil Litigation Process: Cases and Materials, 8th ed. (Emond Montgomery: 2015) (Canadian civil procedure casebook). Articles \"The COVID-19 Pandemic and Insurance Coverage for Business Interruption in Canada\" (2021) ____ Queen's LJ ____ (forthcoming). with Jeffrey W. Stempel, \"Rejecting Word Worship: An Integrative Approach to Judicial Construction of Insurance Policies\" (2021) ___ U Cincinnati L Rev ___ (forthcoming). with Jeffrey W. Stempel, \"Infected Judgment: Problematic Rush to Conventional Wisdom and Insurance Coverage Denial in a Pandemic\" (2021) 27 Connecticut Insurance LJ 247. [SSRN] with Jeffrey W. Stempel, \"Protecting Auto Accident Victims from the Insurer Identity Crisis\" (2019) 26 Connecticut Insurance LJ 1. [SSRN] with Jeffrey W. Stempel, \"The Techno-Neutrality Solution to Navigating Insurance Coverage for Cyber Losses\" (2018) 122 Penn State L Rev 645. [SSRN] \"The Medical Malpractice Landscape in Ontario: Facts, Trends and Analysis of Trials and Appeals,” (2017) 47 Advocates Q 131-164. [SSRN] \"Patchwork Contextualism in the Anglo-Canadian Law of Insurance Policy Interpretation: Implications for the Principles of the Law of Liability Insurance,” (2015) 68 Rutgers U L Rev 415-453. [SSRN] “Fortuity Victims and the Compensation Gap: Re-envisioning Liability Insurance Coverage for Intentional and Criminal Conduct,” (2014) 21 Connecticut Insurance Law LJ 209-253.[SSRN] “Causation in Canadian Insurance Law,” (2013) 50 Alberta L Rev 631-658. (28 pages) [SSRN] “Auto Insurance as Social Contract: Solving Automobile Insurance Coverage Disputes Through a Public Regulatory Framework,” (2011) 48 Alberta Law Rev 715. [SSRN] \"Fortuity Clauses in Liability Insurance: Solving Coverage Dilemmas for Intentional and Criminal Conduct\" (2011) 36 Queen's LJ 73. [SSRN] “Confusion About Causation in Insurance: Solutions for Catastrophic Losses,” (2010) 61 Alabama L Rev 957. [SSRN] \"Keeping Settlements Secret\" (2010) 37 Florida State U L Rev 945. [SSRN] \"The Cost of Costs: The Unfortunate Deterrence of Everyday Civil Litigation in Canada\" (2010) 36 Queen's LJ 113. [SSRN] \"Clarifying Causation in Tort\" (2010) 33 Dalhousie LJ 153. [SSRN] Professor BA (Hons) (Lakehead) JD (Osgoode) LLM (Harvard) Room C522, Mackintosh-Corry Hall 613-533-6000 ext.78360 knutsen@queensu.ca SSRN CV Teaching and Research Topics Civil Procedure Health Law Insurance Law Torts",
    "listed_research_areas":"Civil Procedure; Health Law; Insurance Law; Torts"
  },
  {
    "faculty":"queens",
    "name":"Will Kymlicka",
    "title":null,
    "email":null,
    "href":"https:\/\/law.queensu.ca\/directory\/will-kymlicka-professor-of-philosophy-canada-research-chair-in-philosophy-cross-appointed-to-faculty-of-law",
    "bio":"Research Interests Issues of democracy and diversity, in particular models of citizenship and social justice within multicultural societies, and animal rights. Brief Biography Will Kymlicka is the Canada Research Chair in Political Philosophy at Queen’s University, where he has taught since 1998. He has published eight books and over 200 articles, which have been translated into 32 languages, and has received several awards. His books include Contemporary Political Philosophy(1990; second edition 2002), Multicultural Citizenship (1995), which was awarded the Macpherson Prize by the Canadian Political Science Association, and the Bunche Award by the American Political Science Association, Multicultural Odysseys: Navigating the New International Politics of Diversity (2007), which was awarded the North American Society for Social Philosophy’s 2007 Book Award, and most recently Zoopolis: A Political Theory of Animal Rights (2011), co-authored with Sue Donaldson.",
    "listed_research_areas":null
  },
  {
    "faculty":"queens",
    "name":"Kathleen Lahey",
    "title":"Professor, Queen's National Scholar, and Patricia Monture Distinguished University Professor",
    "email":"kal2@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/kathleen-lahey",
    "bio":"Kathleen Lahey is Professor and Queen's National Scholar, Faculty of Law, Queen's University, Co-director, Feminist Legal Studies Queen’s, cross-appointed to Queen’s Gender Studies, and affiliated faculty, Queen's Cultural Studies Interdisciplinary Graduate Program. She is a member of the Ontario and Illinois bars, Associate member, Garden Court Chambers, UK, sits on the boards of the UK-based Tax Justice Network and the steering committee of its global parent, the Global Alliance for Tax Justice, and specializes in tax, corporate, gender, international tax, property, and human rights law. Her current research revolves around three core questions: Until substantive equality of outcomes for all individuals can be attained, how can societies eliminate deeply- rooted structural inequalities and discriminatory practices? How can the power and wealth concentrated in global 'north' corporations and individuals through unequal property, political, tax, and budget laws be replaced with redistributive programs that maintain individual sustain\/abilities throughout life? And, what truths arise from Indigenous and diverse peoples' living knowledges and learnings about how to match rates of human innovation and development with the evolutionary rates of other members of the biosphere in order to increase the sustain\/abilities of all forms of life? She has pursued these questions while on numerous government commissions, while meeting with and advising governments, civil society, academic groups in Canada, across China and on every continent, as well as when working with the European Parliament, EU governments, the UN and other treaty bodies, international financial institutions, and with Indigenous, circumpolar Arctic, human rights, and diverse peoples' organizations, watching and learning how to expand current research and dissemination methods capable of addressing these increasingly urgent issues. Current Research Arctic\/Northern and Indigenous Women: Situating Circumpolar Law and Justice in Substantive Equalities and Sustain\/abilities, Kathleen Lahey (in progress), dedicated to engaging the work of Dr. Patricia A. Monture (1958-2010), Queen’s JD1988, Hon. LL.D. (Athabaska 2008 and Queen’s 2009), a proud Haudenosaunee seeker and teacher of living truths among the realities of truth-fragmenting colonial laws \"Gender Inequality and Canadian Fiscal Policy,\" in Who Pays for Canada? Taxes and Fairness, eds. Elsbeth Heaman and David Tough, McGill-Queen's University Press, in publication, ch. 11 \"Women and the Economy: Gender Inequalities in the Tax System,\" in Unfinished Business: A Parallel Report [to the UN] on Canada’s Implementation of the Beijing Declaration and Platform, Canadian Centre for Policy Alternatives, Beijing +25 Review Network, Oct. 28, 2019, 51-54 “Using Human Rights to Combat Gender Inequalities, Poverty, and Income Inequalities in Fiscal Laws,” in Tax, Inequality, and Human Rights, eds. Philip Alston and Nikki Reich, Oxford Univ. Press, Oct. 2019, ch. 19 Gender, Taxation, and Equality in Developing Countries: Issues and Policy Recommendations, United Nations Women, NYC, Dec. 2018, 1-84 Gender Budgeting in Viet Nam: Gender Equality in Transport, United Nations Women, NYC, with Vu Phuong Ly, UN Women AsiaPacific, and the Asia Development Bank, Nov. 2018 \"Feminist Judging for Substantive Gender Equality in Tax Law: Changing International and Comparative Constitutional Contexts,” in Feminist Judgments: Rewritten Tax Opinions, eds. Brigitte J. Crawford and Anthony C. Infanti, Cambridge Univ. Press, 2017, ch. 2, 22-52 Teaching Subjects Gender Equality Law (all areas) Law and Sexualities\/Identities Corporate Law Property Law Fiscal Policy and Law Taxation Comparative\/International Tax Law Feminist Legal Studies Graduate Students Mary Eaton, LLM 1991, Theorizing Sexual Orientation Sharon McIvor, LLM 1995, Aboriginal Self-Government: The Civil and Political Rights of Women Teressa Nahanee, LLM 1995, Gorilla in our Midst: Aboriginal \/ Women and the Inhumanity of the Canadian Criminal Justice System Andrea Timoll, LLM 1996, The Erasure of Women of Colour from Canadian Jurisprudence Emily Grabham, LLM 2000, Substantive Equality: A Comparative Analysis of UK, EC, and Canadian Law Margaret Denike, LLM 2006, Sovereignty's Vengeance: Victims, Villains, and Saviours in the 'War on Terror' Lisa Kayaga, LLM 2007, Tax Policy Challenges Facing Developing Countries: A Case Study of Uganda Efua Opoku, LLM 2011, Human Rights Violations under the Guise of Counter-Terrorism Measures: Reconciling International Security and the Protection of the Fundamental Right to Life Kuukuwa Andam, PhD expected 2020, Flowers without Fences: Female Sexual Minorities and Technology in Ghana Graduate Committees Wendy Straker, LLM 1993, Issues in International Taxation: A Developing Country Perspective Ruth Phegan, LLM 1994, The Family Mediation System: An Art of Distributions Ruth Glenn, LLM 1995, Assessing the Potential and Limitatins of Canadian Pay Equity Reform as a Future Strategy for Women in Northern Ireland Ellen Faulkner, PhD, Sociology and Equity Studies in Education, University of Toronto, 1999, A Case Study of the Institutional Response to Anti-Gay\/Lesbian Violence in Toronto Nathanial Lewis, PhD, Social and Health Geography, Queens's University, 2011, Moving 'Out,' Moving On: Gay Men's Migrations through the Life Course Muhammad Abbas, PhD 2016, International Tax Equity: Distributive Justice concerns of International Tax Allocations between Countries Stephanie Simpson, LLM 2019, Giving Shape to Silences: Exploring the Impact of Section 15(1) and Human Rights Jurisprudence in achieving Racial Justice, 2009-2018 Professional Recognition and Accomplishments \"Joint and Family Tax\/Benefit Laws vs Fiscal Individualization in the EU: Gender equality policies and fiscal impact evidence,\" brief filed at request of European Parliament to secure adoption of European Parliament resolution of 15 January 2019 on gender equality and taxation policies in the EU calling for repeal of joint fiscal laws (2019) Core faculty, Concordia University, First International Graduate Summer School on The Theory and Practice of Gender Mainstreaming, (2019). Academic expert, United Nations CEDAW Committee (Geneva), briefings on International tax avoidance and Gender Equality Rights under the Convention (2017-) Academic trainer, Sustainable transport, Asia Development Bank and Vietnam Ministry of Transport, Hanoi, (2017-2018) Academic expert, Critical review and training re Gender budgeting and impact analysis, Federal\/Provincial-Territorial Ministers for the Status of Women, (2015-) Board of Directors and Senior Advisor, Tax Justice Network, UK (2016-) Academic expert, Tax and Redistribution Policy, UN Women, Timor-Leste, Dili (2016-) Academic expert, Taxation and Gender, Ministry of Finance and UN, Hanoi (2016-) Visiting Professor in Fiscal Policy, Forum on Law and Society, funded by Umeå University, Sweden (2013) Founding member, Tromsø-Umeå-Arkhangelsk-Kingston Arctic Circumpolar Network on Gender and Law, since inception (2011-) Gender Budget Auditor, Adequacy of Government's Gender-based Analysis, Budgets 2005 and 2006, House of Commons, Standing Committee on the Status of Women Canada (2006) Fiscal Policy Gender Advisor, House of Commons, Standing Committee on the Status of Women Canada (2005-2010) Co-convenor, International Socio-legal Feminisms, Law and Society Association Collaborative Research Network (no. 38) [CRN38], (2009-) and International Research Collaboration (no. 19) [IRC 19] (2011-) Hero Award, Ontario Bar Association Sexual Orientation and Gender Identity Committee (2009) Co-Founder and Co-Director, Feminist Legal Studies Queen’s, with Professor Bita Amani, (2008-) Queen's Law Students' Society Teaching Award, Queen's University (1998) Kathleen A. Lahey Feminist Legal Lecture Series Trust, established by Sen. Nancy Ruth and the University of Windsor Faculty of Law Women and Law Committee of Trustees, University of Windsor Faculty of Law (1998-) Visiting Scholar, Harvard University International Tax Program (1986-87) Founding editor, Canadian Journal of Women and the Law\/Revue juridique\"La femme et le droit\" (1984-) Visiting Lecturer, Monash University Faculty of Law (1980-81) Legal Counsel, on behalf of B.C. Couples, Same-Sex Marriage Reference (SCC 2004) Legal Counsel, on behalf of B.,C. Couples, Barbeau v. BC (AG) and Canada (AG) (BCCA 2003) Member, Law Commission of Canada, Advisory Board on Adult Relationships (1999-2002) Member, Ontario Fair Tax Commission, Working Group on Corporate Taxation (1991-2002) Legal Counsel, on behalf of Metis National Council of Women, Intervenors, Lovelace v. Canada (AG) (SCC 1999) Member, Ontario Fair Tax Commission, Working Group on Corporate Taxation (1999-2002) Member, Ontario Fair Tax Commission, Working Group on the Taxation of Women (1991-2002) Member, Ontario Advisory Council on the Status of Women (1988-1991) Member of Litigation Group, Tomen v. Federation of Women Teachers' Associations of Ontario, first sex equality case litigated under the Canadian Charter of Rights and Freedoms, s. 15, with Mary Eberts, Florence Henderson, Catherine A. MacKinnon, Sheila McIntyre, Elizabeth Shilton, 1985-1989, documenting crucial role of substantive equality in all contexts, Div. Ct. through Ont. Court of Appeal Member of Audit Group, Taxation and Gender Audit, Report on the Statute Audit Project, Charter of Rights Educational Fund (CREF), Toronto, 1983-1986, ch. I, 1-30. Recent Research Books The Alberta Disadvantage: Gender, Taxation and Inequality (Edmonton AB: Parkland Institute, University of Alberta), 1-102. Editor, Women and Fiscal Equality \/ Les femmes et l'égalité fiscale. Special issue, Canadian Journal of Women and the Law \/ Revue Femmes et Droit (22)1: 1-326 (2010) Same-sex Marriage: The Personal and the Political (Toronto: Insomniac Press, 2011) (with Kevin Alderson), 1-381 Are We Persons Yet? Law and Sexuality in Canada (Toronto: University of Toronto Press, 1999), 1-474 [short-listed for Walter Owen Book Prize] The Case for Women's Equality: The Federation of Women Teachers' Associations of Ontario and the Canadian Charter of Rights and Freedoms. (Toronto, Ontario: Federation of Women Teachers' Associations of Ontario, 1996), 1-676 (with Mary Eberts, Florence Henderson, Catherine A. MacKinnon, Sheila McIntyre, and Elizabeth J. Shilton). The Taxation of Women in Canada (Kingston, Ont.: Faculty of Law, Queen's University, 1988), 1-575 Corporate Taxation (Toronto: Emond-Montgomery, 1984), i-lx, 1-540. Funded Research Monographs Timor-Leste Proposed Tax Reforms: Gender and Poverty Impact, Income Tax, and VAT Options and Recommendations (Dili, TL: UN Women Timor-Leste, 2018), 1-84 Equal Worth: Designing Effective Pay Equity Laws for Alberta (Edmonton: University of Alberta Parkland Institute, 2016), 1-45 Gender Equality and Taxation in Vietnam (Hanoi: UN Women, 2016), 1-84 (with Professor Pham Thu Hien) Canada’s Gendered Budget 2012: Impact of Bills C-38 and C-45 on Women (Kingston: FLSQ Working Paper, 2012), 1-207 Women and Employment: Removing Fiscal Barriers to Women's Labour Force Participation (Ottawa: Status of Women Canada Policy Research Trust, 2005), 1-95; Les femmes et l'emploi : Abolir les entraves fiscales à leur participation au march du travail (Ottawa : Fonds de recherche en matière de politiques de Condition féminine Canada, 2005), 1-110 The Impact of Relationship Recognition on Lesbian Women in Canada: Still Separate and Only Somewhat 'Equivalent' (Ottawa: Status of Women Canada, 2001), 1-128; L'effect de la reconnaissance des unions sur les lesbiennes au Canada : encore distinctes et presque «équivalentes» (Ottawa: Recherche en matière de politiques de Condition féminine Canada, 2001), 1-144 Division of Powers and Jurisdictional Issues Relating to Marriage. Ottawa: Law Reform Commission of Canada, 2000), 1-102 (with John Fisher, Laurie Arron, and Equality for Gays and Lesbians Everywhere--EGALE); Le partage des pouvoirs et l' analyse des compétences enmatière de mariage (Ottawa : Commission du droit du Canada, 2000), 1-109 The Benefit\/Penalty Unit in Income Tax Policy: Diversity and Reform (Ottawa: Law Commission of Canada, 2000), 1-155; La politique fiscale et l’unité d’imposition : Diversité et réforme (Ottawa : Commission du droit du Canada, 2000), 1-183 Articles and Chapters in Books 'Tax Units in Canada and Gender: Ability to Pay, Equity, or Keeping Women in their Place?' in Income Tax at 100 Years: Reflections on the Income War Tax Act, eds. Jinyan Li, Brian Wilkie, and Larry Chapman (Toronto: Canadian Tax Foundation, 2017) ‘The Politics of Income Splitting, Sex Equality, and Sex Role Stereotypes in Comparative Perspectives,’ in Caring for Children: Social Movements and Public Policy in Canada, eds. Rachel Langford, Susan Prentice, and Patrizia Albanese (Vancouver: Univ. of British Columbia Press, 2017) 37-72 “Uncovering Women in Taxation: The Gender Impact of Detaxation, Tax Expenditures, and Joint Tax\/Benefit Units: 52: 2 (2015) Osgoode Hall Law Journal 429-461 “Women and Taxation” in Dan Hind, ed., The Greatest Invention: Tax and the Campaign for a Just Society (Oxford: Tax Justice Network, 2015) ‘Gender Challenges and Human Capital in the North,” Arctic Yearbook 2014, 1-42 ‘Economic Crisis, Gender Equality, and Policy Responses in Spain and Canada,’ Feminist Economics 19(3): 1-36 (2013) (with Professor Paloma de Villota) ‘At the Intersection of Global Economic Crisis and State Anti-feminism: Women in Canada, 2008-2009, Investigaciones Feministas \/ Feminist Research 2(1): 55-70 (2011) ‘The \"Capture\" of Women in Law and Fiscal Policy: Implications for the Tax\/Benefit Unit and Gender Equality,' In Challenging Gender Inequality in Tax Policy Making: Comparative Perspectives, eds. Kim Brooks, et al. (London: Hart Publishing, 2011) 1-28 ‘International Transactions, Taxation, and Women: The Critical Role of Gender Analysis,’ University of British Columbia Law Journal 42(2): 363-417 (2010) ‘Women, Substantive Equality, and Fiscal Policy: Gender-based Analysis of Taxes, Benefits, and Budgets,’ Canadian Journal of Women and the Law 22(1): 29-108 (2010) ‘Same-sex Marriage, Transnational Activism, and International Law: Strategic Objectives Beyond Freedom to Marry,' American Society of International Law Annual Proceedings 2010:6 ‘Missing Women: Gender Impact Analysis and International Taxation,’ in Globalization and Its Tax Discontents: Tax Policy and International Investments, ed. Art Cockfield (Toronto: University of Toronto Press, 2010) 153-17 Engendering Changes in Unpaid work in Canada,’ FedCan ‘Equity Matters,’ Malinda S. Smith (Apr. 15 2010) What about Women? New Brunswick and Fiscal Policy (Fredericton: NB Advisory Council on the Status of Women, 2008): I: 1-45; II: 1-10: Tax Women Fairly - Or at Least ‘Do No Harm'; III: 1-13: Gender Impact Analysis of Alternative Tax Reform Measures for New Brunswick Conferences Organized Feminist Legal Studies Queen's, Gender, Equalities, Knowledges, Lands, and Sustain\/abilities: Truths vs 'Climate Adaptations' for Life, (Mar. 6-7, 2020), with Professor Bita Amani Feminist Legal Studies Queen's, Gender, Intersectionalities, and Sustainable Development: Food Security, Economic Equality, and Women's Empowerment (Mar. 8-9, 2019), with Professor Bita Amani Feminist Legal Studies Queen's, (Re)Production: Inequalities of Gender, Racialization, and Class, (May 3-4, 2018), led by Professor Bita Amani Feminist Legal Studies Queen's, Gender-based Analysis and Gender Budgeting for Equality, Inclusion, Development, and Democracy, (Mar. 10-11, 2017), with Professor Bita Amani Feminist Legal Studies Queen's, Gender, Wellbeing, and the Politics of Imagination: Law, Culture, Compassion (Feb. 26-27, 2016), led by Professor Bita Amani Feminist Legal Studies Queen's, Women and Tax Justice at Beijing+20: Taxing and Budgeting for Sex Equality, (2015), with Professor Bita Amani Feminist Legal Studies Queen's, Arctic\/Northern Women: Situating Law and Justice in Development and Equality: In celebration of Dr. Patricia A. Monture (1958-2010), (2014), with Professor Bita Amani International FemLaw, Law and Society Association [CRN38], Hawaii (June 5-8, 2012) International FemTax, Law and Society Association [ IRC19], Hawaii ( June 4, 2012) Feminist Legal Studies Queen’s, Women and Equality: Gender-based Analysis, Law, and Economic Rights (2010), with Professor Bita Amani Feminist Legal Studies Queen’s, Women and Fiscal Equality (2009), with Professor Bita Amani Faculty of Law, University of Windsor, Feminism, Critical Theory, and the Canadian Legal System (June5-10,1988), with Professor Bill Conklin, co‐sponsored by the Canadian Sociology and Anthropology Association Invited Advisory Briefs and Conference Papers State Responsibility for the Impact of Domestic and Extraterritorial Tax Abuse on Women: United Kingdom of Great Britain and Northern Ireland, Submission to the Committee on the Elimination of Discrimination against Women, 72nd Session, Geneva, pertaining to the Eighth periodic report submitted by United Kingdom of Great Britain and Northern Ireland, with Liz Nelson, Andres Knobel, Tax Justice Network, 2019 'When Most of the Poor are Women and Most of the Rich are Men: Using Human Rights Laws to counter Abuse of Fiscal Policies and Promote Economic Equality,' Institute of Advanced Legal Studies, King's College London, 2019 'Consumption vs Progressive Taxes and \"Ability to Pay\" -- Gender, Poverty, Basic Needs, and Sustainable Development,' IMF\/World Bank, Civil Society Policy Forum Annual Spring Meetings, Washington, DC, 2019 ‘Gender Equality, Taxation, and Developing Countries: Issues affecting Rural Women,’ sponsored by Coalition for Tax Justice, Tax Justice Network, and Feminist Legal Studies Queen's, UN Commission on the Status of Women, International Women's Day Conference, NYC, 2018 ‘Who Pays for Canada? Gender Inequality and Tax\/Transfer Policies,’ MISC 2018 Conference, McGill University, Montreal, 2018 'Tax Justice, Gender Equality, and the Banality of Evil: Recovering Public Revenues from Fiscal 'Black Holes,' King's Transnational Law Summit: The New Human Condition: Creating Justice for Our Future, King's College London, 2018 'Gender, Race, Indigenous Peoples, and Tax\/Revenue Laws: Poverty, Equality, and Development Issues,’ (Re)Production: Inequalities of Gender, Racialization, and Class Feminist Legal Studies, Queen's International Women's Day Conference, Kingston, 2018 'Gender, Taxation, and Equality in Developing Countries: Key Issues and Solutions,' Latindadd, FES, and Tax Justice Network Conference: Paradise Lost? Inequality and Tax Justice, Lima, 2018 'From Taxing for Growth and Tax Competition to Taxing for Sex Equality,' Law and Society Association Conference [CRN38], 2018 'Gender-Based Analysis and Gender Budgeting: History, Purposes, Methods, and Outcomes,' Ontario Public Service Gender-Based Analysis Engagement, Chestnut Conference Centre, Toronto, 2018 'Gender Budgeting and GBA in Canada and Internationally: History, Purposes, Methods, and Outcomes,' GBA+: Developing Expertise for Gender-Based Analysis Plus, Conference, Infonex, Ottawa, 2018 ‘Gender Equality, Human Rights, and Financial Transparency: Women, Developing Countries, and Corporations in Transnational Narratives,’ Financial Transparency Conference, Financial Transparency Coalition, Helsinki, 2017 ‘Financing for Development and Taxing for Sex Equality: Finding the Gender Impact of Domestic and Transnational tax laws,’ Tax Justice Network, Financial Transparency Coalition, ActionAid, Women's Working Group on Financing for Development, Christian Aid, and Government of Ecuador, United Nations, Financing for Development Forum, United Nations NYC, 2017 ‘Taxing for Sex Equality: How Domestic Tax Policies increase Women's Economic Inequality,’ Tax Justice for Women's Rights, Tax Justice Network and Global Alliance for Tax Justice, UN Commission on the Status of Women International Women's Day Conference, New York, 2017 ‘Resource Development and Revenue Issues and Policies: Gender Impacts and Policy Options,’ Women’s Rights and Tax Justice Convening, FES, Global Alliance for Tax Justice, Tax Justice Network, and PSI, Bogata, 2017 ‘Discriminatory Tax Regimes and Gender Equality: International, Regional, and National Dimensions,’ Women’s Rights and Tax Justice Convening, FES, Global Alliance for tax Justice, Tax Justice Network, and PSI, Bogata, 2017 ‘Transforming Taxation to achieve Gender Equality by 2030,’United Nations AsiaPacific Region and Ministries of Finance, Bangkok, 2016 ‘Tax Justice and Tax Theory: Designing and Evaluating Gender-Equal Tax Systems,’ Symposium, St. Antony’s College, University of Oxford, 2016 ‘Gender Responsive Budgeting: Taxation and Fiscal Policies,’ Three-day training for Vietnam National Institute of Finance, Ministry of Finance Vietnam, Embassy of Canada, and UN Women, Hanoi, 2016 ‘Fiscal Reform Options for Timor-Leste: Gender and Poverty Implications,’ Rede Feto and UN Women, Dili, Timor-Leste, 2016 ‘Women, Taxation, Equality, and the Transnational,’ International Sociolegal Feminisms Panel [CRN38] and Gender, Development, and Fiscal\/Economic Policy [IRC19], Law and Society Association Conference, New Orleans, 2016 ‘Gender and Taxation in the EU – From Taxing for Growth to Taxing for Sex Equality,’ European Parliament Greens\/EFA Conference, Brussels, 2016 ‘Economic Gender Equality in Canada: Market, Care, Tax, and Benefit Issues and Solutions,’ Training session, Federal-Provincial-Territorial Ministers Responsible for the Status of Women, Edmonton, Alberta, 2016. ‘Human Rights, Gender Equality, Poverty, and Taxation,’ NYU Law School Human Rights Clinic Conference, New York, 2016 ‘Using Human Rights Laws to combat Gender Inequalities, Poverty, and Income Inequalities in Fiscal Laws,’ Closed roundtable, NYU Law School Human Rights Clinic, New York, 2016 ‘Gender, Anti-Corruption, and Tax Administration in Africa,’ International Centre for Tax and Development Conference 'Gender and Tax in Africa,' Accra, Ghana, 2016 ‘Gender Budgeting in the AsiaPacific Region: Opportunities and Challenges,’ National Institute of Financial Management, Government of India, and UN Women, Jaipur, India, 2016 ‘Achieving Economic Security for Women in Alberta: The Role of Taxes, Expenditures, and Policy Development,’ Gender and Economic Security in Alberta, Interdisciplinary Symposium, Congress, University of Calgary, 2016 ‘Gender Justice and Tax Justice,’ International Strategy Meeting of the Center for Economic and Social Rights, Lima, 2015 ‘Gender Equality, “Taxing for Growth,” and Income Inequalities,’ Funding Democracy Summit, Public Service Association of Canada, Ottawa, 2015 ‘Tax\/Transfer Policy and Sex Equality: What Australia, Canada, and the UK should Learn from Experience,’ Workshop, Tax\/Transfer Policy Institute and the Gender Institute, Australian National University, Canberra, 2015 ‘Taxing for Equality: Uncovering the Gender Impact of Tax and Benefit Policies,’ Meeting convened by Ministry of Finance, Thailand, and UN Women, Bangkok, Thailand, 2015 ‘Taxing for Gender Equality: Gender Impact of Fiscal Policies at Macro, Meso, and Micro Levels,’ Macroeconomic Expert Roundtable, UN Women East and Southern Africa Region, Nairobi, Kenya, 2015 ‘The [UN CEDAW Platform for Action] PfA calls for Taking Back the Budget and Taxing for Equality – Not for Detaxation and \"Tax Cuts or Growth\", Roundtable, Institutional Mechanisms for the Advancement of Women, NGO Forum Beijing+20, UN ECE Regional Review, Geneva, 2014 ‘Gender Equality and Taxation: Key Fiscal Issues in Financing for Development,’ Closed UNWomen Expert Gender Meeting, London, UK, 2014 ‘Sex Equality and Off-Budget Governance: Detaxation, Tax Expenditures, and Joint Taxation,’ International Socio-legal Feminisms [CRN38], Law and Society Conference, Boston, 2013 ‘Critical Tax Policy: Uncovering Women in Fiscal Policy,’ Osgoode Hall Law School, Tax Policy for a Better Tomorrow, Workshop in honour of Neil Brooks, Toronto, 2013 ‘Challenges in the Arctic: A Gender Perspective,’ Arctic Council, Kiruna, 2013 ‘Comparative Studies on Gender Equality in the Arctic Region,’ Tromsø-Umeå-Arkhangelsk-Kingston Network on Gender and Law Conference, Gender and Arctic Directions, Umeå, 2013 ‘Detaxation, Demodernization, and Inequality: Gender Impacts,’ NordTax Workshop, Forum for Studies on Law and Society, Umeå University, Umeå, 2013 ‘Designed to Fail: Aboriginal Governance, Federal Funding, and Attawapiskat,’ Feminist Legal Studies Queen’s Conference, Bodies of Law: Women’s Health and Equality, Kingston, 2013 ‘Women and Equality in 21st century Canada,’ Women’s Forum des Femmes, Government Conference Centre, Ottawa, 2012 ‘Women in the Arctic Region: Key Economic, Governance, and Budgetary Issues, International Arctic Feminist Workshop, Northern, Arctic) Federal University, Arkhangelsk, Jun. 26 2012 ‘Taxation, Fiscal Fictions, and Male “Capture” of Wealth, International Socio-legal Feminisms, International Law and Society Conference, Honolulu, Jun. 7 2012 ‘Identifying the Gender Impact of Tax, Benefit, and Fiscal Policies, International Sociolegal Feminisms Preconference Workshop, International Law and Society Conference, Honolulu, Jun. 4 2012 ‘Sex, Money, and Gender Budgeting for Justice and Equality,’ Association for Women’s Rights in Development [AWID] Conference, Transforming Economic Power, Istanbul, Apr. 19 2012 ‘Tax Fairness, Inequality, and the Political Economy of Women,’ Canadians for Tax Fairness Conference, Fair Tax Summit, Ottawa, Mar. 30 2012 ‘Financing for Gender Equality: Taxes, Budgeting, and Recessions in Comparative Context,’ United Nations, Committee on the Status of Women, 56th Session, NGO Conference, NY, Mar. 6 2012 ‘”Going for Growth” and “Tackling Inequality” – Why Gender Equality always Matters,’ Feminist Legal Studies Queen’s Conference, CEDAW and Moving Forward, Kingston, Mar. 2 2012 ‘Globalizing Fiscal Policy and Disappearing Equality: Economic Crises, Taxes, and Spending,’ International Socio-legal Feminisms, Law and Society Conference, San Francisco, June 11 2011 ‘Taxation, Budgeting, and Canadian Social Security Structures,’ University of Tromsø Faculty of Law, Workshop on Gender and Law, Tromsø, May 2011 ‘Gender Equality, Taxation, and Crisis Policies: The Difference Politics can Make,’ Universidad Complutense, Applied Economics, Workshop on Fiscal Gender Analysis, Madrid, May 2011 ‘Gender Impact of Canada’s Crisis and Recovery Policies,’ Feminist Alliance for International Action [FAFIA], Annual Meeting, Ottawa, Feb. 2011 ‘Gender, Economic Crisis, and Fiscal Policy: Canada and Spain, 2008-2011.’ Association of Feminist Economists, Annual Conference, University of Buenos Aires, Faculty of Economics, Argentina, Jul. 2010 ‘A Latchkey of her Own: Women and Economic Equality.’ International Feminist Conference, Challenging Inequality, Barbados, Jun. 2010 ‘CEDAW, Gender-based Analysis, and Sex Equality in Canada, 2010.’ University of Windsor Faculty of Law, Kathleen Lahey Annual Lecture Series, Windsor, Feb. 2010 ‘Sex, Gender, and Equality in 2010: Canada’s Role in the World,’ House of Commons, Symposium on Women and Equality, Ottawa, Jan. 2010 ‘Sex, Gender, Sexuality, Race, and Equality: Losing Ground in Canada,’ Memorial University Women’s Studies, Annual Speaker Series, St. John’s Nfl, Jan. 2010 ‘”Sexism in the Treasury” – Gender-Based Analysis, Tax Expenditures, and the Joint Tax\/Benefit Unit,’ Osgoode Hall Law School Conference, Tax Expenditures, Toronto, Sept. 9, 2009 ‘Sexuality, Gender, and Marriage: The Tax on Queer Marriage,’ 2nd World OutGames, International Human Rights Conference, Copenhagen, Jul. 28, 2009 ‘Women in Law and Fiscal Policy.’ International Institute for the Sociology of Law, Challenging Gender Inequality in Tax Policy Conference, Oñati, May 14, 2009 ‘How the Tax System affects Women’s Access to Paid Work,’ Adva Center, Women's Budget Forum, Tel Aviv, Nov. 2008 ‘Making Tax Reforms Work for Women,’ International Development Research Centre, International Women’s Day Program, Ottawa, Mar. 2008 ‘Tax Policies and Women in Canada's Modern Economy,' United Nations, Committee on the Status of Women, 52th Session, NGO Conference, NY, Mar. 2008 Selected Briefs Requested by Parliament of Canada Standing Committees ‘Gender Impact of Canadian Controlled Private Corporation Tax Planning Strategies and Assessment of Proposed Legislative Amendments’ (House, Finance, 2017) ‘Gender and Economic Equality: A Matter of Human Rights’ (Senate, Human Rights, 2016) ‘Budget 2015 Priorities: Women’s Economic Equality’ (House, Finance, 2015) ‘Income Inequalities in Canada: Fiscal and Gender Dimensions’ (House, Finance, 2013) ‘Improving Economic Prospects for Canadian Girls’ (House, Status of Women, 2012) ‘”Shared Prosperity and a High Standard of Living for All” must Include all Women Equally' (House, Finance, 2011) ‘Cancellation of the 2011 Mandatory Long Form Census and Unpaid Work Questions: Impact on Women’s Equality in Canada’ (House, Status of Women, 2010) ‘Budget 2010: Still Leaving Women Behind’ (House, Finance, 2010) ‘The “Male Breadwinner” Model of Unemployment Insurance: Gender Analysis of Regular Benefits’ (House, Status of Women, 2009) ‘Canada’s Budgets 2006-2009: Designed to Leave Women Behind’ (House, Status of Women, 2009) ‘Critique of the Department of Finance \"Gender Analysis of Tax Measures in Budgets 2006 and 2007\"' (House, Status of Women, 2008 ‘Gender Analysis of ‘Tax-free Savings' and Income Splitting with TFSAs' (House, Finance, 2008) ‘Where are the Women? Gender Analysis of Direct Expenditures, Tax Revenues, and Tax Expenditures in Budget 2008' (House, Status of Women, 2008 ‘The Gender Budget: Gender-based Analysis of Revenues and Expenditures' (House, Status of Women, 2007) Research Funding Current Social Sciences and Humanities Research Council grant funding (2015 through 2024): $708,994: Insight Grant, \"Canada’s Fiscal Regime Changes, 1995-2015: Comparative perspectives on gender gaps and income inequalities, ‘tax cuts for growth,’ and ‘taxing for equality’\": $189,740, 2015-2020 Partnership Engage Grant, with Oxfam Canada, \"Economic Gender Equality, Childcare, and Pay Equity in Canada: Making the case for public policies that can matter\": $25,000, 2019-2020 Partnership Development Grant, with Inter Pares, Global Alliance for Tax Justice Africa, GATJ Gender and Taxation Working Group, and Tax Justice Network, \"Taxing for Gender and Economic Equality in Ghana: Mobilizing fiscal policy impact analysis and recommendations for reform\": $197,750, 2019-2023 Insight Grant, \"From 'Tax Cuts for Growth' to 'Gender Equality for Growth': Comparative perspectives on the crucial role of 'taxing for gender equality' in fiscal governance\": $211,504, 2019-2024 Partnership Grant, Stage 1, \"What is the Best Policy Mix for Diverse Canadian Families with Young Children? Reimagining childcare, parental leave, and employment policies\": $75,000, 2019, for use in preparing application invited into Stage 2 competition, seeking potential $3 million over five years for international research consortium; K. Lahey to co-lead three components of Stage 2 project if successful (SSHRC decision due Jan. 17, 2020). SSHRC QROF grant, \"The Impact of Tax and Expenditures Laws in Developing and Developed Countries: Expanding the use of tax-transfer microsimulation to assess poverty, distributional, and gender effects on fiscal policies,\" $10,000, 2019-2020 Social Sciences and Humanities Research Council grant funding (1986 through 2015):$625,300 Total SSHRC funding (1986 through Dec. 15, 2019): $1,334,294 Other Canadian or overseas public agency grants and funding for research project costs (eg, Law Commission of Canada, Law Foundation of Ontario, Status of Women Canada Policy Research Trust Fund, CREF, international research bodies, 1983 through 2015): $201,000 Total all SSHRC plus public funding (1983-Dec. 15, 2019): $1,535,294 International funding agency consortium and collaboration grant applications drafted and funded as at Dec. 15, 2019 (but not spendable via Queen's due to status of Canada in these funding programs): EU Horizon2020 grant, \"FairTax\": Euro2.04 million (Can$3 million), 2015-2019. Marianne and Marcus Wallenberg Foundation, ReTax - Rethinking tax neutrality – a multiple gender critique of fiscal structures and processes\": SEK 6,500,000 (Can$900,000), 2016-2020 Professor, Queen's National Scholar, and Patricia Monture Distinguished University Professor BA (Illinois) JD cum laude (DePaul) LLM (York) 613-533-6000, ext. 74277 kal2@queensu.ca Teaching and Research Topics Taxation\/Corporate Taxation\/Tax Policy\/Comparative Taxation\/Property Law\/Law, Gender, and Equality\/Law and Sexualities\/Feminist Legal Studies",
    "listed_research_areas":"Taxation; Corporate Taxation; Tax Policy; Comparative Taxation; Property Law; Law, Gender, And Equality; Law And Sexualities; Feminist Legal Studies"
  },
  {
    "faculty":"queens",
    "name":"Nicolas Lamp",
    "title":"Associate Professor",
    "email":"nicolas.lamp@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/nicolas-lamp",
    "bio":"Nicolas Lamp joined the Faculty of Law at Queen’s University as an Assistant Professor in 2014. In 2020, he was cross-appointed to the Queen’s School of Policy Studies. He also serves as the Academic Director of the International Law Programs, an eight-week summer course that Queen’s Law offers at the Bader International Study Centre at Herstmonceux castle in England during the summer term. Since 2019, he has also been the Director of the Annual Queen’s Institute on Trade Policy, a professional training course for Canadian trade officials that is hosted by the Queen’s School of Policy Studies. Prior to joining Queen’s, Assistant Professor Lamp worked as a Dispute Settlement Lawyer at the Appellate Body Secretariat of the World Trade Organization, where he advised the Members of the Appellate Body on legal issues arising in appellate proceedings under the WTO’s dispute settlement mechanism. His teaching subjects include Contracts, International Trade Law, the International Trade Law Practicum, and Public International Law. Assistant Professor Lamp received his PhD in Law from the London School of Economics and Political Science in 2013. His doctoral thesis on “Lawmaking in the Multilateral Trading System” investigates the origins and implications of the discourses, practices and techniques that shape international lawmaking in the trade context. His current research focuses on competing narratives about the winners and losers from economic globalization. His co-authored book (with Anthea Roberts) on “Six Faces of Globalization: Who Wins, Who Loses, and Why It Matters” is forthcoming with Harvard University Press in September 2021. Research: International Trade Law International lawmaking processes, especially multilateral trade lawmaking Narratives about the distributive effects of economic globalization Achievements: Director, Annual Queen's Institute on Trade Policy, 2019-present Academic Director, International Law Programs, Bader International Study Centre, 2016-present Stanley M. Corbett Award for Teaching Excellence, 2016 Case Author, ELSA Moot Court Competition on WTO Law, 2014-15 Case Author, GIMC Moot Court Competition, 2017-2018 (moot problem) Winner, American Society of International Law's 2012 Francis Lieber Prize for outstanding scholarship in the field of the law of armed conflict, for the article \"Conceptions of War and Paradigms of Compliance: The 'New War' Challenge to International Humanitarian Law\" Selected Publications: For a complete list of publications, please consult Professor Lamp’s CV. Book: Six Faces of Globalization: Who Wins, Who Loses, and Why It Matters (with Anthea Roberts), Harvard University Press [Amazon] [Harvard University Press] Articles: How Should We Think about the Winners and Losers from Globalization? Three Narratives and Their Implications for the Redesign of International Economic Agreements, in: European Journal of International Law 30 (4), 2019, 1259-1397. [EJIL-freely accessible] At the Vanishing Point off Law; Rebalancing, Non-Violation Claims, and the Role of Multilateral Trade Regime in the Trade Wars, in: Journal of International Economic Law 22 (4), 2019, 721-742. [JIEL] [SSRN] \"The Receding Horizon of Informality in WTO Meetings\", in: Journal of the Royal Anthropological Institute 23 (1), 2017, 63-79. [JRAI] [SSRN] \"The 'Development' Discourse in Multilateral Trade Lawmaking\", in: World Trade Review 16 (3), 2017, 475-500. [WTR-freely accessible] “Value and Exchange in Multilateral Trade Lawmaking”, in: London Review of International Law 4 (1), 2016, 7-55. [LRIL] [SSRN] “The Club Approach to Multilateral Trade Lawmaking”, in: Vanderbilt Journal of Transnational Law 49 (1), 2016, 107-190. [published version available on SSRN] “How Some Countries Became 'Special': Developing Countries and the Construction of Difference in Multilateral Trade Lawmaking”, in: Journal of International Economic Law 18 (4), 2015, 743-771. [JIEL] [SSNR] “Conceptions of War and Paradigms of Compliance: The ‘New War’ Challenge to International Humanitarian Law”, in: Journal of Conflict and Security Law 16 (2), 2011, 225-262 [JCSL-freely accessible] Book Chapters: Strategies for Developing Countries in Multilateral Trade Negotiations at the World Trade Organization, in: Joost Pauwelyn and Mengyi Wang (eds.): Building Legal Capacity for a More Inclusive Globalization, Geneva: Centre for Trade and Economic Integration, 2019, 9-30. [book] Legislative Innovation in the Trade and Climate Regimes: Towards a Framework for the Comparative Analysis of Multilateral Lawmaking, in: Neil Craik et al. (eds.): Global Environmental Change and Innovation in International Law, Cambridge: Cambridge University Press, 270-295. [book] [SSRN] The ‘Practice Turn’ in International Law: Insights from the Theory of Structuration, in: Moshe Hirsch and Andrew Lang (eds.): Research Handbook on the Sociology of International Law, Edward Elgar, 273-295. [book] [SSRN] PhD Thesis: \"Lawmaking in the Multilateral Trading System\" (2013) Associate Professor BA (Dresden) MA (Jacobs) LLM, PhD (LSE) Room C517, Mackintosh-Corry Hall 613-533-6000 ext. 79118 nicolas.lamp@queensu.ca SSRN Twitter Teaching and Research Topics International Law International Trade Law",
    "listed_research_areas":"International Law; International Trade Law"
  },
  {
    "faculty":"queens",
    "name":"David Lyon",
    "title":"Director, Surveillance Studies Centre, Queen's Research Chair in Surveillance Studies, Professor of Sociology, Professor of Law",
    "email":"lyond@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/david-lyon",
    "bio":"Research Areas Surveillance and Social Sorting; Big Data Surveillance; Identification Regimes; Privacy; Information Technologies; Christian Social Critique David Lyon's research, writing, and teaching interests revolve around major social transformations in the modern world. Questions of the information society, globalization, secularization, surveillance, and debates over “post-” and “digital” modernity feature prominently in his work. Lyon was formerly an editor of Surveillance & Society and is Associate Editor of The Information Society. He also serves on the international editorial boards of several other journals. His books have been translated into seventeen languages: Arabic, Chinese, Czech, Danish, Dutch, Farsi, German, Hungarian, Italian, Japanese, Korean, Polish, Portuguese, Romanian, Spanish, Swedish and Turkish. Surveillance Surveillance Studies has been Lyon’s major research area for the past 25 years. He brings a sociological perspective to bear on the issues raised by personal data processing in a database-dependent world. His surveillance interests include border and airport controls, social media, organizational routines, video camera surveillance, citizen registration and identification systems and social media. His concerns include, prominently, the social sorting capacities of contemporary surveillance, along with an exploration of their ethics and politics. From the mid-1980s, Lyon's broad concerns prompted a critical examination of the much-hyped ‘microelectronics revolution’ that gave way to the so-called ‘information society.’ In the 1990s, Lyon focused his analyses on the social origins, incidence and consequences of processing personal data, arguing that surveillance has become a major dimension of modernity in its own right. This aspect of his research has expanded considerably, especially since 9\/11, and involves extensive collaboration with colleagues and students. Surveillance is a globalized phenomenon, and Lyon's work focuses increasingly on the global south and on encouraging the development of Surveillance Studies networks around the world. From 2008-2010 David Lyon was a Canada Council Killam Research Fellow, investigating the current rise of national ID card systems in a cross-national comparative perspective. The work complements some of his other studies of surveillance and contributes to both empirical and theoretical understanding of contemporary smart, biometrics-based ID systems. Currently, Lyon is working towards a book entitled Surveillance: A Very Short Introduction and another on surveillance critique, The Eye of God. David Lyon and Surveillance Secularization While he is best known for his work in Surveillance Studies, David Lyon’s research and writing span several other areas as well. Starting in Historical Sociology in the 1970s, his early work was on secularization processes – and the critique of some key theories -- in the modern world. Today, he tries to keep abreast of debates over the \"post-secular\" with an emphasis on the work of Charles Taylor. Following this, his main research directions explore other forms of social transformation that are both characteristic and constitutive of modernity. Research and Students As Director of the Surveillance Studies Centre, Lyon works with a multidisciplinary and international team on several related initiatives from primary research to theoretical development as well as associated media, policy and advocacy activities. The current team project is on “Big Data Surveillance” (2015-2020) and is funded by the SSHRC Partnership Grant program. It has streams on security, marketing and governance. This offers opportunities for a number of PhD students and postdoctoral fellows within Sociology. He continues to supervise and co-supervise PhDs. Recognition In 2020, Lyon received the Molson Prize, Canada Council for the Arts. In 2018, Lyon received the Surveillance Studies Network Outstanding Contribution Award. In 2017, Lyon received a Queen's University Award for Excellence in Graduate Supervision. In 2005, Lyon was awarded a Queen’s Research Chair in Surveillance Studies. In 2007 Lyon received a Lifetime Achievement Award from the American Sociological Association Communication and Information Technology Section and in 2008 he was elected Fellow of the Royal Society of Canada. In 2012 he received an Outstanding Achievement Award from the Canadian Sociological Association, in 2015 an Insight-Impact Award from the SSHRC and in 2016 an honorary doctorate from the Università della Svizzera Italiana in Switzerland. https:\/\/www.youtube.com\/watch?v=9IlkVONwSbQ Publications Surveillance Big Data Surveillance and Security Intelligence (edited with David Murakami Wood) UBC Press 2020. The Culture of Surveillance: Watching as a Way of Life (Polity 2018) Surveillance after Snowden (Polity 2015) Transparent Lives: Surveillance in Canada \/ Vivre à nu: la surveillance au Canada (Athabasca University Press, co-authored, 2014) also at http:\/\/www.aupress.ca\/index.php\/books\/120237\/ Liquid Surveillance (with Zygmunt Bauman, Polity 2013) Identifying Citizens: ID Cards as Surveillance (Polity 2009) Playing the Identity Card: Surveillance, Security and Identification in Global Perspective, (co-edited with Colin Bennett, Routledge 2008) Surveillance Studies: An Overview, (Polity 2007) Theorizing Surveillance: The Panopticon and Beyond, (editor; Willan 2006) Surveillance after September 11, (Polity 2003) Surveillance as Social Sorting: Privacy, Risk and Digital Discrimination, (Routledge 2003) Surveillance Society: Monitoring Everyday Life, (Open University Press, 2001) Computers, Surveillance and Privacy, (co-edited with Elia Zureik; Minnesota 1996) The Electronic Eye: The Rise of Surveillance Society, (Polity 1994) Contemporary Society Postmodernity, (Open University Press 1994; second edition, revised, 1999) The Information Society: Issues and Illusions, (Polity 1988) Religion Jesus in Disneyland: Religion in Postmodern Times, (Polity 2000) Rethinking Church, State and Modernity: Canada between Europe and America, (co-edited with Marguerite Van Die; University of Toronto Press 2000) Living Stones: St James’ Church Kingston 1845-1995, (Quarry Press 1995) The Steeple’s Shadow: On the Myths and Realities of Secularization, (SPCK 1985) Director, Surveillance Studies Centre, Queen's Research Chair in Surveillance Studies, Professor of Sociology, Professor of Law BSc (Soc. Sci.), PhD (Bradford) Room D526, Mackintosh-Corry lyond@queensu.ca Queen's Sociology Faculty Page Surveillance Studies Centre Teaching and Research Topics Law and Technology Privacy",
    "listed_research_areas":"Law And Technology; Privacy"
  },
  {
    "faculty":"queens",
    "name":"Cherie Metcalf",
    "title":"Associate Professor",
    "email":"metcalfc@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/cherie-metcalf",
    "bio":"Cherie Metcalf is an Associate Professor at Queen’s University in the Faculty of Law and the Department of Economics (cross-appointment). She completed her undergraduate degree at Queen’s before earning postgraduate degrees in Economics (MA, PhD) at the University of British Columbia, later returning to Queen’s to obtain her LLB. Following completion of her LL.B., she clerked at the Federal Court of Appeal and for former Justice Ian Binnie at the Supreme Court of Canada. She then completed her LLM at Yale on a Fulbright scholarship before joining the faculty. Professor Metcalf’s research often draws on her graduate training in economics. She has used economic theory and empirical methods to study Indigenous rights, including the Supreme Court’s s. 35 Aboriginal rights cases, considering impacts on governance, rights holders and resource industry participants. Another research strand relates to the role of law, especially constitutional rights, in influencing individuals’ decisions, preferences and broader social norms. Professor Metcalf also studies issues in environmental and resource law more generally and her most recent work is focused on climate change. Her research has been published in journals including the Northwestern University Law Review, International Review of Law & Economics, Canadian Public Policy, University of Toronto Law Journal, Journal of Empirical Legal Studies, & Queen’s Law Journal. Together with her co-author, Ian Keay, she was twice awarded the Vanderkamp prize for best paper in Canadian Public Policy. She frequently presents her work internationally at conferences and invited seminars. She has recently received grants from the Social Science & Humanities Research Council of Canada (SSHRC) and the Canadian Foundation for Legal Research. She has been an invited visiting scholar at the University of Colorado Faculty of Law & Institute of Behavioral Sciences Institutions Program, and Vancouver School of Economics at UBC. Professor Metcalf’s teaching at Queen’s spans the areas of her research interests, and includes public law, constitutional law, law and economics, international environmental and resource law and (occasionally) property law. She has also coached the Queen’s Laskin moot team, together with Queen’s Law alumna Pam Hrick (LEAF). She served as Associate Dean Academic at the faculty from 2015-2018. Recent Professional Accomplishments Awarded Vanderkamp Prize for best paper published in Canadian Public Policy (2022) Social Science & Humanities Research Council of Canada (SSHRC) – Insight Grant (2020-2024) on “Institutions for Effective Climate Change Action” (as PI) SSHRC - Insight Development Grant (2021-2023) on “The economic impact of historical treaties, land cession and land occupation on Indigenous outcomes” (as Collaborator) Canadian Foundation for Legal Research Grant (2020-2021) on “Climate Change & Canada’s Constitution” (as PI) SSHRC Institutional Grant (Queen’s) – Explore Grant (2019-2021) on “Is a Fine a Price? Norms, Incentives & Effective Regulations (as PI) Visiting Associate Professor, Vancouver School of Economics, UBC (2020-2021) Co-President, Canadian Law & Economics Association Selected Publications For a complete list of publications please consult Professor Metcalf’s CV. “Carbon Pricing & Constitutional Change” XX National Journal of Constitutional Law XX (forthcoming, 2023) “Beliefs, Information, and Institutions: Public Perception of Climate Change Information Provided by Government vs. the Market” 47 William & Mary Environmental Law and Policy Review XX (forthcoming, 2023) “Incentivized Torts: An Empirical Analysis” (with J. Shahar Dillbary & Brock Stoddard) (2021) 115(5) Northwestern University Law Review 1337-1404 Replication materials “Property Rights & Natural Resource Values: Recognition of Indigenous Rights in Canada” (with Ian Keay), (2021) 47 (1) Canadian Public Policy 18-55 (Awarded Vanderkamp Prize) “The Pandemic & Beyond: Federalism Faces Existential Threats” (with Meghan Huskisson-Snider) (2021) 46(2) Queen’s Law Journal 373-397 “Is a Fine still a Price? Replication as Robustness in Empirical Legal Studies” (with Emily A. Satterthwaite, J. Shahar Dillbary & Brock Stoddard), (2020) 63 International Review of Law & Economics (Replication Conference Special Issue) Data & Replication materials “The Idea of Property: A Comparative Review of Recent Empirical Research Methods” (with Paul Babie, Peter Burdon, Francesca Rimini & Geir Stenth) (2019) 26(2) Indiana Journal of Global Legal Studies 401 (invited contribution, peer-edited) “The (Ir)Relevance of Constitutional Property Rights: Compensation for Takings in Canada and the US” (2015) 65(3) University of Toronto Law Journal 143 (Selected for Stanford-Harvard International Jr. Faculty Forum) “Property Rights, Resource Access & Long Run Growth” (with I. Keay) (2011) 8 Journal of Empirical Legal Studies 792 (Selected for CELS Conference Volume) \"Aboriginal Rights, Customary Law and the Economics of Renewable Resource Exploitation\" (with I. Keay) (2004) 30 Canadian Public Policy 1 (Awarded Vanderkamp Prize) Selected Recent Presentations “Liability Reconsidered: Experimental Evidence” (with J. Shahar Dillbary & Brock Stoddard): 16th Conference on Empirical Legal Studies (2022, Virginia Law), Florida State University Law School (invited)(2022) “Communicating Risk across the Political Divide” (with Jonathan Nash): Society for Risk Analysis Conference (2022); Society for Environmental Law & Economics Association Conference (2022, NYU); Society for Institutional & Organizational Economics (SIOE) Conference (2022, U of T); Midwest Political Science Association (MPSA) Conference (2022); Soshnick Colloquium on Law and Economics at Northwestern Pritzker School of Law (invited) (2022); Conference on Empirical Legal Studies (CELS) (2022, U of T); Virginia-Michigan-Florida Virtual Law & Economics Workshop (invited) (2021); Midwest Law & Economics Association (MLEA) Conference (2021) “Law, Norms & Fines in a Pandemic”: Canadian Law & Economics Association Conference (2022, U of T); Canadian Economics Association Conference (2021) “Is a Fine Still a Price? Replication as Robustness in Empirical Legal Studies” (with Emily Satterthwaite, J. Shahar Dillbary and Brock Stoddard): Law, Business & Economics Workshop, University of Texas at Austin (invited) (2019); CELS (2019, Claremont McKenna College); SIOE (2019, Stockholm School of Economics); Program on Empirical Legal Studies (2019, Claremont McKenna College) Associate Professor BA (Hons.) (Queen's) MA, PhD (Econ.) (U.B.C.) LLB (Queen's) LLM (Yale) Room C516, Mackintosh-Corry Hall 613-533-6000 ext. 74267 metcalfc@queensu.ca Cherie Metcalf CV Teaching and Research Topics Aboriginal Law Constitutional Law Environmental Law International Environmental & Resource Law Law and Economics Public Law Offices, Clinics and Programs Undergraduate Certificate in Law",
    "listed_research_areas":"Aboriginal Law; Constitutional Law; Environmental Law; International Environmental & Resource Law; Law And Economics; Public Law"
  },
  {
    "faculty":"queens",
    "name":"Bruce Pardy",
    "title":"Professor",
    "email":"pardyb@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/bruce-pardy",
    "bio":"Professor Pardy is a classically liberal legal academic for whom equal application of the law, negative rights, private property, limited government, and separation of powers are foundational to the Canadian and Western legal tradition. A critic of legal progressivism, social justice, and the discretionary administrative state, he has written on a range of pressing legal subjects at the front lines of the culture war inside the law, including environmental governance, climate change, energy policy, human rights and freedoms, professional and university governance, property and tort theory, free markets, and the rule of law. He has taught at law schools in Canada, the United States and New Zealand, practiced civil litigation at Borden Ladner Gervais LLP in Toronto, served as adjudicator and mediator on the Ontario Environmental Review Tribunal, and has published and commented widely in traditional and online media. He serves as senior fellow at the Fraser Institute, and helped to birth the Runnymede Society, a branch of the Canadian Constitution Foundation. He spearheaded resistance to and ultimate repeal of the Law Society of Ontario’s statement of principles (SOP) policy that required Ontario lawyers to attest to their ideological purity to maintain their licence to practice. He is one of the co-creators of the Free North Declaration, a public petition and movement to protect civil liberties in Canada from COVID-19 irrationality and overreach. Professor Pardy is presently on leave from Queen’s Law to serve as the Executive Director of Rights Probe, a division of the Energy Probe Research Foundation, one of Canada’s leading public policy and governance thinktanks. The work of Rights Probe can be found on its website at https:\/\/www.rightsprobe.org\/. For Professor Pardy’s new publications, including articles and columns, please go to https:\/\/www.rightsprobe.org\/read For Professor Pardy’s new videos, talks, and interviews, please go to https:\/\/www.rightsprobe.org\/watch Videos Originalism in Canadian Constitutional Law: How should the Constitution be interpreted? Canadian Justice with KR Davidson and Asher Honickman A Healthy Critique of Canadian Society Counterpoint with Tanya Granic Allen The Conflict on the Right: Ford v Pardy (podcast) Letters from a Contrarian by Eugene Fernandes The Impact of Cancel Culture Canadian Justice with KR Davidson and Barbara Kay Cancel Culture and the Scientific Community Canadian Justice with KR Davidson and Debra Soh Bruce Pardy on Campus Freedom (podcast) The Justice Centre for Constitutional Freedoms: Justice with John Carpay The Civil War Inside the Law – and the side the law schools are on Runnymede TRU Bill 21, The Notwithstanding Clause, and Section 28 of the Charter with Geoff Sigalet, Leonid Sirota and Kristopher Kinsinger, Runnymede Law and Freedom Conference. A Dialogue on the UN Declaration on the Rights of Indigenous People (UNDRIP) with Professor Karen Drake, Runnymede Osgoode The Sweet Spot of Liberty with Salim Mansur and Robert Vaughn, JustRight Media The Future of Ontario’s Energy Policy (podcast) Beyond the Headlines The Two Kinds of Equality The North Wire Correcting Political Correctness with Maxime Bernier, Jared Brown and Lauren Chen Moving Beyond the Green Energy Act The Agenda with Steve Paikin, TVO Justin Trudeau, Anti-West sentiment and call-out culture Interview with Curt Jaimungal for Better Left Unsaid The Effect of Free Speech Laws on Universities JustRight Media\/Society for Academic Freedom and Scholarship (SAFS) A Heated Legal Climate for Energy in Ontario The Agenda with Steve Paikin, TVO with Elisabeth DeMarco Oxford Union Debate on Climate Change Resolved: That Developed Countries Have No Right to Impose Standards on Developing Countries Runnymede Society Debate on the Law Society of Ontario's Statement of Principles Resolved: That the Law Society’s Statement of Principles is an unjustified form of compelled speech The Queen's University Liberty Lecture with Jordan Peterson: The Rising Tide of Compelled Speech in Canada Has the Social Justice Revolution Taken Law Schools? Runnymede Windsor Political and Constitutional Challenges to Free Trade within Canada One Country One Market: The Future of Interprovincial Trade in Canada Debate on Non-gendered Pronouns with Jordan Peterson Resolved: That people have the legal right to decide the pronoun by which they will be addressed A Call to Rebellion for Ontario Legal Professionals Discussion on the Law Society of Ontario's Statement of Principles with Jordan Peterson and Jared Brown Update: Law Society of Ontario Compelled Speech with Jordan Peterson and Jared Brown Publications Professor Pardy’s book, Ecolawgic, in PDF – free download: Ecolawgic: The Logic of Ecosystems and the Rule of Law (Fifth Forum Press, 2015)Articles and Columns “Property Rights and Ecosystem Services” in Max Falque, ed, Property Rights for the Environment (Bruylant, 2021). ”Public Universities, Speech Policies, and the Law: Fourteen Maxims” (2020), 29 Education and Law Journal 27. “The Cold War Continues, and Now We Are Losing” (December 26, 2020) The Epoch Times “2020 Hindsight: Our Year of Bowing Down to ‘The Science’” (December 23, 2020) Financial Post “In Universities, the Revolution is Now Complete” (October 14, 2020) National Post “A Shakespearean Sendoff to Sir John A” (September 9, 2020) National Post “Public Universities, Speech Policies, and the Law: Fourteen Maxims” (2020) 29 Education and Law Journal 27. “Thirteen things that can’t be said about Aboriginal Law and Policy in Canada” C2C Journal, September 18, 2020. “In Critical Race Theory, White Self-Flagellation is the Only Choice” (July 24, 2020) The Epoch Times. “Apocalyptic science: How the West is destroying itself” (June 26, 2020) Financial Post. “Let’s not double-down on the nanny state” (April 22, 2020) National Post. “Careful, crises are an ideal time for the state to grab powers – we’re already seeing it in Canada” (March 31, 2020) Financial Post. “Liberals get unlimited spending authority for six months with Niels Veldhaus and Jason Clemens (March 25, 2020) Toronto Sun. “Trudeau government plan would have undermined Opposition ability to hold government to account” Fraser Forum, March 24, 2020. “Alberta Court of Appeal rejects carbon tax, protects provincial jurisdiction” Fraser Forum, February 25, 2020. “For students, not being disabled is the new disability” (January 20, 2020) The Epoch Times. “The Liberals aren’t liberal anymore – but the Conservatives can and must be” (December 20, 2019) National Post. “Welcome to law school where feelings are more important than facts” (December 17, 2019) The Epoch Times. “Conformists Inside the Gates: The Threat to Academic Freedom from Fellow Faculty” Society for Academic Freedom and Scholarship Newsletter, September 2019. “In the name of social justice, they are showing reformers their place” (June 24, 2019) National Post. “You have free speech so long as you think the right thoughts” (May 17, 2019) National Post. \"This lawyer was determined to stop the law society’s forced statement of principles” (May 14, 2019) Financial Post. “Outraged Responses to Ontario Free Speech Directive Reveal the Problem the Directive is Trying to Solve” Society for Academic Freedom and Scholarship Newsletter, April 2019. “Our rights depend on an election you haven’t even heard of” (April 2, 2019) National Post. “How Social Justice Ideologues Hijacked a Legal Regulator” with Murray Klippenstein, Quillette, February 11, 2019. “Substantive equality: Some people are more equal than others” Advocates for the Rule of Law, February 6, 2019. “Paris is a Progressive Fairy Tale: In Praise of American Withdrawal” (2019) 32 Journal of Environmental Law and Practice 19. “Five worst public law decisions at the Supreme Court of Canada: Day Two” Twelve Days of Christmas Symposium, Double Aspect blog, December 26, 2018. \"Students claiming mental disabilities should not be granted extra time on exams” International Society for Ethical Psychology and Psychiatry Bulletin, November 2018. \"StatCan's bank raid is absolutely ideological - the ideology of endless government meddling\" (Nov 20, 2018) Financial Post. “Disabusing the Common Law of ‘Abuse of Rights’: The Only Legitimate Rule Redux” (2018) 84 Supreme Court Law Review (2d) 201. \"Amazingly, the Constitution always says what the Supreme Court thinks it should\" (July 13, 2018) Financial Post. \"The Supreme Court's TWU ruling is a cruel joke played on all Canadians\" (June 29, 2018) National Post. “Protecting Government from Free Trade: The “Free the Beer” Case at the Supreme Court of Canada” Fraser Institute, 2018. \"The Liberals take a bad environmental assessment process and make it worse\" (May 2018) Financial Post. \"FIT to be Untied: How a new provincial government can unravel Feed-In Tariff electricity contracts\" (April 2018) Council for Clean and Reliable Energy (CCRE). \"Let the Paris climate deal die. It was never good for anything anyway\" (May 18, 2018) Financial Post. “Federal Reforms and the Empty Shell of Environmental Assessment” Fraser Institute, 2018. \"Law schools should not be combatants in culture wars — but too many profs disagree\" (April 3, 2018) National Post. \"The social justice revolution has taken the law schools. This won't end well\" (February 27, 2018) National Post. \"Law Society's new policy compels speech, crossing line that must not be crossed\" (October 3, 2017) National Post. \"The Only Legitimate Rule: A Reply to MacLean’s Critique of Ecolawgic\" (2017) Dalhousie Law Journal 393. \"Mental disabilities shouldn't be accommodated with extra time on exams\" (August 17, 2017) National Post. “Meet the new ‘human rights’ — where you are forced by law to use ‘reasonable’ pronouns” (June 19, 2017) National Post. “I’ve got a great, new fee model for investment advisers. I bet none of them takes it” (April 19, 2017) National Post. “Coercion or Consent: A Response to Honickman’s Review of Ecolawgic” (March 15, 2017), Advocates for the Rule of Law. “Don’t blame the robots for taking over the economy, blame the patents that protect them” (March 28, 2017) National Post. \"Head Starts and Extra Time: Academic Accommodation on Post-secondary Exams and Assignments for Cognitive and Mental Disabilities\" (2016), 25 Education and Law Journal 191. \"Does Constitutional Protection Prevent Education Reform in Ontario?\" December 2016, Fraser Institute Research Bulletin and Barbara Mitchell Centre for Improvement in Education. \"Not Good or Bad but Different: Free Markets, Subjective Preferences, and Labels for Genetically Modified Foods\" (2016) 29 Journal of Environmental Law and Practice 347 ”Climate witch hunt: The hypocritical plot to execute Exxon” (December 4, 2015) National Post. \"The Unbearable License of Being the Executive: A Response to Stacey's Permanent Environmental Emergency\" (2015) 52 Osgoode Hall Law Journal 1029 \"Towards an Environmental Rule of Law\" (2014) 17 Asia Pacific Journal of Environmental Law 163 “The Logic of Ecosystems: Capitalism, Rights and the Law of ‘Ecosystem Services’” (2014) 5 Journal of Human Rights and the Environment 136. “Cancelling Contracts: The Power of Government to Unilaterally Alter Agreements” October 2014, Fraser Institute Research Bulletin. “Killing green energy contracts”, Financial Post, May 14, 2014. Ecosystem Management and Sustainability, Volume 5 of the Berkshire Encyclopedia of Sustainability, Craig, Nagle, Pardy, Schmitz and Smith, editors (Berkshire, 2012). “Eviscerating Property in the Name of Sustainability” (2012) 3 Journal of Human Rights and the Environment 292. “Energy Visions versus Private Rights: Government energy strategies game the system” (2013) 25 Journal of Environmental Law and Practice 69. “False Panacea: The Human Right to Water” in Harriet Bigas, ed., The Global Water Crisis: Addressing an Urgent Security Issue, United Nations University Institute for Water, Environment and Health (Inter-Action Council, 2012), 136. “Too Much Talking, Too Few Rules: The Futility of Environmental Assessment”, H2Opinion, Water Canada Magazine, May\/June 2012, 50. “A Right to Clean Air? Constitutional protection for the environment may leave people out of luck” (book review) Literary Review of Canada, Vol. 20, No. 2, March 2012, 26. “The Failed Reform of Ontario’s Mining Laws” (2012) 23 Journal of Environmental Law and Practice 1 (with A. Stoehr) \"Remedies of Compensation: Tort\" in P. Blanchard, ed., Remedies 2nd Ed. (Brookers, 2012) (with G. McLay and D. Neild). “Separating Powers at the University: Applying Constitutional Law to Internal Academic Governance” (2011) 20 Education and Law Journal 243. “The Dark Irony of International Water Rights” (2011) 28 Pace Environmental Law Review 907. “Water Rights – All Wet” Financial Post Comment – National Post, September 7, 2011. “Environmental Assessment and Three Ways Not To Do Environmental Law” (2010) 21 Journal of Environmental Law and Practice 139. “Confidentiality Dilemmas in Environmental Mediation” in Practical Ethics for Mediators, E. Waldman, ed. (2010). “Brownfields: The Legal Framework” in P. Welbourn, ed., The Story of Brownfields and Smart Growth in Kingston Ontario (2009) (with M. Wallace and S. Warshawski). “Making Children Climate Drones” Financial Post Comment – National Post, February 4, 2010. “Ontario’s Policy Framework for Environmental Education” (2010) 22 Pathways: The Ontario Journal of Outdoor Education 22. “Water Myths and Legends” (November\/December 2009) Water Canada 7. \"The Hand is Invisible, Nature Knows Best, and Justice is Blind: Markets, Ecosystems, Legal Instrumentalism and the Natural Law of Systems\" (2009) 44 Tulsa Law Review 67. \"Climate Change Charades: False Environmental Pretences of Statist Energy Governance\" (2009) 26 Windsor Review of Legal and Social Issues 179 \"The Pardy-Ruhl Dialogue on Ecosystem Management, Part V: Discretion, Complex-Adaptive Problem Solving, and the Rule of Law\" (2008) 25 Pace Environmental Law Review 341. \"Separation of Powers in the Ivory Tower: An Organizing Principle for University Governance\", (2008) 5 Rutgers Journal of Law and Public Policy 372. \"Goods, Services and Systems: A Review of Ruhl, Kant & Lant's The Law and Policy of Ecosystem Services\" (book review) (2008) 46 Osgoode Hall Law Journal 445. \"Harper was right to criticize the UN on climate change\" (Dec. 14, 2007) Lawyer's Weekly \"The Clash over the Nature of Environmental Limits: Climate Change and Greenhouse Gas Reduction\" (2007) 16 Policy Dialogue (Saskatchewan Institute of Public Policy) 14. \"Honour thy mother and anyone living with her\", Globe and Mail (Tuesday, July 31, 2007). \"You say, she says: A conversation about climate change\", Kingston Whig-Standard (July 25, 2007). \"Ecosystem Management in Question: A Reply to Ruhl\" (2006) 23 Pace Environmental Law Review 209. The Writing Rules: How to Write Research Papers and Essays at University (Fifth Forum Press, 2006). \"WWF Report Wrong about Canada's ‘Print'\" Financial Post Comment, National Post, October 31, 2006. \"Senate Reform: Representation by Territory\" Opinion Page, Toronto Star, December 19, 2006. \"Sustainable Development: The Status Quo Masquerading as Environmental Progress\" (2006), 18 Pathways: The Ontario Journal of Outdoor Education 4, reprinted in [2006] 2 Variety: International Naturefriends Magazine (Prague) 26. \"Environmental Law and the Paradox of Ecological Citizenship: The Case for Environmental Libertarianism\" (2005) 33 Environments 25. \"In Search of the Holy Grail of Environmental Law: A Rule to Solve the Problem\" (2005) 1 International Journal of Sustainable Development Law and Policy 29 \"False first step \", National Post (Wednesday, February 9, 2005) \"The Kyoto Protocol: Bad News for the Global Environment\" (2005) 14 Journal of Environmental Law and Practice 27. \"Poor Students, Well-Paid Lawyers: Post-Graduation Income-Contingent Tuition Fees for Law Schools\" (2004) 29 Queen's L.J. 848. \"Seven Deadly Sins of Canadian Water Law \" (2004) 13 Journal of Environmental Law and Practice 89. \"Changing Nature: The Myth of the Inevitability of Ecosystem Management\" (2003) 20 Pace Environmental Law Review 675. \"Remedies of Compensation: Tort\" in P. Blanchard, ed., Remedies (Wellington: Brookers, 2003) 83. \"Asking the Dog to Guard the Puppy Chow: Three Objections to Environmental Voluntarism\" (2003), 12 Journal of Environmental Law and Practice 129. \"MacMillan Bloedel: Progress on Due Diligence\" (2002), 5 Criminal Reports146. \"Applying the Precautionary Principle to Private Actors: Is it Relevant to Civil and Criminal Liability?\" (2002) 43 Les Cahiers de Droit 63. \"Sustainable Development: In Search of a Legal Rule\" (2001), 28 Journal of Business Administration and Policy Analysis 391. \"Reverse Sensitivity: The Common Law Giveth and the RMA Taketh Away\" (1999) 3 New Zealand Journal of Environmental Law 93 (with J. Kerr). \"Implications of Reverse Sensitivity\" (1999) 3 Brookers Resource Management Bulletin 42 (with J Kerr). \"Animal Farm Revisited: An Environmental Allegory\" (1999), 30 Victoria University of Wellington Law Review 135. \"Rules that Define v Rules that Distort: Regulatory Creep Revisited\", [1998] New Zealand Law Journal 352. \"Abstraction, Precedent, and Articulate Consistency: Making Environmental Decisions\" (1998) 34 California Western Law Review 427. \"Representation by Territory: A Proposal for Senate Reform\" (1997) 9 Constitutional Forum 9. \"Planning for Serfdom: Resource Management and the Rule of Law\", [1997] New Zealand Law Journal 69 \"Environmental and Resource Management Law\" (Book Review), [1997] New Zealand Law Journal 185. \"Environmental Rights: Mitigating Flaws of the Management Model\", [1996] New Zealand Law Review 239. \"The Bill of Rights after Baigent\", [1996] New Zealand Law Journal 434. Environmental Law: A Guide to Concepts (Toronto: Butterworths, 1996). Presentations and Appearances “The Contemporary Abnormal: COVID-19 and the Rule of Law” Runnymede Western, October 2020. “The Case for Freedom and Free Markets in an Unfree Time” Canada Strong and Free Network, Online, May 2020. “The Civil War Inside the Law – and the side the law schools are on” Runnymede TRU, Kamloops, March 6, 2020. “Bill 21, The Notwithstanding Clause, and Section 28 of the Charter” with Geoff Sigalet, Leonid Sirota and Kristopher Kinsinger, Runnymede Law and Freedom Conference, Toronto, February 29, 2020. “A Dialogue on the UN Declaration on the Rights of Indigenous People (UNDRIP)” with Professor Karen Drake, Runnymede Osgoode, Toronto, February 27, 2020. “How Social Justice Lawyers Turned the Law Society into the Thought Police” with Lisa Bildy, Civitas Canada, Toronto, January 2020. “We Have Met the Enemy” InForming Content: Exploring Contemporary Performance Creation, Queen’s University, Kingston, November 2019. “Challenges to Indigenous and remote food sovereignty and security” Health and Human Rights Conference, Queen’s University, Kingston, November 2019. “The Civil War Inside the Law” POGG Canada, Harry Weldon Canadian Values Award Event, Ottawa, November 2019. “Right Idea, Wrong Approach: The Ontario free speech directive and the effect of speech laws on universities” Society for Academic Freedom and Scholarship (SAFS) Annual Conference, Western University, London, May 2019. Freedom North, Fraser Institute and Institute for Liberal Studies, Vancouver, April 2019. “Say goodbye to the liberal university” Civitas 23rd Annual National Conference, Canada in Flux, Liberty in Transition, Toronto, April 2019. \"Things that can’t be said about Aboriginal law and policy in Canada” Canadian Bar Association, Northwest Territories, Aboriginal Law Section, March 2019. \"How Not to Succeed in the Global Economy: Canadian strategies for losing our way\" Business Summit of British Columbia, Vancouver, November 16, 2018. \"The Political and Constitutional Challenges to Free Trade Within Canada\" One Country One Market National Conference: The Future of Interprovincial Trade, Atlantic Institute for Market Studies and Canadian Constitution Foundation, Ottawa, November 1, 2018. \"Head Starts and Extra Time: Academic Accommodation on Post-secondary Exams and Assignments for Students with Cognitive and Mental Disabilities\" International Society for Ethical Psychology and Psychiatry, Annual Conference, Toronto, October 2018. \"Trinity Western v Law Society of BC\" Runnymede Society, Western Law School, October 18, 2018. \"Has the Social Justice Revolution Taken Law Schools?\" Runnymede Society, Windsor Law School, October 12, 2018. \"Modifying Previous Government Energy Policies: Options for Action in the Public Interest\" Council for Clean and Reliable Energy Annual Energy Leaders Roundtable, Orangeville, April 2018. \"The Rising Tide of Compelled Speech in Canada\" with Jordan Peterson, Queen's Liberty Lecture, Kingston, March 5, 2018. \"The Law Society's Statement of Principles\" Centre for Israel and Jewish Affairs, Combating Hate Speech and Antisemitism, Law Society of Upper Canada, Toronto, February 13, 2018 \"Paris, We Hardly Knew Ye\", ​6th Biannual Conference of the Journal of Environmental Law and Practice (JELP), We'll Always Have Paris, Dalhousie University, Halifax June 2017. \"Disabusing the Common Law of 'Abuse of Rights'\", Canadian Law of Obligations 2017, Innovations, Innovators, and the Next 20 Years, University of British Columbia, Vancouver, May 2017. \"Forced speech in Bill C-16\", testimony before the Senate Legal and Constitutional Affairs Committee, May 2017. “Becoming the Deep State? The Uneasy Relationship between Government Policy and the Rule of Law”, Masters of Public Administration Program, Queen's University, Kingston, May 2017. \"Ecolawgic: The Logic of Ecosystems and the Rule of Law\", 2017 Civitas Annual Conference, Vancouver, April 2017. \"Freedom of Speech and Bill C-16\", Runnymede Society Debate with Jordan Peterson, Queen's University, Kingston, January 2017. “The Start of the End of Paris and perhaps the UNFCCC”, The World After the Paris Agreement, McGill Journal of Sustainable Development Law, McGill University, Montreal, January 2017. \"International law versus the Rule of Law\", Institute for Liberal Studies Debate, McGill University, Montreal, January 2017. “Head Starts and Extra Time: Academic Accommodation on Post-secondary Exams and Assignments for Cognitive and Mental Disabilities” Lakehead University, Thunder Bay, Sept 2016. “Environmental Law versus The Rule of Law” Runnymede Society Debate, Bora Laskin School of Law, Lakehead University, Thunder Bay, Sept 2016. “Hard Truths about Climate Change” The Sunday Edition, CBC Radio, May 13, 2016. “The Inevitability of Property” Property and Law Symposium, Institute of Liberal Studies, Ottawa, April 2016. “There’s No Such Thing as Public Interest: A Discussion About Ecolawgic: The Logic of Ecosystems and the Rule of Law” Presentation to Officials at Environment Canada, Gatineau QC, March 2016. “The Legitimacy of the Welfare State: Governments in Pursuit of Public Good” Runnymede Society Debate, University of Toronto Faculty of Law, March 2016. “Debate on Social and Economic Rights” Runnymede Society Debate, Queen’s University Faculty of Law, March 2016. “Property: Environmental Hero or Villain?” Institute of Liberal Studies, University of Ottawa, February 2016. Book launch of Ecolawgic: The Logic of Ecosystems and the Rule of Law, featuring Justice Grant Huscroft and Professor Jason MacLean, Queen’s Law, January 2016. “Allegations ExxonMobil used Big Tobacco tactics on climate change” The Current, CBC Radio, November 13, 2015. “A Betrayal of Its Own Ideology: The Canadian Government’s Refusal to Label Genetically Modified Foods” The Journal of Environmental Law and Practice’s 5th Biennial Conference ‘Après…le Déluge’: Future Directions for Environmental Law and Policy in Canada, Kananaskis AB, June 2015. “Destined to Fail? Groundwater Management in Canada” (Commentator), Security Underground: Financing Groundwater Mapping and Monitoring in Canada, Munk School of Global Affairs, Program on Water Issues, May 2015. “Water and the Myth of Sustainable Development” Water Environment Association of Ontario, Queen’s Chapter, March 2015. “FIT to be Tied: Can the Ontario Government cancel renewable energy contracts?” Ontario Network for Sustainable Energy Policy (ONSEP) Annual Workshop, Prince Edward County, Ontario, April 2014. “The Madness of Bottled Water Bans”, Water Environment Association of Ontario, Queen’s Chapter, Kingston, March 2014. “Welcome to the Anthropocene, where natural means everything and nothing”, Law and Our Diverse Natures Conference, University of Ottawa Faculty of Law, February 2014. “Markets, Laws and Labels for Genetically Modified Foods”, Yale Food Systems Symposium, Yale University, New Haven, October 2013. “Wrongs Don’t Make a Right: A Rights-based Theory of Tort”, 2013 Private Law Theory Workshop, Queen’s University, Kingston, April 2013. “Climate Change: Sense and Nonsense”, Keynote speaker, Ontario Public Works Associaion (OPWA) Annual Meeting, Ottawa, January 2013. “Drowning in Confusion: The Debate over Water Rights”, Keynote speaker, World Water Day 2013 Graduate Research Symposium, Wilfrid Laurier & Waterloo Universities, Waterloo, March 2013. “The Murky World of Water Rights”, Water Environment Association of Ontario, Queen’s Chapter, Kingston, March 2013. Roundtable Discussant, Classics in Environmental Ethics, Department of Philosophy, University of Illinois, Galena IL, October 2012. “False Panacea: The Human Right to Water” at symposium and launch of The Global Water Crisis: Addressing an Urgent Security Issue, United Nations University Institute for Water, Environment and Health, Hamilton ON, September, 2012. “No Visions Please, We’re Canadian: National Energy Strategies Game the System”, 4th Biennial Conference of the Journal of Environmental Law and Practice (JELP), (De)Constructing a “National Energy Strategy”: Environmental, Economic and Social Sustainability of Two Different Visions, Cypress Hills, Saskatchewan, June 2012. “Towards an Environmental Rule of Law”, A Rule of Law for Nature, University of Oslo Faculty of Law, Oslo, Norway, May 2012. Roundtable Discussant, Reconciling Ecology and Economics: Processes and Property Rights, Hoover Institute, Stanford University, Palo Alto CA, April 2012. “Losing Liberty and Ecosystems: Legal Instrumentalism and the Environmental Rule of Persons”, University of Montana School of Law, Missoula, MT, October 2011. “Justice Should be Blind: Environmental Instrumentalism and the Rule of Law”, University of Saskatchewan College of Law, Saskatoon, October 2011. “Liberty, Markets and Environmental Policy”, Roundtable Discussant, Liberty Fund and PERC, Montana Sky Guest Ranch, Emigrant, Montana, October 2011. “Coase, Economic Welfare and the Rule of Law”, Seminar Series, Property and Environment Research Center (PERC), Bozeman, Montana, September 2011. “A Natural Law of Systems”, Seminar Series, Property and Environment Research Center (PERC), Bozeman, Montana, September 2011. “Elevating Canada’s EA Game: Can EA Contribute to Making Canada a “Responsible Energy Superpower”, Clean Energy Superpower and Environmental Assessment: Canada’s Ambitions and Choices, Queen’s Institute for Energy and Environmental Policy, March 2011. “The Blue Covenant”, public debate at Royal Ontario Museum, Director’s Signature Lecture Series, Water: The Forum, Toronto, March 2011. “Environment, Technology, and Society: Ways to Think about Environmental Law”, Civil Engineering Forum, Queen’s University, January 2011. “Green Conservatism Workshop”, Manning Centre for Building Democracy, Kahanoff Conference Centre, Calgary, December 2010. “Canada and Climate Change” on Goldhawk Live, CPAC Television Program hosted by Martin Stringer (first aired December 12, 2010) available at. “The Great Climate Debate”, Queen’s Environmental Law Association, November 2010. “Why Climate needs Trade Law and the Obstacles in the Way”, Queen’s University Summer Institute on Trade Policy, September 2010. \"Water Governance: Building a coherent, principled framework”, Value of Water, Centre for Environment, University of Toronto, Toronto, April 2010. \"Water Myths: Domestic and International\", Queen's University 6th Annual International Development Conference, Kingston, March 2010. “Planning for Energy Serfdom: Ontario’s Green Energy Act and the Perversion of Sustainable Technology Development” at First Annual Workshop of ONSEP (Ontario Network of Sustainable Energy Policy), Niagara-on-the-Lake, Ontario, April 2010. “Climate Change Plans and Ploys”, 2010 Annual Conference of Ontario Public Works Association, Mississauga, January 2010. “Copenhagen Wrap-Up - Pardy”, The Current, CBC Radio (Friday, December 18, 2009) The Debate over Climate Change: Canada, Leader or Laggard?, CPAC Television Documentary by Bill Luxton featuring Bruce Pardy (first aired December 8, 2009) “Environmental Assessment and Three Ways Not to Do Environmental Law” at Third JELP Environmental Law Conference, The Demise of Environmental Assessment in Canada? Faculty of Law, University of Windsor, October 2009. “Ontario’s Environmental Education Framework”, 2009 Council of Outdoor Educators of Ontario Annual Meeting, Parham, September 2009 “Climate Change, International Development, and Environmental Limits”, Queen’s University Summer Institute on Trade Policy, September 2009. \"Water Policy Myths and Misconceptions\" at Investing in Water, Centre for Environment, University of Toronto, Toronto, May 2009. \"Confronting the Geography of Climate Change: Population, Territory, Biocapacity and the International Clash over National Limits\", Canadian Association of Law Teachers Annual Meeting, Carleton University, Ottawa, May 2009. \"Legal Philosophies of Environmental Protection\" (chair and panelist), Canadian Association of Law Teachers Annual Meeting, Carleton University, Ottawa, May 2009. \"Water Policy Myths and Misconceptions\" at Investing in Water, Centre for Environment, University of Toronto, Toronto, May 2009. \"What Economists Should Know About Environmental Law\", Seminar Series, Department of Food, Agriculture and Resource Economics, University of Guelph, Guelph, March 2009. \"Access to Water: Basic Propositions for the Governance of Drinking Water\", Queen's University 5th Annual International Development Conference, Kingston, March 2009. \"Canada's Energy Future\" (panelist), Commerce and Engineering Environmental Conference (CEEC), Queen's University School of Business, Kingston, March 2009. \"Carbon Pricing in Canada: What's Wrong with This Picture?\" at Carbon Pricing and Environmental Federalism, Institute of Intergovernmental Relations and Queen's Institute for Energy and Environmental Policy, Kingston, October 2008. \"Climate Change Sense and Nonsense: Bandwagons, Boondoggles, and Boundless Hot Air\", Collingwood Georgian Triangle Lifelong Learning Institute, Collingwood, 26 September 2008. \"Models of Environmental Governance: Moving from the Specific to the General\", (organizer and chair), 2008 Joint Meeting of the Canadian Law & Society Association and International Law & Society Association, Montreal, June 2008. \"Applying Sunstein's Libertarian Paternalism\", (organizer and chair), 2008 Joint Meeting of the Canadian Law & Society Association and International Law & Society Association, Montreal, June 2008. \"Torts, Egalitarianism, and Distributive Justice\", (reader and commentator), 2008 Joint Meeting of the Canadian Law & Society Association and International Law & Society Association, Montreal, May 2008. \"The International Context and a Skeptic's Lament\" at Turning the Corner or Hitting the Wall: Climate Change Law & Policy in the Post-Kyoto Era, speaker, chair, and organizer, Program at the Ontario Environmental Review Tribunal, Toronto, April 2008. \"Climate Change and the Kyoto Protocol: Perspectives and Prospects\" (panelist), at 2008 Commerce and Engineering Environmental Conference, Queen's University School of Business, March 2008. \"Water Law 101\" at 2008 International Development Conference, Queen's University, March 2008. \"Encouraging Environmentally Sustainable Communities\" at Environmental Stewardship Workshop, School of Urban and Regional Planning, Queen's University, March 2008. \"Corporate Legal Identity and the Role of Government\" at The New Wild West: Canadian Multinationals in the Global South, Queen's University, March 2008. \"Separation of Powers in the Ivory Tower: An Organizing Principle for University Governance\" at 2008 Annual Meeting of the Association of American Law Schools, poster presentation, New York, January 2008. \"Property Rights, Utilitarian Government and Environmental Protection\" at The Future of Freedom: Law and Liberty in Canadian Jurisprudence, Canadian Constitution Foundation, Toronto, October, 2007. \"Public Consent in Electricity Governance\" (Commentator) at Good Governance and the North American Electricity Sector: Can North America's Federal Systems Meet the Challenges? Forum of Federations, QUIEEP and Natural Resources Canada, Toronto, October 2007. \"People and the Environment: Realities and Opportunities\" at Think Again 2007, Conference of the Canadian Millenium Foundation, Ottawa, September 2007. \"Kyoto: Bruce Pardy Feature\", The Current, CBC Radio (Monday, June 18, 2007) . \"Climate Change: Through the Lens of Developed and Developing\" at Six Degrees of Separation: Media Fellowship Conference on Climate Change, Queen's University, May 2007. The Great Debate: Environmentalism and Sustainability, Queen's University, March 29, 2007. \"Environmental Orthodoxy and the Ironic End of the World\", The Last Debate on Earth Series, Queen's University, March 2007. Conference Chair, Queen's Sustainability Network Conference 2007, Interest to Action, March 2007. Is Kyoto for Canada? Panel discussion on the Kyoto Protocol, Queen's University, February 28, 2007. The Ratings Game, American Association of Law Schools Annual Meeting, January 2007. \"Kyoto, Subsidies, and Energy Markets\" in Oil and Gas and the Canadian Economy, Q'BET 2006 (Queen's Conference on the Business Environment Today), Kingston, November 2006. \"Ecosystem Creep and the Absence of Rules in Environmental Law\", Canadian Association of Law Teachers Annual Meeting, York University, June 2006. \"Stakeholder Participation\" (Session Chair) at 2nd J.E.L.P. Environmental Law Conference: Sharing Environmental Responsibility: Stewardship Obligations in the Corporate, Governmental and Non-Governmental Sectors, University of Saskatchewan College of Law\/Anglin Lake, Saskatchewan, June 2006. \"Are Humans Part of Nature? The Paradox of Ecological Citizenship\", Environmental Studies Association of Canada Annual Meeting, University of Western Ontario, June 2005. \"The Paradox of Individualized Justice\" Canadian Association of Law Teachers Annual Meeting, University of British Columbia, June 2005. \"One Step Forward, Two Steps Back: Kyoto and the UN Framework Convention on Climate Change\", Environmental Lawyers in Government Conference, Toronto, Sept 2004. \"The Kyoto Protocol: Bad News for the Global Environment\", First JELP Environmental Law Conference: Defining Canada's Environmental Priorities, University of Saskatchewan, June 2004. \"Liability for Contaminated Lands\", Rethinking Brownfield Development: Linking Strategies, Technology, and the Planning Profession, Queen's University, March 2004. \"Leaving Standards Up in the Air: Flaws in the Kyoto Approach\", 2003 Annual Meeting of the Canadian Association of Law Teachers, Dalhousie University, June 2003. \"Poor Students, Well Paid Lawyers: An Introduction to Post-Graduation, Income-Contingent Tuition Fees for Law Schools\" 2003 Annual Meeting of the Canadian Association of Law Teachers, Dalhousie University, June 2003. \"Few Rights, Few Responsibilities: Seven Deadly Sins of Canadian Water Law\", First International Conference on Water and Health, Towards a New Frontier in the Protection of Drinking Water, Ottawa, September 2002. \"The World Summit on Sustainable Development: Commentary\", CBC Radio, August 28, 2002. \"The First Class of Law School: Professor, Your Fifteen Minutes Are Up\" 2002 Institute for Law School Teaching Conference, Franklin Pierce Law Centre, Concord, NH, June 2002. \"Voluntarism and the Evolution of Environmental Law: A Dubious Path to an Uncertain Destination\" 2002 Environmental Studies Association of Canada Annual Meeting, Voluntarism and Environmental Governance, University of Toronto, May 2002. \"Applying the Precautionary Principle to Private Actors: Is it Relevant to Civil and Criminal Liability?\" 2001 Annual Meeting of the Canadian Association of Law Teachers, Joint Session of Administrative Law, Health Law, Environmental Law and International Law Sections, Laval University, May 2001. \"Whose Fault Is It When Corporations Pollute?\" 2001 Human Rights Symposium, New England School of Law, Boston, February 2001. \"Not with a Bang but a Manager: The End of Environmental Protection\", 2000 Thomas Jefferson School of Law Lecture Series, San Diego, March 2000. \"Logical Flaws in Ecosystem Management\", 2000 California Western School of Law Faculty Seminar Series, San Diego, January 2000. \"Defining Risk Management\", seminar for Wellington District Law Society, October 1998. \"Ecology, Law and Urban Planning - Can They Work Together?\" California Western School of Law Lecture Series, San Diego, February 1998. \"The Case for Preservation\" in The Great Environment Debate, NZ Institute of Public Law, Wellington, March 1997. \"The Death of Principle in Environmental Law\", Spring Seminar Series, Faculty of Law, Victoria University of Wellington, November 1996. \"Baigent and the Bill of Rights: Mark Antony's Response\" in The Great Debate on Baigent v Attorney-General, NZ Institute of Public Law, Wellington, September 1996. \"Contaminated Sites: The New Zealand Approach\", presentation at Government and Public Sector Lawyers' Conference, Canadian Bar Association, Vancouver, August 1996. \"Planning for Serfdom in New Zealand: Reflections on Urban Regeneration\", paper presented at the 11th Commonwealth Law Conference, Vancouver, August 1996. \"Baigent and the Tort of Breach of Statutory Duty\", presentation at Symposium on the Interface between Tort and Public Law, NZ Institute of Public Law, July 1996. Decisions in Cases before the Ontario Environmental Review Tribunal 2210652 Ontario Ltd v Ontario (Ministry of the Environment) [2014] Ontario Environmental Review Tribunal Decisions No. 40. D & O Waterline Assn. v. Ontario (Ministry of the Environment) [2014] Ontario Environmental Review Tribunal Decisions No. 30. Nestle Canada Inc. v. Ontario (Ministry of the Environment) (2013), 76 Canadian Environmental Law Reports (3d) 331. Kemp v. Ontario (Ministry of Agriculture, Food and Rural Affairs), [2013] Ontario Environmental Review Tribunal Decisions No. 60. Wessuc Inc. v. Ontario (Ministry of Agriculture, Food and Rural Affairs), [2013] Ontario Environmental Review Tribunal Decisions No. 69. Martin v. Ontario (Ministry of the Environment), [2013] Ontario Environmental Review Tribunal Decisions No. 71. Kennametal Stellite Inc. v. Director, Ministry of the Environment (2013), Ontario Environmental Review Tribunal Case No. 13-118. Timco Foods Ltd. v. Ontario (Ministry of the Environment) (2013), 74 Canadian Environmental Law Reports (3d) 137. Brimley Progress Development Inc. v. Ontario (Ministry of the Environment) (2013), 75 Canadian Environmental Law Reports (3d) 310. TankTek Environmental Services Ltd. v. Ontario (Ministry of the Environment) (2013), 76 Canadian Environmental Law Reports (3d) 84. Timco Foods Ltd. V Ontario (Ministry of the Environment),[2013] O.E.R.T.D. No. 16 Preserve Mapleton Inc. v. Ontario (Ministry of the Environment) (2012), 67 Canadian Environmental Law Reports (3d) 207. Concerned Citizens Committee of Tyendinaga and Environs v. Ontario (Ministry of the Environment) (2012), 67 Canadian Environmental Law Reports (3d) 94. Sitko Farms Inc. v. Ontario (Ministry of the Environment), [2012] Ontario Environmental Review Tribunal Decisions No. 37. Monture v. Ontario (Ministry of the Environment), [2012] Ontario Environmental Review Tribunal Decisions No. 39. Napash v. Ontario (Ministry of the Environment), [2012] Ontario Environmental Review Tribunal Decisions No. 55. Ontario Power Generation Inc. v. Ontario (Director, Ministry of the Environment), [2011] Ontario Environmental Review Tribunal, Case No. 10-119. Ontario Power Generation Inc. v. Ontario (Director, Ministry of the Environment), [2011] Ontario Environmental Review Tribunal, Case No. 10-131. Quiring v. Ontario (Director, Ministry of the Environment), [2011] Ontario Environmental Review Tribunal, Case No. 11-225\/226. Tesmar Holdings Inc. v. Ontario (Director, Ministry of the Environment),[2010] Ontario Environmental Review Tribunal, Case No. 09-158. Welch v. Ontario (Director, Ministry of Environment),[2010] Ontario Environmental Review Tribunal Decisions No. 10-069, [2010] O.E.R.T.D. No. 46. Welch v. Ontario (Director, Ministry of Environment),[2010] Ontario Environmental Review Tribunal Decisions No. 10-070, [2010] O.E.R.T.D. No. 47. McRae v. Ontario (Director, Ministry of the Environment),[2009] Ontario Environmental Review Tribunal, Case No. 09-062, [2009] O.E.R.T.D. No. 41. Quinte West v. Ontario (Director, Ministry of Environment),[2009] Ontario Environmental Review Tribunal Decisions No. 09-070, [2009] O.E.R.T.D. No. 49, 46 Canadian Environmental Law Reports (3d) 237. Dawber v. Ontario (Ministry of Environment)(2007), 28 Canadian Environmental Law Reports (3d), judicially reviewed and upheld by the Ontario Divisional Court: Lafarge Canada Inc. v. Ontario (Environmental Review Tribunal), [2008] O.J. No. 2460 (Div. Ct.). Passmore on behalf of the North Aldershot Preservation Association v. Ontario (Director, Ministry of the Environment), [2007] Ontario Environmental Review Tribunal, Case No. 06-225. Dawber v. Ontario (Director, Ministry of Environment), [2007] Ontario Environmental Review Tribunal, Case Nos. 06-160 to 06-181\/06-183. Bogan v. Ontario (Director, Ministry of Environment), [2007] Ontario Environmental Review Tribunal Decisions No. 12. Davidson v. Ontario (Director, Ministry of Environment) (2006), 24 Canadian Environmental Law Reports (3d) 165. Valastro v. Ontario (Director, Ministry of Environment) (2006), 23 Canadian Environmental Law Reports (3d) 307. Safety-Kleen Canada Inc. v. Ontario (Director, Ministry of Environment) (2006), 21 Canadian Environmental Law Reports (3d) 88. Simpson v. Ontario (Director, Ministry of Environment) (2005), 18 Canadian Environmental Law Reports (3d) 123. Professor pardyb@queensu.ca Teaching and Research Topics Civil Procedure Constitutional Law Environmental Law Human Rights Law Legal & Political Thought Political Economy Property Law Torts",
    "listed_research_areas":"Civil Procedure; Constitutional Law; Environmental Law; Human Rights Law; Legal & Political Thought; Political Economy; Property Law; Torts"
  },
  {
    "faculty":"queens",
    "name":"Patricia Peppin",
    "title":"Professor",
    "email":"peppinp@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/patricia-peppin",
    "bio":"Teaching Subjects Health Law Torts Mental Health Law Recent Professional Achievements Published articles on drug advertising and research Presented papers to the Congress of the International Academy of Law and Mental Health and the Urban Health and Race Law Conference at DePaul University College of Law Co-edited a collection of papers, “Catalysts for University Education in Developmental Disabilities” and wrote one of the papers, \"Here Be Dragons?\", on teaching law to medical practitioners Directs the Law Program, School of Medicine Current Research I am currently working on images of inequality in prescription drug advertisements, and on innovation in the pharmaceutical field and its impact on women’s health. Selected Articles in Journals and Book Chapters “Knowledge and Power: Drug Products Liability Actions and Women’s Health”, in Feminist Perspectives on Tort Law. Janice Richardson and Erika Rackley (eds.) (Abingdon, Oxon: Routledge Press, 2012), at pp. 105-125. “Informed Consent” in Canadian Health Law and Policy. Jocelyn Downie, Timothy Caulfield and Colleen Flood (eds.) 4th ed. (Markham: LexisNexis, 2011) at pp. 153-194, and 3rd ed. (Markham: LexisNexis Butterworths, 2007), at 189-221. “Vaccines and the Emerging Challenges for Public Health Law”, in Public Health Law and Policy in Canada. Tracey M. Bailey, Timothy C. Caulfield, and Nola M. Ries (eds.) (Markham: LexisNexis Butterworths, 2005) at 131-163 and 2nd ed. (2008) at 133-177 and 3rd edition, forthcoming. Contributor, Halsbury’s Laws of Canada, Public Health. LexisNexis Canada: Markham, 2010. “Gender Equity in Clinical Trials in Canada: Aspiration or Achievement?”, with Roxanne Mykitiuk, (2008) 2 International Journal of Feminist Approaches to Bioethics (IJFAB) 100-124. “Litigating Antidepressants: Challenging Constructs of Health in Pharmaceutical Promotion” in Brave New World of Health. Belinda Bennett, Terry Carney, and Isabel Karpin (eds.) (Annandale, NSW: Federation Press, 2008), at pp. 166-181. “Directing Consumption: Direct-to-Consumer Advertising and Global Public Health”, in Globalization and Health: Challenges for Health Law and Bioethics, Belinda Bennett and George Tomossy (eds.), (Amsterdam: Springer, 2006) at 109-128. “The Power of Illusion and the Illusion of Power: Direct-to-Consumer Advertising and Canadian Health Care”, in Just Medicare. Colleen Flood (ed.) (Toronto: University of Toronto Press, 2006) at 355-378. “Signs of Inequality: Constructing Disability in Antidepressant Drug Advertising”, with Elaine Carty, (2003) Health Law Journal, Special Edition: Precedent and Innovation, Health Law in the 21st Century, 161-184. “Manufacturing Uncertainty: Adverse Effects of Drug Development for Women” (2003) 26(5) International Journal of Law and Psychiatry, Special Issue on Locating Psychiatry and Women’s Mental Health, Sept.\/Oct. 2003, 515-532. “Semiotics, Stereotypes, and Women’s Health: Signifying Inequality in Drug Advertising”, with Elaine Carty, (2001) 13 Canadian Journal of Women and the Law 326-360. “Innovation, Myths and Equality: Constructing Drug Knowledge in Research and Advertising”, with Elaine Carty, (2001) 23 Sydney Law Review, Special Issue on Medicine and Law, 543-576. “Entitlements for People with Developmental Disabilities” with Harry Beatty and David Baker, in Ivan Brown and Maire Percy (eds.), Developmental Disabilities in Ontario (2nd ed.) (Toronto: Front Porch Publishing, 2002) at 67-86, and (1st ed.) with David Baker, at 67-82. “Legal and Ethical Dimensions of Dual Diagnosis” in Dual Diagnosis: An Introduction to the Mental Health Needs of People with Developmental Disabilities. Dorothy Griffiths, Chrissoule Stavrakaki and Jane Summers (eds.) (Sudbury: NADD, Habilitative Mental Health Resource Network, 2002), at 56 1-593. “Here Be Dragons?: Creating Legal Understanding in Health and Social Service Environments” in Catalysts for University Education in Developmental Disabilities. Bruce McCreary, Patricia Peppin and Barbara Stanton (eds.) (Kingston: Developmental Consulting Program, 2001) at 177-190. “Women’s Health and Law — An Emerging Field” Editorial, with Lorraine E. Ferris (1999-00) 1 Journal of Women Health and Law ix. “A Feminist Challenge to Tort Law” in Feminist Perspectives on the Foundational Subjects of Law. Anne Bottomley (ed.) (London: Cavendish Publishing, 1996) at 69-85.. “Feminism, Law and the Pharmaceutical Industry” in Frank Pearce and Laureen Snider (eds.) Corporate Crime: Contemporary Debates (Toronto: University of Toronto Press, 1995) at 87-113. “Power and Disadvantage in Medical Relationships” (1994) 3 Texas Journal of Women and the Law 221-263. “Emergency Legislation and Rights in Canada: The War Measures Act and Civil Liberties” (1993) 18 Queen’s Law Journal 129-190. “Drug\/Vaccine Risks: Patient Decision-Making and Harm Reduction in the Pharmaceutical Company Duty to Warn Action” (1991) 70 Canadian Bar Review 473-516. “Justice and Care: Mental Disability and Sterilization Decisions” (1989-1990) 6 Canadian Human Rights Yearbook 65-112 “Sexuality and Contraception for Developmentally Handicapped Persons” with Richard MacLachlan, Canadian Family Physician 1986: 32; 163: 1-37. Professor BA (Hons), MA, LLB (Queen's) 613-533-6000, ext. 77011 peppinp@queensu.ca Teaching and Research Topics Health Law Torts",
    "listed_research_areas":"Health Law; Torts"
  },
  {
    "faculty":"queens",
    "name":"Michael Pratt",
    "title":"Associate Professor",
    "email":"m.pratt@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/michael-pratt",
    "bio":"Michael G Pratt is an Associate Professor of Law, cross-appointed to Philosophy, at Queen’s University. He studied at the University of Toronto, where he earned his BSc and, following an LLB from Osgoode, his LLM. He later obtained a PhD in Philosophy from the University of Sydney. Professor Pratt joined Queen’s Law in 2003, having previously taught at the University of Queensland and the University of Alberta. He has served as Associate Dean, Graduate Studies and Research. Professor Pratt teaches a range of courses in private law, including Contracts, Torts, Remedies, and Land Transactions. Professor Pratt has written widely on philosophical foundations of contract law, promises, and voluntary obligations. His latest work examines the law of damages, and the law of real estate transactions. He recently completed a treatise on the law governing the termination and rescission of agreements for the purchase and sale of land in Canada. Research: Remedies Contract Law Private Law Theory Recent Publications Books Termination and Rescission of Agreements for the Purchase and Sale of Land, LexisNexis, 2023. With J. Berryman et al., Remedies: Cases & Materials, 8th ed. Emond Montgomery, (2020) Articles “Waiving Conditions Precedent” (2021) 52 Adv. Quarterly 119 “What would the Defendant have Done But For the Wrong?” (2020) Oxford J Legal Studies 28 “Betterment” (2017) 40:1 Dal LJ 67-105 “Some Features of Promises and Their Obligations”, (2014) 52 Southern J of Philosophy 382 “Disclaimers of Liability and Voluntary Obligations”, (2014) 51 Osgoode Hall Law Journal 767 Associate Professor BSc, LLM (Toronto) LLB (Osgoode) PhD (Philosophy, Sydney) Room C522, Mackintosh-Corry Hall 613-533-6000 x78599 m.pratt@queensu.ca SSRN Teaching and Research Topics Contracts Legal & Political Thought Philosophy of Law Torts",
    "listed_research_areas":"Contracts; Legal & Political Thought; Philosophy Of Law; Torts"
  },
  {
    "faculty":"queens",
    "name":"Darryl Robinson",
    "title":"Associate Dean (Graduate Studies and Research), Professor",
    "email":"darryl.robinson@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/darryl-robinson",
    "bio":"Darryl Robinson was a Hauser Scholar at New York University School of Law (LLM International Legal Studies), where he received the Jerome Lipper Award for outstanding achievement in international law. Prior to that, he was the Gold Medalist at the University of Western Ontario Faculty of Law, where he was a President's National Scholar. He articled at Osler, Hoskin & Harcourt in Toronto and clerked at the Supreme Court of Canada for Justice John Major. He served as a Legal Officer at Foreign Affairs Canada from 1997-2004, providing legal advice and engaging in international negotiations concerning international human rights, humanitarian and criminal law. His work in the creation of the International Criminal Court and in the development of Canada's new war crimes legislation earned him a Minister's Citation and a Minister's Award for Foreign Policy Excellence. He joined the International Criminal Court as an adviser to the Chief Prosecutor, from 2004 to 2006, helping to shape the first policies and strategies of the new institution. He was also involved in litigation, providing legal advice, negotiating cooperation agreements with the UN, Interpol and others, and strengthening external relations. From 2006 to 2008, he was a Fellow, Adjunct Professor and Director of the International Human Rights Clinic at the University of Toronto Faculty of Law. He was involved in an intervention at the Supreme Court of Canada in the Omar Khadr case, research for the Air India inquiry, and bringing a case to the European Court of Human Rights on behalf of a community of Roma who were expelled from their homes. He joined Queen's University Faculty of Law in July 2008. Research: International criminal justice Recent Professional Achievements: SSHRC Partnership Grant on strengthing international criminal justice (2016-2021) SSHRC Insight Development grant on the theory of crimes against humanity (2016-2020) Foundation for Legal Reasearch grant on the scope of contemporary crimes against humanity Antonio Cassese Prize for International Criminal Law Studies (2013-15) Instructor on International Law at Foreign Affairs Canada (2012-) SSHRC Insight Development Grant for a project developing a cosmopolitan liberal account of international criminal law (2012-2015) SSHRC research grant, with three other Canadian law professors, to observe and assess the ICC Review Conference negotiations in Uganda (2010-2013) BLG research fellowship to examine contradictions of international criminal law (2010-11) Member of editorial boards or committees of the Journal of International Criminal Justice, Criminal Law Forum and the Transitional Justice Review Law Students' Society Teaching Award (2011) Recent Publications: Books An Introduction to International Criminal Law and Procedure, 3rd Edition (Cambridge University Press, 2014) (with Robert Cryer, Håkan Friman and Elizabeth Wilmshurst) Articles \"A Justification of Command Responsibility\", Criminal Law Forum (2017) “The Tribunals and the Renaissance of International Criminal Law: Three Themes” (with Gillian MacNeil), 110 American Journal of International Law (2016) “Inescapable Dyads: Why the ICC Cannot Win”, 28 Leiden Journal of International Law (2015) 323 “International Criminal Law as Justice”, 11 Journal of International Criminal Justice (2013) 699 “A Cosmopolitan Liberal Account of International Criminal Law”, 26 Leiden Journal of International Law (2013) 127 “How Command Responsibility Got So Complicated: A Culpability Contradiction, Its Obfuscation, and a Simple Solution” 13Melbourne Journal of International Law (2012) “Three Theories of Complementarity: Charge, Sentence or Process?” 53 Harvard International Law Journal Online (2012) 165 “The Controversy over Territorial State Referrals and Some Reflections on ICL Discourse”, 9 Journal of International Criminal Justice (2011) 355-384 Book Chapters “Crimes Against Humanity: A Better Policy on ‘Policy’” in Carsten Stahn, ed, The Law and Practice of the International Criminal Court (Oxford University Press 2014) \"The Inaction Scenario: Neglected Words and Missed Opportunities\" in Carsten Stahn and Mohamed El Zeidy, eds, The International Criminal Court and Complementarity: From Theory to Practice (Cambridge University Press 2010) Legal Submissions Amicus Curiae Submissions of Professors Robinson, de Guzman, Jalloh and Cryer on Crimes Against Humanity (Cases 003 and 004) (Extraordinary Chambers in the Courts of Cambodia, 2016) Amicus Curiae Observations of Professors Robinson, deGuzman, Jalloh and Cryer (International Criminal Court Appeals Chamber, 2013) Associate Dean (Graduate Studies and Research), Professor LLB (Western) LLM (NYU) Room 523, 128 Union Street 613-533-6000 ext. 75827 darryl.robinson@queensu.ca SSRN Teaching and Research Topics International Criminal Law Legal & Political Thought Offices, Clinics and Programs Administration Directory Teams and Committees Leadership Team",
    "listed_research_areas":"International Criminal Law; Legal & Political Thought"
  },
  {
    "faculty":"queens",
    "name":"Don Stuart",
    "title":null,
    "email":"stuartd@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/don-stuart",
    "bio":"Don Stuart was appointed to Queen’s in 1975. Prior to that he taught law at the University of the Witwatersrand in South Africa, Osgoode Hall Law school from 1970-1971 and the University of Alberta from 1971-1974. He holds B.A. and LL.B. degrees from the University of Natal, South Africa. As a Rhodes Scholar he gained a Diploma in Criminology from Cambridge University and a D.Phil. from Oxford University, in 1973. Most of his teaching has been in the areas of Criminal Law, Criminal Procedure and Evidence. He has authored textbooks on substantive law and on the Charter of Rights and Freedoms and has co-authored three teaching books. He has been Editor-in-Chief of the Criminal Reports (a national reporting and comment service) since 1982, and Editor of the National Judicial Institute’s Criminal Essentials e-letter (going to over 1000 judges) since 2000. He was Crown Attorney in Toronto from 1988-1989. He has appeared twice in the Supreme Court of Canada. For twenty five years, he was a Board Member and sometimes President of the John Howard Society of Kingston. Current Research Editor, Criminal Reports (national reporting and annotation service) since 1982. Editor, N.J.I. Criminal Essentials e-letter since 2000 Professional Achievements Stan Corbett Award for Teaching Excellence 2017 Criminal Lawyers Assoc., G. Arthur Martin Medal for Criminal Justice, 2012 Law Student Society Teaching Awards 2005, 2009, 2010 Phil Baker Award for Contributions to Criminal Justice in Kingston 2008 Ontario Bar Association, Mundell Medal for legal writing 2007 Presentations against Anti-terrorism Bill C-36 at Parliamentary committees, and at symposiums held at University of Toronto Law School, Law Society of Upper Canada and Ontario Bar Association, Law Union and Canadian Institute for Administration of Justice Sopinka Advocacy lecture at Criminal Lawyers' Association (2001) 1998 Canadian Association of Law Teachers' Award for Academic Excellence Selected Recent Publications Textbooks Canadian Criminal Law: A Treatise (8th ed., 2020) (ThomsonReuters) Charter Justice in Canadian Criminal Law (7th ed., 2018) (ThomsonReuters) Casebooks Learning Canadian Criminal Law (with S.Coughlan) (15th ed., 2021) (ThomsonReuters) Learning Canadian Criminal Procedure (with T. Quigley) (13 ed., 2019) ( ThomsonReuters) Evidence. Principles and Problems (with D. Tanovich and L. Dufraimont) (13th ed., 2021) (ThomsonReuters) Articles \"Le: Racialized Context Relevant to Backyard Detention\" (2019) 54 Criminal Reports (7th) 433 The Supreme Court Adds Unjust Rigidity to Rape Shield Protection\" (2019) 55 Criminal Reports (7th) 292 \"Mandatory Alcohol ASD Test without Reasonable Suspicion Should Be Held Unconstitutional\" (2018) 45 Criminal Reports (7th) 264 \"Barton: Sexual Assault Trials Must be Fair not Fixed\" (2017) 35 Criminal Reports (7th) 438 Oxford Handbook of the Canadian Constitution, chapter 38 “The Charter and Criminal Justice” 795-814 “Pragmatism and Inconsistency from the Supreme Court on Mandatory Minimums” (2016) 27 Criminal Reports. (7th) 245 “Ghomeshi: Dangers in Overreacting to this High Profile Acquittal” (2016) 27 Criminal Reports (7th) 45 “Anderson: Continuing a Questionable March to Legal Immunity for Crown Attorneys” (2014) 11 Criminal Reports (7th) 26 “ Bedford: Striking Down Prostitution Laws and Revising Section 7 Standards to Focus on Arbitrariness”, (2014) 7 Criminal Reports (7th) 1 “The Supreme Court Strangles the Defence of Provocation”, (2013) 5 C.R. (7th) 249 Vagueness, Inconsistency and Less Respect for Charter Rights of Accused at the Supreme Court in 2012-2013 - (2013) 63 Supreme Court Law Review 441 The Charter Balance Against Unscrupulous Law and Order Politics\" in Berger and Stribopoulos (ed.), Unsettled Legacy. Thirty Years of Criminal Justice under the Charter (2012, Lexis Nexis) \"Criminal Justice - More Kudos than Brickbats\" in The McLachlin Court's First Decade (Irwin Law, 2010) \"Welcome Flexibility and Better Criteria from the Supreme Court of Canada for Exclusion of Evidence Obtained in Violation of the Canadian Charter of Rights and Freedoms\", (2010) 16 Southwestern Journal of International Law 101 \"A Case for a General Part: Lessons from Canada's Experience\", (2009) 20 Criminal Law Forum 113. \"Threats to Charter Rights of Accused in Making Test for Exclusion of Evidence Under Section 24(2) More Flexible\", (2007) 49 C.R. (6th) 282. \"The Charter is a Vital Living Tree Not A Weed to be Stunted - Justice Moldaver has Overstated\", (2006) 40 Criminal Reports (6th) \"Avoiding the Myths and Challenging Minister of Justice Cotler to Undo the Injustices of Our Anti-Terrorism Laws\", (2005) 51 Criminal Law Quarterly 11-26. \"Zigzags on Rights of Accused: Brittle Majorities Manipulate Weasel Words of Dialogue, Deference and Charter Values\" (2003) 20 Supreme Court Law Review 267-296. \"The Anti-Terrorism Bill (Bill C-36): An Unnecessary Law and Order Fix that Permanently Stains the Canadian Criminal Justice System\" published in (2002) 2 National Journal of Constitutional Law and in Terrorism, Law and Democracy (2002, Les Editions Themis). \"Time to Recodify Criminal Law and Rise Above Law and Order Expediency: Lessons from the Manitoba Warriors Prosecution\" (2001) Manitoba L.J. 89. \"Supporting General Principles for Criminal responsibility in the Model Penal Code with Suggestions for Reconsideration. A Canadian Perspective\" (2000) 4 Buffalo Crim.Law.Rev. 13. \"Chief Justice Antonio Lamer: An Extraordinary Judicial Record of Reform of the Canadian Criminal Justice System\", (2000) 5 Can.Crim. L.Rev. 51. BA, LLB (Natal) Dipl. in Criminology (Cambridge) DPhil (Oxford) Room 502, 128 Union Street 613-533-6000 ext. 74272 stuartd@queensu.ca Teaching and Research Topics Criminal Law Criminal Procedure",
    "listed_research_areas":"Criminal Law; Criminal Procedure"
  },
  {
    "faculty":"queens",
    "name":"Christine Sypnowich",
    "title":null,
    "email":null,
    "href":"https:\/\/law.queensu.ca\/directory\/christine-sypnowich-professor-philosophy-department-head-cross-appointed-to-faculty-of-law",
    "bio":"Education BA, University of Toronto MA, University of Toronto DPhil, Oxford University Specializations \/ Research Interests Political Philosophy, Philosophy of Law, Feminist Philosophy Personal Website About Christine Sypnowich found her path to political philosophy when she encountered the work of C.B. Macpherson at the University of Toronto, where she completed her first two degrees before taking up a Commonwealth Scholarship to do a doctorate at Balliol College, Oxford. Sypnowich has held teaching appointments at Oxford University, Leeds University, Leiden University, University of California (San Diego), and York University, before coming to Queen’s. She has been awarded visiting fellowships at the Australian National University, Corpus Christi College, Oxford, and All Souls College, Oxford. She is also a Fellow of the Royal Society of Canada. Christine Sypnowich’s early work was in the philosophy of law, particularly the possibility of socialist legality given the Marxist antipathy to law. This was the subject of her first monograph published with OUP, a revised version of her Oxford dissertation. More recently her research has centred on egalitarianism, making the case for a human flourishing approach to equality in Equality Renewed: Justice, Human Flourishing and the Egalitarian Ideal (Routledge 2018). She has published over 60 essays as journal articles or book chapters. Her work has been translated into Chinese, Russian and Spanish and abridged versions published in accessible formats such as textbooks and popular philosophy. She is currently completing a book on the philosophy of G.A. Cohen for Polity Press. Active in the city of Kingston as an advocate for transparency at City Hall as well as heritage conservation, Sypnowich is also working on a monograph on the political philosophy of cultural heritage. Monographs Equality Renewed: Justice, Human Flourishing and the Egalitarian Ideal (Routledge, 2017; in paperback 2018) The Concept of Socialist Law (Oxford University Press, 1990; translated into Chinese, 2017) Monographs under contract ‘G.A. Cohen: Liberty, Equality and Justice’, commissioned in 2017 by Polity Press, Cambridge, for ‘Key Contemporary Thinkers’ series. ‘Why It’s OK to be a Socialist’, book project commissioned in 2020 by Routledge. Edited Books \/ Collections (ed. with Andrée-Anne Cormier) Family Values and Social Justice, Routledge, London, 2018. (ed. with Robert Cardwell and Barb Carr) Barriefield: Two Centuries of Village Life, Quarry Press, Kingston, 2015. The Egalitarian Conscience: Essays in Honour of G.A. Cohen, Oxford University Press, Oxford, 2006. (ed. with David Bakhurst) The Social Self, Sage Publications, London, 1995. Edited Journal Issues (with Andrée-Anne Cormier) Critical Review of International Studies in Social and Political Philosophy special issue on Harry Brighouse and Adam Swift, Family Values (Princeton University Press, 2015), 2017. DOI: 10.1080\/13698230.2017.1398447 Selected Journal Articles 'The Demands of Equality’, Social Philosophy & Policy, 39, 2, Winter 2022 (forthcoming). ‘What’s Wrong with Equality of Opportunity’, Philosophical Topics, Fall 2021 (forthcoming). ‘Monuments and Monsters: Education, cultural heritage and sites of conscience’, Journal of the Philosophy of Education, June 2021. ‘Lessons from Dystopia: Critique, Hope and Political Education,’ paper commissioned for a special issue of the Journal of the Philosophy of Education, 52, 4, March 2019, pp. 660-676. ‘Flourishing Children, Flourishing Adults: Families, Equality and the Neutralism-Perfectionism Debate,’ Critical Review of International Studies in Social and Political Philosophy 21, 3, November 2017, pp. 314-332. ‘What’s Left in Egalitarianism? Marxism and the Limitations of Liberal Theories of Equality,’ Philosophy Compass, August 2017; DOI: 10.1111\/phc3.12428, pp. 1-10. ‘G.A. Cohen’s Socialism: Scientific but also Utopian,’ Socialist Studies, 8, 12, 2012, pp. 20-34. ‘The Culture of Citizenship,’ Politics and Society, 28, 4, Autumn 2000, pp. 531-555. ‘How to Live the Good Life: William Morris’s Aesthetic Conception of Equality,’ Queen’s Quarterly, 107, 3, 2000, pp. 391-411. ‘Some Disquiet About Difference,’ Praxis International, 13, 2, August 1993, pp. 99-112. ‘Justice, Community and the Antinomies of Feminist Theory,’ Political Theory 21, 3, August 1993, pp. 484-506. ‘The Future of Socialist Legality: A Reply to Hunt,’ New Left Review, 193, May\/June 1992, pp. 16-24. ‘Fear of Death: Mortality and Modernity in Political Philosophy,’ Queen's Quarterly, 98, 3, 1991, pp. 618-36. ‘The “Withering Away” of Law,’ Studies in Soviet Thought, 33, 4, May 1987, pp. 305-332. ‘Consent, Self-Government and Obligation,’ Praxis International, 6, 3, October 1986, pp. 256-76. Selected Chapters in Books 'The Rule of Law and the Social Ethos’ for Michael Sevel, ed., Routledge Handbook of the Rule of Law, Routledge (forthcoming) ‘Law and the Socialist Ideal’, in ed. P. O’Connell and Umut Ozsu, Elgar Handbook on Law and Marxism, Elgar Publishing (forthcoming). ‘Liberalism, Marxism, Equality and Living Well,’ in Jan Kandiyali (ed.) Reassessing Marx’s Social and Political Philosophy: Freedom, Recognition and Human Flourishing, Routledge 2018, pp. 187-208. ‘Conservatism, Perfectionism and Equality,’ in D. Bakhurst and P. Fairfield (eds), Education and Conversation: Exploring Oakeshott’s Legacy, Bloomsbury, London, 2016, pp. 77-94. ‘Barriefield: A Living History,’ Barriefield: Two Centuries of Village Life (ed. with Robert Cardwell and Barb Carr), Quarry Press, Kingston, 2015, pp. 194-219. ‘A New Approach to Equality,’ in Roberto Merrill and Daniel Weinstock (ed.) Political Neutrality: A Re-evaluation, Palgrave Macmillan, London 2014, pp. 178-209. ‘The Left and Wrongs: Marxism, Law and Torts,’ in The Impact of Ideas on Legal Development, Vol. 7, Comparative Studies in the Development of the Law on Torts in Europe, edited by Michael Lobban and Julia Moses, Cambridge University Press, Cambridge 2012, pp. 150-166. ‘Begging,’ in The Egalitarian Conscience, Oxford University Press, Oxford, 2006, pp. 177-194. ‘Cosmopolitans, Cosmopolitanism and Human Flourishing,’ in G. Brock and H. Brighouse (eds.) The Political Philosophy of Cosmopolitanism, Cambridge University Press, 2005, pp. 55-74. ‘Egalitarianism Renewed,’ in R. Beiner and W. Norman (eds.), Canadian Political Philosophy at the Turn of the Century: Exemplary Essays, Oxford University Press 2000, pp. 118-30. ‘Utopia and the Rule of Law,’ in D. Dyzenhaus (ed.), Re-crafting the Rule of Law: the Limits of Legal Order, Hart Publishing, Oxford, 1999, pp. 178-95. Selected Reviews & Review Essays Review of Matthew Kramer, Liberalism with Excellence, in Ethics, April 2019 'Citizens of the World' (review essay of Brooke A. Ackerly, Universal Human Rights in a World of Difference, Daniele Archibugi, The Global Commonweath of Citizens: Toward Cosmopolitan Democracies, David A. Crocker, Ethics of Global Development: Agency, Capability and Deliberative Democracy, and Dora Kostakopoulou, The Future Governance of Citizenship), in Political Theory, 2010. 'Taking Britain’s Human Rights Act Seriously' (review essay of Conor Gearty, Principles of Human Rights Adjudication), in University of Toronto Law Journal, 2008. 'Ruling or Overruled? The People, Rights and Democracy' (review essay of Will Waluchow, A Common Law Theory of Judicial Review: The Living Tree), in Oxford Journal of Legal Studies, 2007. 'Equality: From Marxism to Liberalism (and Back Again)' (review essay of G.A. Cohen, If You’re an Egalitarian, How Come You’re So Rich?), in Political Studies Review, 2003. 'Race, Culture and the Egalitarian Conscience', (review essay of K.A. Appiah and A. Gutmann, Color Conscious), in Canadian Journal of Philosophy, 1999. 'Social Justice and Legal Form' (review essay of D. Dyzenhaus, Hard Cases and Wicked Legal Systems), in Ratio Juris 1994. 'Law as a Vehicle of Altruism' (review essay of Tom Campbell, The Left and Rights), in Oxford Journal of Legal Studies, 1985. Encyclopedia Entries ‘Steven Lukes’, Encyclopaedia of Political Thought, Wiley 2014. ‘Socialist Law’, The Philosophy of Law: An Encyclopaedia, Garland, New York, 1999. ‘Law and Ideology’, Stanford Encyclopaedia of Philosophy, 2005; revised 2010; 2014; 2019. Work in Progress ‘A Political Philosophy of Cultural Heritage’ (monograph) Media ‘Backyard Ethics: Defending the NIMBY’, The Philosopher’s Zone, Australian Broadcasting Corporation radio programme, 1 July 2018; repeated 13 January 2019: broadcast on CBC Radio on 13 January 2019. ‘Christine Sypnowich’, Into the Coast internet interviews of philosophers, 2019 ‘Christine Sypnowich,’ interview with Christina Decarie, Profile Kingston, 2017. ‘The Concept of Socialist Law – internet Interview with Christine Sypnowich by Jack Marsh,’ Rebel News, 2015 ‘Unreliable Friends’ letter in London Review of Books 16 March 2000. Member of a 3-philosopher panel (with Will Kymlicka and Arthur Ripstein) on a 1-hour programme discussing ‘The Public Good’ with Lister Sinclair, Ideas, CBC Radio, 1996. Also a number of interviews about my advocacy work in the city of Kingston on issues such as heritage conservation, school closures, democracy and transparency at City Hall, in the local press such as the Kingston Whig Standard, as well as Global TV News, CBC Radio (Ontario Morning, All in a Day). Teaching Phil 153 The State and the Citizen Phil 257 Ethics Phil 271 Philosophy and Literature Phil 318 Philosophy of Law Also senior undergraduate and graduate seminars in Political Philosophy and Philosophy of Law, on such subjects as equality, human flourishing, socialism, G.A. Cohen’s philosophy, the rule of law. I am currently supervising 2 PhD students, 3 MA students.",
    "listed_research_areas":null
  },
  {
    "faculty":"queens",
    "name":"Jean Thomas",
    "title":"Associate Professor",
    "email":"jean.thomas@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/jean-thomas",
    "bio":"Jean Thomas is an Associate Professor at Queen’s Law. She is joint convenor of the Colloquium in Legal and Political Philosophy. She is a graduate of the University of Toronto with a Master of Arts in English Literature and a Juris Doctor, as well as of New York University, with a Master of Laws and a doctorate in law. Prior to joining Queen’s, Professor Thomas was a Post-doctoral Fellow at Stanford University’s McCoy Center for Ethics in Society and a Max Weber Fellow at the European University Institute. Research Questions at the intersection of Ethics, Meta-Ethics, and the Philosophy of Law: The nature of rights Private law theory, especially tort theory The effect of coercion on law’s normativity The nature of cultural norms Human rights Publications: For a full list of publications and other information, please see Professor Thomas' CV. Books: Public Rights, Private Relations, Oxford University Press, 2015. (Hard copy | Oxford Scholarship Online) Reviewed: 2016 79(5) The Modern Law Review 924-929 2016 7(2) Jurisprudence 355-364 2016 78(2) Review of Politics 337-339 2016 4 Political Studies Review 2016 35(5) Law and Philosophy Articles and Book Chapters: Jean Thomas(2020)Thinking in three dimensions: theorizing rights as a normative concept, Jurisprudence, DOI: 10.1080\/20403313.2020.1782588 “Our Rights But Whose Duties? Re-conceptualizing Rights in the Era of Globalization” in Boundaries of State, Boundaries of Rights: Human Rights, Private Actors, and Positive Obligations. Cambridge University Press, 2016. ‘Which Interests Should Tort Protect?’ 61 Buffalo Law Review 1 2013 [SSRN Associate Professor BA (Hons.), MA, JD (Toronto) LLM, PhD (NYU) Room 522, 128 Union Street 613-533-6000 ext. 77310 jean.thomas@queensu.ca CV Teaching and Research Topics Human Rights Law Legal & Political Thought Philosophy of Law Torts",
    "listed_research_areas":"Human Rights Law; Legal & Political Thought; Philosophy Of Law; Torts"
  },
  {
    "faculty":"queens",
    "name":"Sabine Tsuruda",
    "title":"Assistant Professor",
    "email":"sabine.tsuruda@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/sabine-tsuruda",
    "bio":"Sabine Tsuruda is an Assistant Professor at Queen’s Law. She graduated from the Joint JD\/PhD Program in Law and Philosophy at UCLA, where she studied as a Charlotte W. Newcombe Doctoral Dissertation Fellow and served as a Senior Editor of the UCLA Law Review. Prior to joining Queen’s, she was a Predoctoral Fellow in Law and Philosophy at UCLA. She also holds a BA in Political Science and a MA in Philosophy from Stanford University. Research Tsuruda’s research addresses issues in legal doctrine that concern social equality and moral agency. Current research interests include: Employees’ speech and associational rights The morality of legal norms of managerial control Equality in religious workplaces Contract law and distributive justice Selected Publications For a full list of Professor Tsuruda's publications, please consult her CV. Cooperative Production, in WORKING AS EQUALS (Julian Jonker & Grant Rozeboom, eds., forthcoming 2022) Disentangling Religion and Public Reason: An Alternative to the Ministerial Exception, 106 CORNELL L. REV. 101 (2021) Working as Equal Moral Agents, 26 LEGAL THEORY 305 (2020) Volunteer Work, Inclusivity, and Social Equality, in PHILOSOPHICAL FOUNDATIONS OF LABOUR LAW (Hugh Collins, Gillian Lester & Virginia Mantouvalou eds., 2018) The Moral Burdens of Temporary Farmwork, in THE OXFORD HANDBOOK OF FOOD ETHICS (Anne Barnhill, Mark Budolfson & Tyler Doggett eds., 2018) Contract, Power, and the Value of Donative Promises, 69 S.C. L. REV. 2 (2017) Assistant Professor BA, MA (Stanford) JD, PhD (UCLA) Room 525, Mackintosh-Corry 613-533-6000 x77771 sabine.tsuruda@queensu.ca SSRN CV Teaching and Research Topics Contracts Labour & Employment Legal & Political Thought Philosophy of Law",
    "listed_research_areas":"Contracts; Labour & Employment; Legal & Political Thought; Philosophy Of Law"
  },
  {
    "faculty":"queens",
    "name":"Ashwini Vasanthakumar",
    "title":"Associate Professor and Queen’s National Scholar in Legal and Political Philosophy",
    "email":"ashwini.vasanthakumar@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/ashwini-vasanthakumar",
    "bio":"Ashwini Vasanthakumar is an Associate Professor and Queen’s National Scholar in Legal and Political Philosophy at Queen’s Law School. She holds an A.B from Harvard; an M.A from the University of Toronto; a J.D from Yale Law School; and a DPhil from Oxford, where she studied as a Canadian Rhodes Scholar. Prior to Queen’s, she held positions at King’s College London, University of York, University of Oxford, and Jindal Global Law School. She is a researcher at the Institute for Futures Studies (Stockholm) and will be a Visiting Fellow at the Centre for Fundamental Rights at the Hertie School (Berlin). Vasanthakumar’s research explores political authority, membership, and obligation. Her monograph, The Ethics of Exile: a political theory of diaspora, will be published by Oxford University Press in late 2021. Current research projects include: privatization and legitimacy in border control, victims’ duties to resist their oppression, and transitional justice as transnational justice. Her research has been supported by a SSHRC Insight Development Grant, a British Academy Rising Star Award, the Swedish Research Council and the Wallenberg Foundation. Research foci Analytic political and legal theory, especially: Political obligation and authority Migration and transnationalism Ethics of resistance Recent publications For a full list of publications, please see ashwinivasanthakumar.com The Ethics of Exile: a political theory of diaspora (2021)[Oxford Academic] ‘Outsourcing Border Control: Public agency and action in migration,’ Cambridge Handbook on Privatization (ed. A. Dorfman and A. Harel) (2021) [Cambridge Core] ‘Recent Debates on Victims’ Duties to Resist their Oppression,’ Philosophy Compass (2020) [Philosophy Compass] ‘Privatising border control,’ Oxford Journal of Legal Studies (2018) [Oxford Academic] ‘Epistemic Privilege and Victims’ Duties to Resist their Oppression,’ Journal of Applied Philosophy (2016) [JAPP] reviewed in Eric Miller, It gets worse before it gets better: victims’ duties to resist injustice, Jotwell [Jotwell] interview with David Edmonds, ‘Do victims have obligations too?’ Philosophy247 podcast [Philosophy247] ‘Exile Political Representation,’ Journal of Political Philosophy (2016) [JOPP] Associate Professor and Queen’s National Scholar in Legal and Political Philosophy AB (Harvard) MA (Toronto) JD (Yale) DPhil (Oxford) Room 548, Sutherland Hall ashwini.vasanthakumar@queensu.ca SSRN Teaching and Research Topics Contracts Legal & Political Thought Philosophy of Law",
    "listed_research_areas":"Contracts; Legal & Political Thought; Philosophy Of Law"
  },
  {
    "faculty":"queens",
    "name":"Grégoire Webber",
    "title":"Canada Research Chair in Public Law and Philosophy of Law",
    "email":"gregoire.webber@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/gregoire-webber",
    "bio":"Grégoire Webber is Canada Research Chair in Public Law and Philosophy of Law at Queen’s Law and is cross-appointed to the Department of Philosophy. His research is in the areas of human rights, public law, and philosophy of law. Professor Webber is a graduate of McGill University with bachelors of civil law and common law and of the University of Oxford with a doctorate in law, where he studied as a Trudeau scholar. He clerked for Justice Ian Binnie of the Supreme Court of Canada and, as a student, for Justice André Rochon of the Quebec Court of Appeal. Professor Webber previously worked as a senior policy advisor with the Privy Council Office and as Legal Affairs Advisor to the Attorney General of Canada and Minister of Justice, the Honourable Jody Wilson-Raybould, PC, KC. He is currently legal agent of the Department of Justice (Canada), providing legal advice on key files. Professor Webber is joint founder and Executive Director of the Supreme Court Advocacy Institute, which provides free advocacy advice to counsel appearing before the Supreme Court of Canada in more than two-thirds of appeals. In relation to his role in co-founding the Institute, he was awarded a Meritorious Service Medal by the Governor General of Canada for increasing \"the effectiveness and the quality of advocacy before the Court\" and for improving \"access to justice for all Canadians\". Professor Webber is Visiting Senior Fellow at the London School of Economics and Political Science and has held visiting appointments at the Université Panthéon-Assas (Paris II) and the University of Oxford. He is joint convenor of the Queen's Colloquium in Legal and Political Philosophy. Research Foundational questions in human rights, public law, and the philosophy of law, including: the nature of rights; the political constitution; the relationship between positive law and human rights; and foundations of law and government. Recent Professional Achievements Appointed Villey Fellow, Institut Michel Villey, Université Panthéon-Assas (Paris II), 2023 Appointed Visiting Researcher, St John's College, University of Oxford, 2023 Appointed Full Professor of Law, 2020- Appointed to the Royal Society of Canada's College of New Scholars, Artists and Scientists, 2019- Cross-appointed to the Department of Philosophy, 2018- Appointed legal agent of the Department of Justice, 2017- Appointed Legal Affairs Advisor to the Minister of Justice and Attorney General of Canada, 2016-2017 Awarded a Meritorious Service Medal by the Governor General of Canada, 2015 Appointed Visiting Senior Fellow, London School of Economics and Political Science, 2015- Select Publications For a complete list of publications and other information, please see Professor Webber's CV and Google Scholar profile. Books Droits et droit (Montréal: Les Éditions Thémis, 2020) [Thémis] Legislated Rights: Securing human rights through legislation (New York: Cambridge University Press, 2018; paperback edition, 2019) (jointly authored with P. Yowell, R. Ekins, M. Köpcke, F.J. Urbina, and B.W. Miller) [CUP] [SSRN] The Negotiable Constitution: On the Limitation of Rights (Cambridge: Cambridge University Press, 2009; paperback edition 2012) [CUP] [SSRN] Edited collections Constitutional Dialogue: Rights, Democracy, Institutions (New York: Cambridge University Press, 2019; paperback edition, 2020) (edited with G. Sigalet and R. Dixon) [CUP] [SSRN] Proportionality and the Rule of Law: Rights, Reasoning, Justification (New York: Cambridge University Press, 2014; paperback edition, 2016) (edited with G. Huscroft and B.W. Miller) [CUP] [SSRN] Articles \"What Oakes should have said (or how to read a limitations clause)\" (2023) _ Supreme Court Law Review (2d) (forthcoming) [SSRN] \"Notwithstanding rights, review, or remedy? On the notwithstanding clause and the operation of legislation\" (2021) 71 University of Toronto Law Journal 510-538 [UTLJ] [SSRN] \"A conservative disposition and constitutional change\" (2019) 39 Oxford Journal of Legal Studies 526-552 (with G. Gee) [OJLS] \"Loyal Opposition and the political constitution\" (2017) 37 Oxford Journal of Legal Studies 357-382 [OJLS] [SSRN] \"Asking why in the study of human affairs\" (2015) 60 American Journal of Jurisprudence 51-78 [AJJ] [SSRN] \"Rationalism in public law\" (2013) 76 Modern Law Review 708-734 (with G. Gee) [MLR] [SSRN] \"What is a political constitution?\" (2010) 30 Oxford Journal of Legal Studies 273-299 (with G. Gee) [OJLS] [SSRN] Chapters in edited collections \"Opposition\" in The Cambridge Handbook of Constitutional Theory (Richard Bellamy and Jeff King, eds, Cambridge: Cambridge University Press, forthcoming) [SSRN] \"Can the constitution of a fruit fly be written?\" in From morality to law and back again: Liber amicorum for John Garder (Michelle Dempsey and François Tanguay-Renaud, eds, Oxford: Oxford University Press, forthcoming) [SSRN] \"Proportionality and limitations on freedom of speech\" in The Oxford Handbook of Freedom of Speech (Frederic Schauer and Adrienne Stone, eds, Oxford: Oxford University Press, 2021) [OUP] [SSRN] \"Proportionality and absolute rights\" in Proportionality: New Frontiers, New Challenges (Vicki Jackson and Mark Tushnet, eds, New York: Cambridge University Press, 2017) [CUP] [SSRN] Media \"The faulty received wisdom around the notwithstanding clause\" (with R. Leckey and E. Mendelsohn), IRPP Policy Options (2019) [IRPP] [en français] \"The Charter Party and the work of government\", IRPP Policy Options (2016) [IRPP] \"The two party system is imperfect, but more effective\", The New York Times: Room for Debate (2015) [NYT] \"The current British election system holds parties and candidates to account\", The New York Times: Room for Debate (2015) [NYT] \"Chartes des valeurs québécoises : Où sont les bombes, Madame Marois?\", Le Devoir (2013) [Devoir] Canada Research Chair in Public Law and Philosophy of Law BCL, LLB (McGill) DPhil (Oxford) Room 525, 128 Union Street 613-533-6000 ext. 78210 gregoire.webber@queensu.ca SSRN CV Twitter Teaching and Research Topics Charter of Rights and Freedoms Constitutional Law Human Rights Law Legal & Political Thought Philosophy of Law Public Law",
    "listed_research_areas":"Charter Of Rights And Freedoms; Constitutional Law; Human Rights Law; Legal & Political Thought; Philosophy Of Law; Public Law"
  },
  {
    "faculty":"queens",
    "name":"Jacob Weinrib",
    "title":"Associate Professor",
    "email":"jacob.weinrib@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/jacob-weinrib",
    "bio":"Jacob Weinrib is an Associate Professor at the Queen’s Faculty of Law. He graduated from the Combined JD\/PhD Program in Law and Philosophy at the University of Toronto, where he studied as a Vanier Scholar and received the David Savan Dissertation Prize. Before joining Queen’s Law, he held a SSHRC Postdoctoral Fellowship at the New York University School of Law as a Global Hauser Research Fellow in the Center for Constitutional Transitions (2013-4) and as a Dworkin-Balzan Fellow in the Center for Law and Philosophy (2014-2015). Weinrib is the author of Dimensions of Dignity: The Theory and Practice of Modern Constitutional Law (Cambridge: Cambridge University Press, 2016). He is currently working on two major projects. The first, which is supported by a SSHRC Insight Development Grant, formulates a rights-based account of the theoretical foundations of administrative law. The second is a short book entitled Rights, Limits, and Proportionality: A Short Guide for the Perplexed (under contract with Cambridge University Press). Weinrib was the 2018-2019 recipient of the Corbett Award for Teaching Excellence. Research Weinrib’s research lies at the intersection of legal philosophy and public law. His overarching aim is to formulate a unified theory of the normative, institutional, and doctrinal dimensions of public law. Recent Publications Book Dimensions of Dignity: The Theory and Practice of Modern Constitutional Law (Cambridge University Press, Cambridge Studies in Constitutional Law series, 2016). [Amazon] [Cambridge] Reviewed:TRS Allan, (2018) 68.2 University of Toronto Law Journal 312.Pavlos Eleftheriadis, “In Defence of Constitutional Law,” (2018) 81.1 Modern Law Review 154.AEM Leijten, (2017) 4 Tijdschrift voor Constitutioneel Recht 346 Book Symposium, (2020) 11:2 Jurisprudence 243 Articles and Book Chapters< “Maitland's Challenge to Administrative Legal Theory” (2021) 84:2 Modern Law Review 207-229 [SSRN] “The Frank Dissent’s Charter Framework: The Rhetoric and the Reality” (2021) 100 Supreme Court Law Review 85-103 [SSRN] “Dignity’s Constitution: A Reply” (2020) 11(2) Jurisprudence 298-398 (symposium on Dimensions of Dignity) [SSRN] “Dignity and Autonomy” in Rainer Grote, Frauke Lachenmann, and Rüdiger Wolfrum (eds) Max Planck Encyclopedia of Comparative Constitutional Law (Oxford: Oxford University Press) [SSRN] “Rights in Search of Protection” (2020) 40 Oxford Journal of Legal Studies 403-423 [SSRN] “Sovereignty as a Right and as a Duty” in Claire Finkelstein and Michael Skerker (eds) Sovereignty and the New Executive Authority (Oxford: University Press, forthcoming). [SSRN] [Academia.edu] “The Principles of Constitutional Reform” (2019) 24(4) (Special Issue on Kant and Law) Kantian Review 631-651 [SSRN][Academia.edu] “Human Dignity and its Critics” in Jacobsohn and Schor, eds, Comparative Constitutional Theory (Cheltenham: Edward Elgar, 2018) 167-186 [SSRN] [Academia.edu] “When Trumps Clash: Dworkin and the Doctrine of Proportionality” (2017) 30 Ratio Juris 341-352 [SSRN][Academia.edu] [This article has been translated into Spanish: “Cuando las cartas del triunfo chocan: Dworkin y la Doctrina de la Proporcionalidad” in Marcelo Alegre, ed, El imperio de Ronald Dworkin: ensayos de filosofía moral, política y jurídica (Buenos Aires: Departamento de Publicaciones, Facultad de Derecho Universidad de Buenos Aires, 2019) 175-186 [Academia.edu]] “Authority, Justice, and Public Law: A Unified Theory” (2014) 64 University of Toronto Law Journal 703-735 [SSRN] [Academia.edu] “The Modern Constitutional State: A Defense” (2014) 40 Queen’s Law Journal 165-212 [SSRN] cited in R. v. C.P. 2021 SCC 19 at para 116 “What can Kant Teach us about Legal Classification?” (2010) 23:1 Canadian Journal of Law and Jurisprudence 203 [SSRN] “What is the Purpose of Freedom of Expression?” (2009) 67 U.T. Fac. L. Rev. 165, cited in Toronto (City) v. Ontario (Attorney General) 2021 SCC 34 at paras 128, 156 “Kant on Citizenship” (2008) 33 Australian Journal of Legal Philosophy 1 [SSRN] (winner of Australian Society of Legal Philosophy Essay Prize) “The Juridical Significance of Kant’s ‘Supposed Right to Lie’” (2008) 13:1 Kantian Review 141-170 [SSRN] In Progress “What is Purposive Interpretation?” Rights, Limits, and Proportionality: A Short Guide for the Perplexed (under contract with Cambridge University Press) Associate Professor BA, MA, JD, PHD (Toronto) Room 544, Sutherland Hall 613-533-6000 ext.79649 jacob.weinrib@queensu.ca Academia.edu SSRN CV Teaching and Research Topics Constitutional Law Legal & Political Thought Philosophy of Law Public Law",
    "listed_research_areas":"Constitutional Law; Legal & Political Thought; Philosophy Of Law; Public Law"
  },
  {
    "faculty":"queens",
    "name":"Noah Weisbord",
    "title":"Associate Professor",
    "email":"noah.weisbord@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/noah-weisbord-0",
    "bio":"Noah Weisbord is an Associate Professor at Queen's Law. His research focuses on the role of the criminal law in managing, reflecting or exacerbating intergroup conflict. A current project examines self-defence in Canadian criminal law from historical, comparative, and conceptual perspectives. Noah is a leading expert on the crime of aggression—individual criminal responsibility for aggressive war—and he assisted diplomatic delegations to define the crime. His monograph on the crime of aggression was published with Princeton University Press in June 2019. Noah’s scholarly articles have appeared in the McGill Law Journal, Queen’s Law Journal, Harvard International Law Journal, the Columbia Journal of Transnational Law, the Duke Journal of Comparative and International Law, Law and Contemporary Problems and other publications. Noah’s opinion and editorial commentary has been published in the New York Times, the International Herald Tribune, the Globe and Mail and the National Post. Noah received his S.J.D. from Harvard Law School under the supervision of Dean Martha Minow. In addition to an S.J.D., Noah holds LL.B. and B.C.L. degrees, a Master of Social Work (M.S.W.) as well as undergraduate degrees in Psychology (B.Sc.) and Social Work (B.S.W.) from McGill University. Prior to joining Queen’s Law, Noah was an Associate Professor at Florida International University College of Law and a visiting Assistant Professor at Duke Law School. Research: Criminal law Evidence International Criminal Law Comparative Criminal Law Public International Law Law and War Recent Professional Accomplishments: Co-Chair of the Anti-Racism Working Group, 2020-2021. Member of the Council of Advisers on the Application of the Rome Statute of the International Criminal Court to Cyberwarfare, 2019-2021 Publication of The Crime of Aggression: the Quest for Justice in an Age of Drones, Cyberattacks, Insurgents and Autocrats (Princeton University Press, 2019) Keynote Lecture, 2017 Annual McGill Law Graduate Conference, “Self-Defense in Climates of Fear.” Invited expert participating in the activation of International Criminal Court jurisdiction over the crime of aggression alongside genocide, crimes against humanity and war crimes, United Nations Headquarters, 2017 Selected Publications: For a complete list of Professor Weisbord's publications, please consult his CV. Books (Monograph) Noah Weisbord, The Crime of Aggression: the Quest for Justice in an Age of Drones, Cyberattacks, Insurgents and Autocrats (Princeton University Press, 2019) Articles Noah Weisbord, “Licence to Khill: What Appellate Decisions Reveal About Canada’s New Self-Defence Law,” 46(1) Queen’s Law Journal 97 (2020) Noah Weisbord, “Who’s Afraid of the Lucky Moose? Canada’s Dangerous Self-Defence Innovation,” 64(2) McGill Law Journal 349 (2018) (published summer 2020). Noah Weisbord, “A Practitioner’s Bildungsroman: Book Review of Payam Akhavan’s In Search of a Better World: A Human Rights Odyssey,” Journal of Human Rights Practice (July 2019) Noah Weisbord, “Bargaining Practices: Negotiating the Kampala Compromise,” 76 (3) Law & Contemporary Problems, 85 (Winter 2014) Noah Weisbord, “Judging Aggression,” 50(1) Columbia Journal of Transnational Law 82 (Winter 2012) Noah Weisbord & Matthew Smith, “The Reason Behind the Rules: From Description to Normativity in International Criminal Procedure,” 36 North Carolina Journal of International Law and Commercial Regulation 255 (Winter 2011) Noah Weisbord, “The 1990s and the Use of Force: Anxiety, Realignment and New Justifications,” 22 (1) Global Change, Peace & Security 129 (February 2010) Noah Weisbord, “Conceptualizing Aggression,” 20(1) Duke Journal of Comparative and International Law 1 (Fall 2009) Noah Weisbord, “Prosecuting Aggression,” 49 Harvard International Law Journal 168 (Winter 2008) Chapters Noah Weisbord, “Civil Society,” in The Crime of Aggression: A Commentary, Claus Kreß and Stefan Barriga, eds. (Cambridge University Press, 2017) Noah Weisbord and Carla Reyes, “War Crimes,” in International Crime and Justice, Mangai Natarajan, ed. 321 (Cambridge University Press, 2011) Opinion and Editorial Noah Weisbord, “Canada’s self-defence laws are too sweeping, and the Supreme Court just gave them a pass,” The Globe and Mail. Toronto: October 18, 2021 Noah Weisbord, “To deter war in the Gulf and elsewhere, hold leaders personally accountable for aggression,” The Globe and Mail. Toronto: July 12, 2019. Noah Weisbord, “What does the Trump administration want from Iran?” The Conversation. Boston: June 13, 2019. Noah Weisbord, “Canada’s rhetoric about strengthening the international order is at total odds with its actions at the UN,” The National Post. Toronto: June 20, 2017. Noah Weisbord, “Who Started the Fight?” The New York Times (Global Edition). Paris: May 3, 2010. Noah Weisbord, “You’re Under Arrest, Mr. President,” The New York Times (Global Edition). Paris: February 13, 2009: 6 Noah Weisbord, “A Dilemma in Northern Uganda; When Peace and Justice Clash,” International Herald Tribune. Paris: 29 April 2005: 8 Noah Weisbord, “Traditional Justice for a Genocide: Trials in Rwanda,” International Herald Tribune. Paris: 26 September 2003: 8 Associate Professor BSc, BSW, LLB, BCL, MSW (McGill), LLM Program, SJD (Harvard) Room C530, Mackintosh-Corry Hall 613-533-6000 ext.78772 noah.weisbord@queensu.ca SSRN Weisbord Curriculum Vitae Fall 2022.pdf Teaching and Research Topics Criminal Law Evidence International Criminal Law Law and War Public International Law",
    "listed_research_areas":"Criminal Law; Evidence; International Criminal Law; Law And War; Public International Law"
  },
  {
    "faculty":"queens",
    "name":"Robert Yalden",
    "title":"Sigurdson Professor in Corporate Law and Finance",
    "email":"robert.yalden@queensu.ca",
    "href":"https:\/\/law.queensu.ca\/directory\/robert-yalden",
    "bio":"Robert Yalden is the inaugural holder of the Stephen Sigurdson Professorship in Corporate Law and Finance. Prior to joining Queen’s Law in 2018, Robert was a senior partner with Osler, Hoskin & Harcourt LLP and an Adjunct Professor with McGill Law. Robert’s publications and teaching span 30 years. He has focused particularly on the forces that shape competing perspectives (both domestically and internationally) on the roles and responsibilities of corporations, boards of directors and different stakeholders, and that in turn influence the institutional structures that countries put in place to oversee and foster the evolution of business law. After clerking for Justice Bertha Wilson at the Supreme Court of Canada (1989-90), Robert was called to the Bar in Ontario (1991) and Quebec (1992). He joined Osler’s Toronto office in 1993, became a partner in 1998, and was part of the team that opened Osler’s Montreal office in 2001. Fluently bilingual, he served as a member of Osler's Executive Committee, as Co-Chair of Osler’s National Mergers and Acquisitions Group for over a decade and as the head of the Corporate Department in Osler’s Montreal office. Repeatedly recognized as one of Canada’s leading business lawyers during his 25 years in practice, Robert worked closely with senior management teams and boards of directors in shaping some of Canada’s most innovative and ground-breaking transactions. Research: Corporate law Securities law Mergers & Acquisitions Directors’ Duties Corporate Governance Recent Professional Accomplishments: Appointed Co-Editor in Chief of the Canadian Business Law Journal as of January 1, 2022 Awarded SSHRC Grant to explore Democratic legitimacy of rulemaking in Canadian securities law, (August 4, 2021) Speaker, 6th Annual Commercial Law Symposium, October 21, 2022, presenting forthcoming article on “New Perspectives on Good Faith in Contractual Negotiation” Panelist, 2022 Banff Capital Markets Roundtable Conference on “Secondary Market Disclosure”, University of Calgary (November 11-12, 2022) Chair and Speaker, Roundtable on “Dual Class Share Structures: Recent Developments and Emerging Trends”, Queen’s Law, December 11, 2021 Speaker, “Les sociétés unipersonnelles et l’instauration d’un régime simplifié au Québec”, presented at the Colloquium on the 10th Anniversary of the Quebec Business Corporations Act, May 20, 2021, convened by the \"Centre de droit des affaires et du commerce international\", the \"Centre d'études en droit économiques de l'Université Laval\" and the \"Chaire en gouvernance et droit des affaires de l'Université de Montréal\" Panelist, Institute for Corporate Directors’ Panel on: “What Directors Should Know about the Debate on Social Purpose Beyond Profit”, January 14, 2021 (presented by ICD’s B.C. Chapter, in partnership with Calgary & Edmonton Chapters) Speaker, 2019 Organization of American States Workshop on International Business Law and Inclusive Economic Development, University of the West Indies (Cave Hill Campus), March 30, 2019 Speaker, M&A Fall Roundtable 2018, The Program on Ethics in Law and Business, University of Toronto, Faculty of Law, November 2, 2018 Keynote Speaker, 2017 International Conference on Ease of Doing Business, Seoul, Korea, “Protection of Minority Investors in Canada” Selected Publications: For a full list of Professor Yalden's publications, please see his CV. Articles: R. Yalden, “Québec’s Sole Shareholder Regime and the Rise of Simplified Corporations: Innovation, Implementation and the Challenges Ahead”, in 10ième anniversaire de la Loi sur les sociétés par actions du Québec: rétrospective, perspective et prospective, S. Rousseau (ed.), Wilson & Lafleur (2021), pp. 70-96. R. Yalden, \"Stuck at the Crossroads? The Regulation of Defence Strategies in Canadian M&A\" (2020) 63 Canadian Business Law Journal 288. R. Yalden, \"Canadian Mergers and Acquisitions at the Crossroads: The Regulation of Defence Strategies after BCE\" (2014) 55 Canadian Business Law Journal 389. R. Yalden & H.P. Gagnon, “Fusion et acquisition d’une société par actions”, JuriClasseur Québec – Collection droit des affaires – Droit des sociétés, (2022), fascicule 17, LexisNexis. J. Fraiberg & R. Yalden, \"Kerr v. Danier Leather Inc.: Disclosure, Deference and the Duty to Update Forward-Looking Information\", (2006) 43 Canadian Business Law Journal 106. R. Yalden, \"The OSC's Rise and the Legislature's Decline: Securities Law Reform During the Brown Years\", Taking Stock: Challenge and Change in Securities Regulation, (2005) Twelfth Queen's Annual Business Law Symposium, pp. 53-61. R. Yalden, “Competing Theories of the Corporation and their Role in Canadian Business Law”, The Corporation in the 21st Century, (2002) Ninth Queen’s Annual Business Law Symposium, pp. 3-36. R. Yalden, “Controlling the Use and Abuse of Poison Pills in Canada: 347883 Alberta Ltd. v. Producers Pipelines Inc.”, (1992) 37 McGill Law Journal 887. P. Dey & R. Yalden, “Keeping the Playing Field Level: Poison Pills and Directors’ Fiduciary Duties in Canadian Take-Over Law”, (1990) 17 Canadian Business Law Journal 252. Reports: R. Yalden, Dual Class Share Structures: Recent Developments and Emerging Trends (Faculty of Law, Queen’s University, November, 2022) Books: R. Yalden et al., Business Organizations: Practice, Theory and Emerging Challenges, 2nd Ed., Emond (2018) (with J. Sarra, P. Paton, M. Condon, M. Gillen, C. Liao, M. Deturbide, M. Khimji, B. Bryan and G. Campo). R. Yalden et al., Business Organizations: Principles, Policies and Practice, Emond Montgomery (2008) (with J. Sarra, P. Paton, M. Gillen, R. Davis and M. Condon). F. Buckley, M. Gillen & R. Yalden, Corporations: Principles and Policies, 3rd Ed., (1998) Emond Montgomery. Book Reviews: R. Yalden, “Path Dependence, Systemic Will, and the Transformation of Anglo-American Corporate Fiduciary Law” - Review of D. Kershaw’s The Foundations of Anglo-American Corporate Fiduciary Law, (2022) American Journal of Comparative Law (forthcoming). R. Yalden, “Company Law: Theory, Structure and Operation by Brian R. Cheffins”, (1999) 31 Canadian Business Law Journal 479. Recent Opinion, Editorial & Interviews: R. Yalden, Energy sector must move the needle on emissions performance, December 6, 2021 R. Yalden, Global shift to climate-related financial disclosure and sustainable accounting, November 22, 2021 R. Yalden, Yalden examines governance power struggle at Rogers, November 9, 2021 R. Yalden, Entre les droits linguistiques et les droits de la personne, Le Devoir, October 6, 2021 R. Yalden, The perils of resetting the relationship between language rights and human rights, Toronto Star, June 22, 2021 R. Yalden, Canada should embrace Quebec's simple incorporation system for small businesses, The Conversation, April 26, 2021 R Yalden, Québec's Sole Shareholders Regime & Simplified Corporations, Interview on CFRC, April 4, 2021 R. Yalden, “Should Corporate Law Shape Boards of Directors?”, Policy Options (April 12, 2019). R. Yalden, “Does Barrick Gold’s move to B.C. sound the death knell for Canadian director residency requirements?” Canadian Mining Magazine (June 12, 2019). R. Yalden, “What Lessons Does Barrick Gold’s Fate Really Teach Us? ” Globe & Mail (January 6, 2019). Sigurdson Professor in Corporate Law and Finance BA (Hons) (Queen's) MA (Oxford) LLB (Toronto) LLB (Montreal) Room 504, 128 Union Street 613-533-6000 ext. 74965 robert.yalden@queensu.ca Robert M Yalden CV November 2022 Teaching and Research Topics Corporate Finance Corporate Governance Corporate Law Mergers & Acquisitions Securities Regulation",
    "listed_research_areas":"Corporate Finance; Corporate Governance; Corporate Law; Mergers & Acquisitions; Securities Regulation"
  }
]