[
  {
    "faculty":"tmu",
    "name":"Idil Atak",
    "title":"Interim Dean, Academic; Professor",
    "email":"idil.atak@torontomu.ca",
    "href":"https:\/\/www.torontomu.ca\/law\/faculty-and-research\/faculty\/faculty-law\/idil-atak",
    "bio":"Dr. Idil Atak is a professor at the Lincoln Alexander School of Law. Before joining Toronto Met, Idil earned her PhD at Université de Montréal’s Faculty of Law and was a SSHRC postdoctoral fellow at McGill University’s Centre for Human Rights and Legal Pluralism. She currently serves as a director-at-large for the Canadian Association for Refugee and Forced Migration Studies (CARFMS). Idil was a member of the International Association for the Study of Forced Migration’s (IASFM) executive committee and a past president of the CARFMS. She served as Editor-in-Chief of the International Journal of Migration and Border Studies (IJMBS) from 2017 to 2020. Research Interests: Irregular migration, refugee protection, securitization of migration and human rights law",
    "listed_research_areas":"Irregular migration, refugee protection, securitization of migration and human rights law"
  },
  {
    "faculty":"tmu",
    "name":"Ed Béchard-Torres",
    "title":"Assistant Professor",
    "email":null,
    "href":"https:\/\/www.torontomu.ca\/law\/faculty-and-research\/faculty\/faculty-law\/ed-bechard-torres",
    "bio":"Ed Béchard-Torres is an assistant professor in the Lincoln Alexander School of Law. His research focusses on how courts contribute to economic transformation in Colombia, South Africa and India. He is particularly interested in how critical and progressive constitutional projects influence corporate and commercial law. His research also considers how social entrepreneurship can be nurtured in Canadian law. He is broadly interested in the relationship between law and political economy. Prior to joining the Faculty, Béchard-Torres was a Scholar in Residence at New York University’s Center for Human Rights and Global Justice. He is currently completing a DCL at McGill University’s Faculty of Law, where he has taught contract law, and where his research has been supported by a Joseph-Armand Bombardier Canada Graduate Scholarship from the Social Sciences and Humanities Research Council. He holds an LLM from the University of Cambridge, and an LLB and a BCL from McGill. He is from Montreal and is Venezuelan-Canadian. Béchard-Torres clerked for Justice Suzanne Côté at the Supreme Court of Canada, and for Justice Pierre Dalphond at the Quebec Court of Appeal. He has also practiced commercial litigation in leading firms in Quebec, appearing before various levels of court. In 2018, he assisted the amici curiae in the landmark Vavilov and Bell appeals before the Supreme Court. In 2022, Béchard-Torres was appointed by the Honourable Pablo Rodriguez to the Human Rights Expert Panel of the Court Challenges Program (CCP) for a term of 3.5 years. The Expert Panel is responsible for allocating funding to support groundbreaking human rights litigation in cases of national importance. Research Interests: Corporate law; contract law; constitutional law; human rights law; comparative law and legal culture; law and political economy; critical legal studies; legal theory and reasoning; bankruptcy law; administrative law",
    "listed_research_areas":"Corporate law; contract law; constitutional law; human rights law; comparative law and legal culture; law and political economy; critical legal studies; legal theory and reasoning; bankruptcy law; administrative law"
  },
  {
    "faculty":"tmu",
    "name":"Hilary Evans Cameron",
    "title":"Assistant Professor",
    "email":"h.evanscameron@torontomu.ca",
    "href":"https:\/\/www.torontomu.ca\/law\/faculty-and-research\/faculty\/faculty-law\/hilary-evans-cameron",
    "bio":"A former litigator, Hilary Evans Cameron represented refugee claimants for a decade and now holds a doctorate in refugee law from the University of Toronto. A major focus of her work has been the process of judging a refugee claimant’s credibility. Her research brings insights from the social sciences, particularly cognitive psychology, to bear on this central aspect of refugee status decision-making. She has also explored other legal barriers that prevent people without status from accessing the courts and from winning their cases on judicial review. Her interest in clinical legal pedagogy arose from her experience teaching at the legal clinic of the University of Toronto’s Faculty of Law, where she developed a method for involving law students in stopping deportations. She is the author of Refugee Law’s Fact-finding Crisis: Truth, Risk, and the Wrong Mistake (Cambridge 2018) and has written in a number of journals including the International Journal of Refugee Law; Canadian Journal of Administrative Law and Practice; Journal of Law and Social Policy; Canadian Journal of Human Rights; Dalhousie Law Journal; UBC Law Review. Before coming to Toronto Metropolitan University, Evans Cameron was a Social Sciences and Humanities Research Council (SSHRC) postdoctoral fellow at Osgoode Hall Law School, as well as a lecturer at Trinity College in the University of Toronto in the Ethics, Society and Law program. She was the SSHRC’s 2017 Bora Laskin National Fellow in Human Rights Research. Research Interests: Refugee law; administrative law; memory; risk perception; lie detection; logic and legal reasoning; clinical legal education",
    "listed_research_areas":"Refugee law; administrative law; memory; risk perception; lie detection; logic and legal reasoning; clinical legal education"
  },
  {
    "faculty":"tmu",
    "name":"Christopher Campbell-Duruflé",
    "title":"Assistant Professor",
    "email":null,
    "href":"https:\/\/www.torontomu.ca\/law\/faculty-and-research\/faculty\/faculty-law\/christopher-campbell-durufle",
    "bio":"Christopher Campbell-Duruflé’s work focuses on the role of international law in responding to some of the most pressing challenges of our time. He has published on the negotiation of the 2015 Paris Agreement on climate change, appeared before the Senate during the study the Canadian Net-Zero Emissions Accountability Act, and supported discrimination and Indigenous rights litigation within the Inter-American system. His current book project develops a framework of state accountability to analyze the strengths, weaknesses, and gaps of the Paris Agreement’s implementation mechanisms. Prior to joining the Lincoln Alexander School of Law, Campbell-Duruflé was a Banting Postdoctoral Fellow at the University of Cambridge. He remains affiliated as Fellow of the Cambridge Centre for Environment, Energy and Natural Resource Governance (C-EENRG) and member of the C-EENRG Research Series (external link) editorial team. He completed his doctorate at the University of Toronto, during which he attended five rounds of United Nations climate negotiations and volunteered for the delegation of Burkina Faso. His research was funded, among others, by the Pierre Elliott Trudeau Foundation and a Joseph-Armand Bombardier Canada Graduate Scholarship. A graduate of McGill University and the University of Notre Dame, Campbell-Duruflé clerked for the former Chief Justice of the Quebec Court of Appeal (J.J. Michel Robert) and worked at the Inter-American Commission on Human Rights in Washington, D.C. and for Lawyers Without Borders Canada in Colombia. He serves on the legal committee of the Centre québécois du droit de l’environnement (external link) , was judge at the Inter-American Human Rights Moot Court Competition and provided strategic litigation trainings in Guatemala, Honduras, and Jamaica. His profile is part of the Human Rights Defenders exhibit at the Canadian Museum for Human Rights in Winnipeg. Research Interests: International law, environmental law, human rights, climate law, Inter-American human rights system, sustainable development, international relations",
    "listed_research_areas":"International law, environmental law, human rights, climate law, Inter-American human rights system, sustainable development, international relations"
  },
  {
    "faculty":"tmu",
    "name":"Jake Effoduh",
    "title":"Assistant Professor",
    "email":"effoduh@torontomu.ca",
    "href":"https:\/\/www.torontomu.ca\/law\/faculty-and-research\/faculty\/faculty-law\/jake-effoduh",
    "bio":"Jake Effoduh has gained significant expertise in international human rights advocacy at various ranks of domestic, regional, and international legal systems. He has also informed the regulatory frameworks and policy formulation on artificial intelligence (AI) both for supranational organizations and domestic institutions in several countries including the United States, Brazil, and Nigeria. Prior to joining Lincoln Alexander Law, Jake served as Chief Counsel of Africa – Canada AI and Data Innovation Consortium, mobilizing AI and big data techniques to build governance strategies. He is also the project coordinator of Canada’s Rights Role in Sub-Saharan Africa, a multi-year interdisciplinary SSHRC-funded partnership between Canada and several African countries. Jake has held multiple academic fellowships including at the Centre for Law, Technology, and Society at the University of Ottawa; the Harvard Library Innovation Lab of Harvard Law School; the Nelson Mandela School of Public Governance of the University of Cape Town; and the Center for Human Rights Science of Carnegie Mellon University. Jake's research has been at the intersections of international law, human rights, and AI, with some of his works published by the Harvard Human Rights Journal; Oxford University Press; Journal of Robotics, AI & Law; African Journal of Legal Studies; and TWAIL Review. He is the Production Editor of the Transnational Human Rights Review, a peer-reviewed journal on transnational human rights normativity and practices. Jake has delivered lectures at various universities in Canada and at universities in Nigeria, Kenya, South Africa, Germany, Spain, and the UK. As a Vanier Scholar and Ph.D. candidate at Osgoode Hall Law School, Effoduh is examining ways that the legitimization of AI is impacting the pursuit and realization of human rights in Africa, and investigating if the technology will solve or exacerbate the “popular legitimization crises” that activist forces face in the region. Research Interests: Artificial intelligence, technology law, international human rights law, international institutions, international development law, non-profit law, discrimination and identities law, Third World Approaches to International Law (TWAIL). ",
    "listed_research_areas":"Artificial intelligence, technology law, international human rights law, international institutions, international development law, non-profit law, discrimination and identities law, Third World Approaches to International Law (TWAIL). "
  },
  {
    "faculty":"tmu",
    "name":"Scott Franks",
    "title":"Assistant Professor",
    "email":"scott.franks@torontomu.ca",
    "href":"https:\/\/www.torontomu.ca\/law\/faculty-and-research\/faculty\/faculty-law\/scott-franks",
    "bio":"Scott Franks is an assistant professor in the Lincoln Alexander School of Law. His doctoral research investigates the judicial construction of Métis legal identity in the Alberta Métis settlements (University of Ottawa; SSHRC - Doctoral - Joseph-Armand Bombardier). His LLM research investigated barriers and opportunities to the implementation of the Truth and Reconciliation Commission's Calls to Action in law schools (SSHRC CGS-M, CBA Viscount Bennett, York University Graduate Fellowship and Scholarship, and Law Foundation of British Columbia). Franks clerked for the Honorable Madam Justice Andromache Karakatsanis at the Supreme Court of Canada and practised at Olthuis Kleer Townshend L.L.P., a national Indigenous rights law firm. He has a juris doctor from Osgoode Hall Law School and is an alum of McGill University (Political Science) and Lester B. Pearson, United World College of the Pacific. Franks is a citizen of the Manitoba Métis Federation and is from northern Saskatchewan. Franks' research is in the areas of Canadian Aboriginal law, Indigenous legal orders, constitutional law, legal professionalism and ethics, and Indigenous and interdisciplinary research methodologies. He also writes in criminal law and procedure, and in other legal areas relevant to Indigenous-settler relations. Research Interests: Aboriginal Law; Indigenous legal orders; critical Indigenous legal theory; Indigenous and interdisciplinary research methodologies; criminal law and procedure; legal ethics and professionalism",
    "listed_research_areas":"Aboriginal Law; Indigenous legal orders; critical Indigenous legal theory; Indigenous and interdisciplinary research methodologies; criminal law and procedure; legal ethics and professionalism"
  },
  {
    "faculty":"tmu",
    "name":"Sari Graben",
    "title":"Associate Dean Research &amp; Graduate Studies; Associate Professor",
    "email":"sgraben@torontomu.ca",
    "href":"https:\/\/www.torontomu.ca\/law\/faculty-and-research\/faculty\/faculty-law\/sari-graben",
    "bio":"Sari Graben’s teaching and research focuses on Indigenous peoples, with a special focus on regulatory institutions, emergent property systems, and risk. She is the co-editor (with Angela Cameron and Val Napoleon) of the upcoming book, Creating Indigenous Property: Power, Rights, and Relationships (2020), and is published in such journals as the University of Toronto Law Journal, the University of British Columbia Law Review, the Canadian Journal of Law and Jurisprudence, the Leiden Journal of International Law, and the Osgoode Hall Law Journal. Graben currently holds multiple research grants from the Social Sciences and Humanities Research Council of Canada for projects pertaining to Indigenous peoples and development. She has received the President’s Blue and Gold Award for Staff Excellence (2020) for her work as part of the Lincoln Alexander School of Law Start-up Team, as well as the Dean’s Scholarly Research and Creativity Award (2015), and the Best Paper Award from the Canadian Academy of Legal Studies in Business (2018) for her work on Aboriginal Title. Graben has served as an Executive Member of the Aboriginal Law Section of the Ontario Bar Association as well as a Member of the Board of Directors of Interval House (Kingston). She is regularly invited to present to government boards and ministries on risk, regulation, and rights. Prior to joining Lincoln Alexander Law, Graben was counsel at McMillan LLP, adjunct faculty at Queen’s University Faculty of Law, and associate professor at the Ted Rogers School of Management (TRSM). She has been a Social Sciences and Humanities Research Council (SSHRC) postdoctoral fellow at the Faculty of Law, UC (Berkeley), a Canada-U.S. Fulbright Visiting Research Chair at the University of Washington (Seattle). Research Interests: Environmental law, Aboriginal Law, Gender, Resource Development",
    "listed_research_areas":"Environmental law, Aboriginal Law, Gender, Resource Development"
  },
  {
    "faculty":"tmu",
    "name":"Kathleen (Katie) Hammond",
    "title":"Assistant Professor",
    "email":"kathleen.hammond@torontomu.ca",
    "href":"https:\/\/www.torontomu.ca\/law\/faculty-and-research\/faculty\/faculty-law\/kathleen-hammond",
    "bio":"Katie Hammond is an assistant professor in the Lincoln Alexander School of Law. Prior to joining the Faculty, she was a postdoctoral fellow with the Research Group on Health and Law at McGill University’s Faculty of Law and a visiting fellow with the Petrie-Flom Center for Health Law and Policy at Harvard University’s Faculty of Law. She holds a JD and a BCL from McGill University Law School. She completed an MPhil in Multi-Disciplinary Gender Studies and a PhD in Legal Sociology at the University of Cambridge where she was a Gates Cambridge Scholar and a Commonwealth Scholar. Hammond’s research spans across health law and policy, science and technology law, and gender and families. Her research explores the dilemmas – legal and otherwise – that are posed in the wake of new medical technologies and their resulting markets. In particular, she specializes in the area of assisted reproductive technologies (including egg, sperm and embryo donation, surrogacy and egg freezing) and new genetic testing technologies. Her work aims to address these dilemmas by exploring how legal concepts should evolve with our rapidly changing society, and how we can take a more people-oriented approach to law-making. Hammond has held a number of fellowships, including with the Brocher Foundation in Geneva, Switzerland, the Embryo Project at the Center for Biology and Society at Arizona State University, and with the Marine Biological History Project in Woods Hole, Massachusetts. She has been involved with policy development in the area of reproduction for organizations such as the World Health Organization, where she was involved with organizing, and participated in the consultation for the WHO’s first ever glossary and guidelines on infertility. Research Interests: Science and technology law; health law; family law; feminist legal theory; socio-legal studies; social justice; property law; ethics",
    "listed_research_areas":"Science and technology law; health law; family law; feminist legal theory; socio-legal studies; social justice; property law; ethics"
  },
  {
    "faculty":"tmu",
    "name":"Priscylla Joca",
    "title":"Assistant Professor",
    "email":null,
    "href":"https:\/\/www.torontomu.ca\/law\/faculty-and-research\/faculty\/faculty-law\/priscylla-joca",
    "bio":"Priscylla Joca is a legal researcher who is a non-Indigenous Brazilian woman and an immigrant to Canada. She has researched Indigenous rights and laws and socio-environmental issues from international, critical-pluralistic, comparative, and decolonial perspectives. Prior to joining Lincoln Alexander Law, Priscylla was a Social Science and Humanities Research Council of Canada Postdoctoral Fellow at the University of Toronto. Her work, conducted under the supervision of Professor John Borrows, focuses on Indigenous laws, self-determination, and environmental governance. She received her LL.D. from the Université de Montréal (2023). Her thesis focused on free, prior, and informed consent (FPIC) and self-determination, analyzing the legal-political challenges of applying protocols developed by Indigenous peoples and traditional communities to guide consultation and consent processes. Priscylla received her LL.M. in Constitutional Law from the Federal University of Ceara (Brazil, 2011); her dissertation focused on the legal-political strategies developed by Indigenous peoples and traditional communities in their struggles for their collective rights to lands, territories, and resources. In Canada, Priscylla has worked as a lecturer at the Université de Montréal and the Université du Québec en Abitibi-Témiscamingue, teaching Aboriginal Law, Indigenous Legal Traditions, and International Indigenous Issues. Her career began in Brazil, where she worked as a human rights lawyer and lecturer, and continued to work on projects related to Indigenous rights. She has (co-)authored many papers—such as the one “CPLE et protocoles de consultation autochtones au Brésil : trajectoires compares” published in 2019—and co-authored\/co-edited some books, such as “Protocolos Autônomos de Consulta e Consentimento: Um olhar sobre o Brasil, Belize, Canadá e Colômbia [Autonomous Consultation and Consent Protocols: Brazil, Belize, Canada, and Colombia]” published in 2021. Priscylla believes that her role as a legal researcher involves building collaborations and partnerships with Indigenous peoples and organizations who are leading struggles for equality, justice, and self-determination, and who are key actors in developing strategies\/policies to address climate change. In this way, she believes, it may be possible to build a better present and reimagine a (non-dystopian) future for all living beings. Research Interests: Indigenous Rights, Laws, and Legal Traditions; International Indigenous Rights; Human Rights; Law and Environmental Studies; Climate Justice, Environmental Justice, and Environmental Racism; Law and Comparative Studies.",
    "listed_research_areas":"Indigenous Rights, Laws, and Legal Traditions; International Indigenous Rights; Human Rights; Law and Environmental Studies; Climate Justice, Environmental Justice, and Environmental Racism; Law and Comparative Studies."
  },
  {
    "faculty":"tmu",
    "name":"Angela Lee",
    "title":"Assistant Professor",
    "email":"angela@torontomu.ca",
    "href":"https:\/\/www.torontomu.ca\/law\/faculty-and-research\/faculty\/faculty-law\/angela-lee",
    "bio":"Angela Lee joined the Lincoln Alexander School of Law as an Assistant Professor in 2020. She received her JD at the Peter A. Allard School of Law at the University of British Columbia and her PhD from the University of Ottawa's Faculty of Law. As a first-generation immigrant, law school graduate, and academic, she strongly believes in the importance of representation, and is committed to mentoring and supporting those who are similarly situated. Lee’s research interests lie at the intersection of law and policy, technology and innovation, the environment, society, and various forms of justice. Her doctoral work, in which she develops a framework for \"technology justice\" in the context of Canada's agri-food sector, was supported by a number of scholarships and awards, including a Social Sciences and Humanities Research Council of Canada (SSHRC) Doctoral Fellowship, an Ontario Graduate Scholarship, and the University of Ottawa Faculty of Law’s Shirley E. Greenberg Scholarship and Scholarship in Environment and Sustainability. Her recent research examines the state of innovation policy in Canada, arguing that improved understanding and broadened conceptions of innovation are necessary in order to better direct innovation towards shared social and environmental ends. Lee has previously taught courses in Food Law, Animals and the Law, and Contract Law at the University of Ottawa's Faculty of Law and at Dalhousie University's Schulich School of Law, where she was a 2019-2020 Schulich Fellow. She is a co-editor of Food Law and Policy in Canada (Toronto: Carswell, 2019), and her research has been published in numerous peer-reviewed journals, including the UBC Law Review, the Dalhousie Law Journal, the Canadian Journal of Women and the Law, the Windsor Review of Legal and Social Issues, and Canadian Food Studies. She regularly shares her research at national and international fora. She is a board member of the Canadian Law and Society Association and a member of the Canadian Association of Food Law and Policy. Research Interests: Law and technology; food and agriculture law; environmental law; environmental justice; animal law; innovation policy; feminist legal studies; critical race studies; socio-legal studies",
    "listed_research_areas":"Law and technology; food and agriculture law; environmental law; environmental justice; animal law; innovation policy; feminist legal studies; critical race studies; socio-legal studies"
  },
  {
    "faculty":"tmu",
    "name":"Avner Levin",
    "title":"Professor",
    "email":"avner.levin@torontomu.ca",
    "href":"https:\/\/www.torontomu.ca\/law\/faculty-and-research\/faculty\/faculty-law\/avner-levin1",
    "bio":"Avner Levin is a professor at Toronto Metropolitan University’s Law & Business Department. He served as the interim dean of the Ted Rogers School of Management (TRSM) during the first six months of 2018. He is the founding director of Toronto Metropolitan University’s Law Research Centre and of the Privacy and Cyber Crime Institute. During the 2012-2013 academic year, Avner served as Toronto Metropolitan University’s interim vice-provost of faculty affairs and as interim assistant vice-president of Human Resources. Levin’s research interests include the legal profession, law and technology, privacy and cybercrime. He has been a recipient of funding from bodies such as the Social Sciences and Humanities Research Council (SSHRC), the Office of the Privacy Commissioner of Canada, Public Safety Canada, Industry Canada, and the Blavatnik Interdisciplinary Cyber Research Center at Tel-Aviv University. Levin has published his work in journals such as the International Journal of the Legal Profession, the American Business Law Journal, the Canadian Journal of Law and Society, the Canadian Journal of Law and Technology, the International Journal of Information Security and the Journal of Entertainment and Technology Law. He is the co-author, with Mr. Howard Simkevitz of the “The Law of Employee Use of Technology.” Research Interests: Legal regulation and protection of privacy and personal information in various sectors across jurisdictions, both within Canada and internationally",
    "listed_research_areas":"Legal regulation and protection of privacy and personal information in various sectors across jurisdictions, both within Canada and internationally"
  },
  {
    "faculty":"tmu",
    "name":"Alexandra Mogyoros",
    "title":"Assistant Professor",
    "email":"alexandra.mogyoros@torontomu.ca",
    "href":"https:\/\/www.torontomu.ca\/law\/faculty-and-research\/faculty\/faculty-law\/alexandra-mogyoros1",
    "bio":"Alexandra Mogyoros is an assistant professor within the Lincoln Alexander School of Law, and she teaches property law, intellectual property law, and a law and technology seminar. Mogyoros consults with governments, governmental organizations, and non-profit public interest organizations on issues relating to intellectual property policy, law and technology, constitutional law, and freedom of information. She has an interdisciplinary undergraduate degree, with a focus in biology and philosophy, from the University of Guelph and a JD from the University of Ottawa. Mogyoros has a BCL degree with Distinction from the University of Oxford at St. Hugh’s College, and is completing her DPhil in Intellectual Property Law at St. Peter’s College, University of Oxford. Her doctoral research focuses on developing a legal framework to regulate trademarks as brands in light of their public interest functions and is supported by a SSHRC Doctoral Fellowship and a Pierre Elliott Trudeau Foundation Scholarship. Prior to joining Toronto Metropolitan University, Mogyoros held research positions and fellowships at the universities of Toronto, Ottawa, Edinburgh, Cape Town, and Oxford. She also clerked for Justice Thomas Cromwell and Justice Malcolm Rowe at the Supreme Court of Canada. She articled and practised in a litigation boutique in Toronto, and is called to the Ontario bar. Alexandra is an Associate Member of the Centre for Law, Technology and Society at the University of Ottawa. Research Interests: Trademark law; intellectual property; law and technology; private law; brands",
    "listed_research_areas":"Trademark law; intellectual property; law and technology; private law; brands"
  },
  {
    "faculty":"tmu",
    "name":"Uchechukwu Ngwaba",
    "title":"Assistant Professor",
    "email":"uche.ngwaba@torontomu.ca",
    "href":"https:\/\/www.torontomu.ca\/law\/faculty-and-research\/faculty\/faculty-law\/uchechukwu-ngwaba",
    "bio":"Prior to joining the Lincoln Alexander School of Law, Uchechukwu (Uche) Ngwaba worked as a sessional lecturer in three Australian Universities (Macquarie University, Sydney; University of Western Sydney; and Deakin University, Melbourne). His research engages multi-disciplinary, comparative and socio-legal methods in exploring complex questions affecting health governance frameworks in the Global North and South. He draws appropriately from multiple disciplines (law, humanities, economics, medicine, etc.) to redefine problems outside disciplinary boundaries and explore solutions based on shared understandings of complex situations in the area of health. His work in the area of transitional justice engages Third World Approaches to International Law (TWAIL) as a useful theoretical lens for critical internationalism to interrogate claims about universalism in the pursuit of international criminal justice, whilst pushing for better representation for the subaltern in international thought and action. Ngwaba began his career in commercial legal practice in Chief Ladi Rotimi Williams Chambers, Lagos, where he was involved in a number of high-profile litigations before Superior Courts of Nigeria. He subsequently took up an academic position as a Research Fellow at the Nigerian Institute of Advanced Legal Studies (NIALS). As one of the principal institutions for legal policy discourse in Nigeria, Ngwaba’s work at NIALS exposed him to policy-oriented research, which traversed a broad field of legal enquiry unified by the focus on achieving policy and systemic changes in Nigeria. Research Interests: Public health and human rights, international human rights law, health systems, health governance frameworks, constitutional theory, comparative constitutional law, and transitional justice",
    "listed_research_areas":"Public health and human rights, international human rights law, health systems, health governance frameworks, constitutional theory, comparative constitutional law, and transitional justice"
  },
  {
    "faculty":"tmu",
    "name":"Jennifer Orange",
    "title":"Assistant Professor",
    "email":"jennifer.orange@torontomu.ca",
    "href":"https:\/\/www.torontomu.ca\/law\/faculty-and-research\/faculty\/faculty-law\/jennifer-orange",
    "bio":"Jennifer Orange is an assistant professor in the Lincoln Alexander School of Law. Prior to that, she was a post-doctoral fellow at the Bill Graham Institute for Contemporary International History at the University of Toronto, a member of the Human Rights Tribunal of Ontario and a litigator at Torys LLP. Her interdisciplinary research investigates the ways that cultural institutions support the dissemination and evolution of human rights norms. Her work explains how human rights communities of practice that include both state and non-state actors can promote a human rights culture. Orange is also conducting research on the return of cultural artefacts to Indigenous communities. Orange has written in the areas of international law, constitutional law, human rights, truth and reconciliation, and museology, including publications in Human Rights Quarterly, the UCLA Journal of International Law and Foreign Affairs, and the Journal of Museum Management and Curatorship. She has held a number of fellowships, including a Jackman Humanities Institute-Mellon Fellowship. As of April 2021, Jennifer has been appointed as a part-time member of the Canadian Human Rights Tribunal for a 5 year term. Research Interests: Human rights, international law, organizational theory, dispute resolution, socio-legal studies, museology",
    "listed_research_areas":"Human rights, international law, organizational theory, dispute resolution, socio-legal studies, museology"
  },
  {
    "faculty":"tmu",
    "name":"Joshua Sealy-Harrington",
    "title":"Assistant Professor",
    "email":"joshua.sealy@torontomu.ca",
    "href":"https:\/\/www.torontomu.ca\/law\/faculty-and-research\/faculty\/faculty-law\/joshua-sealy-harrington",
    "bio":"Twitter: @joshuasealy (external link) Joshua Sealy-Harrington is a passionate teacher, scholar, and advocate who has received awards for his excellence in teaching (from the University of Ottawa, where he taught “Race, Racism and the Law”), service (from the Black Law Students’ Association of Canada), and advocacy (from the Canadian Law Blog Awards). Drawing on critical race theory, Joshua’s current research (external link) explores the ways in which law mediates racial hierarchy, with a particular focus on how criminal and constitutional law subordinate Black and Indigenous people, and relatedly, construct notions of racial identity — including through dialogue with gender, sexuality, disability, and class. Further, as counsel at Power Law (external link) , Joshua’s advocacy strategically mobilizes criminal and constitutional law to advance the interests of marginalized communities. He has litigation experience before all levels of court, including as lead counsel before the Supreme Court of Canada. And a majority of his practice involves pro and low bono work for non-profit organizations promoting human rights and social justice, both in Canada and abroad. An active volunteer, Joshua is a proud Board Member of the Community Justice Collective (external link) , a non-profit organization that provides pro bono legal support to anti-colonial, anti-capitalist, and anti-carceral social movements in the Greater Toronto Area. He also drafts the annual moot problem for the Black Law Students’ Association of Canada’s Isaac Moot, acts as a faculty advisor to Lincoln Alexander Law’s Black Law Students’ Association and Gale Cup mooting team, is a mentor with Black Future Lawyers, and was previously the editor-in-chief of the Canadian Bar Association’s Law Matters magazine for three years. Joshua writes and speaks broadly. His writing has been featured in several law journals and news outlets (including The Globe and Mail and Newsweek), and has been cited by various tribunals (including the Supreme Court of Canada). Further, he is a frequent speaker to public, private, media and academic organizations, including law schools across Canada, CBC and CTV News, the National Judicial Institute, the Department of Justice, the Criminal Lawywers' Association, and the Advocate's Society. Joshua is most passionate, though, about speaking with equity-seeking groups, including the Black Law Students Association of Canada, the Indigenous Bar Association, the Federation of Asian Canadian Lawyers, and the Canadian Hispanic Bar Association. Before joining Lincoln Alexander Law, Sealy-Harrington completed a B.Sc. (mathematics) at the University of British Columbia, a J.D. at the University of Calgary, an LL.M. at Columbia Law School, and three clerkships — one for Justice Donald J. Rennie at the Federal Court and two for Justice Clément Gascon at the Supreme Court of Canada. Research Interests: Critical race theory, feminist legal theory, queer legal theory, critical disability theory, criminal punishment, constitutional law, law and social movements.",
    "listed_research_areas":"Critical race theory, feminist legal theory, queer legal theory, critical disability theory, criminal punishment, constitutional law, law and social movements."
  },
  {
    "faculty":"tmu",
    "name":"Luke Taylor",
    "title":"Assistant Professor",
    "email":"luke.taylor@torontomu.ca",
    "href":"https:\/\/www.torontomu.ca\/law\/faculty-and-research\/faculty\/faculty-law\/luke-taylor",
    "bio":"Prior to his postgraduate studies, Luke Taylor worked as a commercial litigator in Australia, and served as legal research officer at the High Court of Australia. He has also taught courses on legal method and reasoning, legal history, and gender issues in the law at the University of Toronto, McGill University, and the University of New South Wales. Taylor’s research traverses contemporary and historical dimensions of Canadian, English and Australian family law, employment law and criminal law, and the intersections of these fields with questions of gender and sexuality. He is particularly interested in the development of the field of family law in different national contexts; the diffusion of legal ideas concerning the family and sexuality throughout the British Empire in the 19th century; and contemporary dimensions of the regulation of adult personal relationships. His work has appeared in, among others, the University of Toronto Law Journal, the McGill Law Journal, and Law & History Review. Taylor holds an SJD and LLM from the University of Toronto, where he was a CGS Bombardier scholar and received the Marks Medal in 2018-19. In 2019-20, he was the Boulton Fellow at the Faculty of Law, McGill University. Research Interests: Family law, employment law, legal history, law, gender and sexuality, feminist, queer, critical legal theory",
    "listed_research_areas":"Family law, employment law, legal history, law, gender and sexuality, feminist, queer, critical legal theory"
  },
  {
    "faculty":"tmu",
    "name":"Pnina Alon-Shenker",
    "title":"Associate Professor",
    "email":"pnina.alon@torontomu.ca",
    "href":"https:\/\/www.torontomu.ca\/law\/faculty-and-research\/faculty\/faculty-cross-appointed\/pnina-alon-shenker",
    "bio":"Pnina Alon-Shenker is an associate professor in the Lincoln Alexander School of Law at Toronto Metropolitan University, and the Ted Rogers School of Management (TRSM) in the Department of Law & Business, and she is the founding academic director of Ryerson Law & Business Clinic. She served as a law clerk to the Honourable Justice Dalia Dorner of the Supreme Court of Israel in 2002-2003 and was called to the Israeli Bar in 2003. She earned her LL.B. from Haifa University, LL.M. from the Hebrew University and University of Toronto, and S.J.D from University of Toronto. She joined Ryerson as a sessional instructor in 2009 and as an assistant professor in 2010. Alon-Shenker’s research interests centre on labour and employment law with an emphasis on workplace discrimination and diversity, the aging workforce, and forms of employee representation and voice. Her research advances an innovative critique of contemporary legal analyses of age discrimination in the workplace and develops a new paradigm, founded in legal and philosophical theories of equality, which better articulates the wrongs associated with age discrimination in the workplace. This research also has significant practical implications for topical legal challenges faced by the aging workforce such as the duty to accommodate senior workers, mandatory retirement and cost-based defence claims. Her recent research projects expand to issues of diversity at work, intergenerational equity, and age & intersectionality. Alon-Shenker received the Dean’s Scholarly, Research and Creative Activity Award in 2014 for her scholarly achievements. In 2016, she received the Provost's Experiential Teaching Award in recognition of her work to develop and lead the Ryerson Law & Business Clinic. Alon-Shenker was the Co-Editor-in-Chief of International Journal of Comparative Labour Law and Industrial Relations (external link) , and is a member of the Labour Law Casebook Group co-editing the Labour and Employment Law: Cases, Material, and Commentary (external link) (Irwin Law). Research Interests: Employment law; labour law; human rights; workplace discrimination; diversity at work",
    "listed_research_areas":"Employment law; labour law; human rights; workplace discrimination; diversity at work"
  },
  {
    "faculty":"tmu",
    "name":"Timothy J. Bartkiw",
    "title":"Associate Professor",
    "email":"tbartkiw@torontomu.ca",
    "href":"https:\/\/www.torontomu.ca\/law\/faculty-and-research\/faculty\/faculty-cross-appointed\/timothy-bartkiw",
    "bio":"Timothy J. Bartkiw is an associate professor in the Lincoln Alexander School of Law at Toronto Metropolitan University and the Department of Human Resources and Organizational Behaviour in the Ted Rogers School of Management. He is a member of the Bar of Ontario, and previously practiced law exclusively in the areas of labour and employment law. Bartkiw’s academic research interests span the fields of labour and employment law and policy and industrial relations. He teaches various courses in labour and employment law and industrial relations at Ryerson. His current and past research relates to the legal concept of the employer and employee; the regulation of precarious work and employment and particularly triangular employment; the regulation of collective action and unionization; the collective bargaining framework; comparative labour and employment law; and the “legalization” of labour policy via Charter litigation. His research has been published in various international and domestic peer-reviewed academic journals. Bartkiw has also served as an expert academic advisor in labour and employment law review processes concerning employment standards, and collective bargaining models in both the public and private sectors. He was appointed to provide an expert report on the collective bargaining regime to support the recent Changing Workplaces Review (external link) labour law reform process in Ontario. Bartkiw is a member of the Labour Law Casebook Group that co-edits a prominent labour and employment law textbook. He is also the director of the Ryerson Centre for Labour Management Relations. Research Interests: labour and employment law and policy; industrial relations",
    "listed_research_areas":"labour and employment law and policy; industrial relations"
  },
  {
    "faculty":"tmu",
    "name":"Gil Lan",
    "title":"Associate Professor",
    "email":"glan@torontomu.ca",
    "href":"https:\/\/www.torontomu.ca\/law\/faculty-and-research\/faculty\/faculty-cross-appointed\/gil-lan",
    "bio":"Gil Lan is an associate professor in the Lincoln Alexander School of Law at Toronto Metropolitan University and the Law and Business Department at the Ted Rogers School of Management (TRSM) where he teaches business law. He is also a Council Member of the Canada-China Institute for Business Development at TRSM. He received his B.Sc. from the University of Toronto and his LL.B., LL.M. and Ph.D. from Osgoode Hall Law School. In addition to teaching at Toronto Metropolitan University, Lan has lectured at Osgoode Hall Law School where he has taught Business Associations and, since 2008, he has taught in the LL.M. program for International Business Law. Lan is an avid speaker and his presentation venues have ranged from academic conferences sponsored by universities and academic organizations in Canada, the U.S., and China to profession-oriented events sponsored by organizations such as the Ontario Bar Association and the Association of Chinese-Canadian Lawyers of Ontario. His research centres on corporate-commercial law with a focus on international perspectives as well as the law’s potential to promote social goals and innovation. His specific interests include comparative law approaches, international business law, corporate governance, government regulation of business, social enterprise, law and development, and Chinese law. Lan’s research has addressed issues such as how China managed to accomplish phenomenal economic growth after 1979 without a strong Western-style property regime, how Canada’s foreign investment laws could be improved, and the inter-relationship between corporate law structures and ascending innovative entrepreneurship models such as social enterprise. In his presentations and guest lectures, he has addressed a range of topics including corporate governance in different countries, the Chinese legal system, social entrepreneurship and legal structures, diversity in the legal profession, and barriers facing immigrant entrepreneurs. In 2013, Lan was a recipient of the Dean’s Teaching Award at TRSM, andin the summer of 2014, he received the Hoeber Memorial Award – Outstanding Article, from the Academy of Legal Studies in Business, for his comparative law article on China and the U.S. Research Interests: International business law; government regulation of business; corporate governance; social enterprise; comparative law; Chinese law; law and development",
    "listed_research_areas":"International business law; government regulation of business; corporate governance; social enterprise; comparative law; Chinese law; law and development"
  },
  {
    "faculty":"tmu",
    "name":"Alexandra Orlova",
    "title":"Professor",
    "email":"aorlova@torontomu.ca",
    "href":"https:\/\/www.torontomu.ca\/law\/faculty-and-research\/faculty\/faculty-cross-appointed\/alexandra-orlova",
    "bio":"Alexandra Orlova received her PhD in law from Osgoode Hall Law School, York University, in 2004. She also holds a Bachelor of Laws (LLB) from Osgoode Hall Law School and has been called to the Bar of Ontario since 2002. Prior to pursuing her graduate studies, she articled with a large Bay Street firm and served as a legal counsel for the Ministries of Tourism and Culture, Recreation and Citizenship in the Ontario government. Orlova has taught at Toronto Metropolitan University in the Faculty of Arts, Department of Criminology since 2005. Orlova's main research interests focus on transnational organized crime, global constitutionalism, human rights and international crimes. She has been published widely in a variety of high-impact, international peer-reviewed journals, has co-edited a book with colleagues from the Immanuel Kant Baltic Federal University and presented her work at a variety of national and international conferences. Orlova lectured as an invited international expert at the Railway Police College in Zhengzhou, China pertaining to issues of national security, terrorism and organized crime. She co-organized a number of international SSHRC funded conferences, which brought together scholars, practitioners and government officials from many different jurisdictions. Orlova is a member of editorial boards of Trends in Organized Crime journal and Contemporary Readings in Law and Social Justice journal. She provided expert opinion pertaining to organized crime and human trafficking to the UN Office on Drugs and Crime (UNODC), the Norwegian Refugee Council’s Internal Displacement Monitoring Centre as well as for lawyers representing victims of organized crime and human trafficking in Canada and the UK. In addition to pursuing research, Orlova has acted as a supervisor to PhD and MA-level students, as well as supervised undergraduate and graduate research assistants. Research Interests: Criminal and international criminal law; human rights; global constitutionalism and organized crime",
    "listed_research_areas":"Criminal and international criminal law; human rights; global constitutionalism and organized crime"
  },
  {
    "faculty":"tmu",
    "name":"Donna Young",
    "title":"Dean",
    "email":"deanoflaw@torontomu.ca",
    "href":"https:\/\/www.torontomu.ca\/law\/about\/our-dean\/",
    "bio":"Donna E. Young is the Founding Dean of the Lincoln Alexander School of Law. Before assuming her deanship, she was the President William McKinley Distinguished Professor of Law and Public Policy at Albany Law School and a joint faculty member at the University at Albany's Department of Women's, Gender, and Sexuality Studies. Her teaching and scholarship focus on law and inequality, race and gender discrimination, and academic freedom and university governance. She has taught courses in Criminal Law, Employment Law; U.S. Federal Civil Procedure; Gender and Work; and Race, Rape Culture, and Law. Dean Young is much sought after as a speaker and has been invited to present her work at conferences and other venues around the world. She has been a staff member at the American Association of University Professors' (AAUP) Department of Academic Freedom, Tenure, and Governance, in Washington, D.C. and was a member of the AAUP's Committee A, the preeminent national body setting standards and investigating academic freedom disputes in the United States. She has been a Fellow at Cornell Law School's Gender, Sexuality, and Family Project; a Visiting Scholar at Osgoode Hall Law School's Institute of Feminist Legal Studies; an Associate in Law at Columbia Law School; a Visiting Scholar at the Faculty of Law at Roma Tre University in Rome, Italy; and a consultant to the International Development Law Organization for whom she traveled to Uganda to conduct field research on the relationship between gender inequality and law in the context of the HIV\/AIDS crisis. Dean Young's previous professional experiences include articling at Cornish Roland - a labour law firm in Toronto; serving as a consultant with the Ontario Human Rights Commission; and working as a researcher with the NYC Office of Labor Relations. She is admitted to practice in New York State. Research interests: Criminal Law; Employment Law; US Federal Civil Procedure; Antidiscrimination Law and Civil Rights; Critical Race Theory and Feminist Legal Theory; Academic freedom and due process, and university governance; Title IX",
    "listed_research_areas":"Criminal Law; Employment Law; US Federal Civil Procedure; Antidiscrimination Law and Civil Rights; Critical Race Theory and Feminist Legal Theory; Academic freedom and due process, and university governance; Title IX"
  }
]