[
  {
    "faculty":"u_toronto",
    "name":"Abdi Aidid",
    "title":null,
    "email":"a.aidid@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/abdi-aidid",
    "bio":"Assistant Professor Jackman Law BuildingRoom J36478 Queen's ParkToronto, Ontario M5S 2C5 Abdi Aidid researches and teaches in the areas of civil procedure, torts, and law & technology. He received his B.A. from the University of Toronto, his J.D. from Yale Law School and his LL.M from the Faculty of Law. Professor Aidid previously practiced litigation and arbitration at Covington & Burling LLP in New York City and most recently served as the VP, Legal Research at Blue J, where he oversaw the development of machine learning-enabled research and analytics tools. Professor Aidid is a Faculty Affiliate at the Centre for Ethics and a member of the Ethics of AI Lab. Prior to joining the Faculty of Law full-time in 2021, he served as an Adjunct Professor. He can be reached at a.aidid@utoronto.ca.",
    "listed_research_areas":null
  },
  {
    "faculty":"u_toronto",
    "name":"Benjamin Alarie",
    "title":null,
    "email":"ben.alarie@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/benjamin-alarie",
    "bio":"Professor & Osler Chair in Business Law Jackman Law BuildingRoom J36078 Queen's ParkToronto, Ontario M5S 2C5 Benjamin Alarie, M.A. (Toronto), J.D. (Toronto), LL.M. (Yale) is an expert in tax law, judicial decision-making, machine learning, and the future of law and technology. Before joining the Faculty of Law, Professor Alarie was a graduate fellow at Yale Law School (2002-2003) and a law clerk for Madam Justice Louise Arbour at the Supreme Court of Canada (2003-2004). Over the years his publications have appeared in numerous academic journals, including the British Tax Review, the Canadian Tax Journal, and the American Business Law Journal. His research has been funded by the Social Sciences and Humanities Research Council, the Canadian Foundation for Innovation, and the Ontario Ministry of Research and Innovation. He is coauthor of several editions of Canadian Income Tax Law (LexisNexis) and was awarded the Alan Mewett QC Prize for Excellence by the JD class of 2009. He is co-author (with Andrew J. Green) of the leading study of comparative empirical supreme court decision-making practices, Cooperation and Commitment on High Courts (Oxford University Press, 2017). He is an affiliated faculty member of the Vector Institute for Artificial Intelligence and the Schwartz Reisman Institute for Technology and Society.Professor Alarie is co-founder and CEO of Blue J, a leading North American legal tech company specializing in artificial intelligence, legal prediction, and intelligent diagramming. He combines academic scholarship with legal technology through his monthly column in Tax Notes, entitled Blue J Predicts, where he analyzes recently decided and pending U.S. tax cases using machine learning. An educational Hot Docs \/ uDocs documentary, The A.I. Taxman, recounts the early Blue J story and outlines a vision of how artificial intelligence is likely to affect tax law in the coming decades.Professor Alarie is co-author (with Abdi Aidid) of The Legal Singularity: How Artificial Intelligence Can Make Law Radically Better (University of Toronto Press, 2023), available from Amazon and the University of Toronto Press. See some of the book's pre-publication press: Law360, the University of Toronto.Professor Alarie on LinkedIn, wIkipedia, Twitter, SSRN, Google Scholar. Research Interests: Economic Analysis of Law; Judicial Decision-Making; Tax Law",
    "listed_research_areas":"Economic Analysis of Law; Judicial Decision-Making; Tax Law"
  },
  {
    "faculty":"u_toronto",
    "name":"Anita Anand",
    "title":null,
    "email":"website.law@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/anita-anand",
    "bio":"J.R. Kimber Chair in Investor Protection and Corporate Governance & \r Academic Director, Centre for the Legal Profession\r and Program on Ethics in Law and Business (on leave) Jackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5 Anita Indira Anand is currently serving as the Member of Parliament for Oakville, Ontario. She is on leave from the Faculty of Law for the duration of her appointment.Prior to assuming her role as MP, Professor Anand, a Professor of Law, held the J.R. Kimber Chair in Investor Protection and Corporate Governance. She served as Associate Dean from 2007-2009 and since 2010, served as the Academic Director of the Centre for the Legal Profession and its Program on Ethics in Law and Business. She is a Senior Fellow of Massey College and cross-appointed to the Rotman School of Management and the Munk School of Global Affairs and Public Policy. In 2019, the Royal Society of Canada awarded her the Yvain Allaire medal for her outstanding contributions in governance relating to private and public organizations.During the 2009-2010 academic year, Professor Anand was a Visiting Scholar at the Bank of Canada and a Herbert Smith Visitor at the University of Cambridge. In 2005-2006, she was a Canada-U.S. Fulbright Scholar and Visiting Olin Scholar in Law and Economics at Yale Law School. During the Fall 2005, she was a Visiting Lecturer in Law at Yale Law School where she taught comparative corporate governance. In Fall 2017, she was appointed Director of Policy and Research at the Capital Markets Institute, Rotman School of Management at the University of Toronto where she also taught in the Directors' Education Program.She is the recipient of research grants from the Social Sciences and Humanities Research Council of Canada (four awards), the Law Foundation of Ontario, the Foundation for Legal Research (three awards), the Connaught Foundation as well as the Canadian Association of Law Teachers' Scholarly Paper Award (2003).  In Fall 2004, she received the Queen's Law Students' Society Award for Excellence in Teaching and in Fall 2006, she and co-authors Frank Milne and Lynnette Purda were awarded the Best Paper in Managerial Finance by the International Journal of Managerial Finance for their empirical research relating to corporate governance. In 2015, Professor Anand was appointed by Ontario's Minister of Finance to the Expert Committee to Consider Financial Advisory and Financial Planning Policy Alternatives. She has conducted research for Ontario's Five-Year Review Committee, the federal Wise Person's Committee, the Task Force to Modernize Securities Legislation in Canada and the Commission of Inquiry into the Investigation of the Bombing of Air India Flight 182.  She was the inaugural Chair of the Ontario Securities Commission's Investor Advisory Panel (2010-2012) and the president of the Canadian Law and Economics Association (2009-2011).In 2012, she was appointed to the Bertha Wilson Honour Society by the Schulich School of Law for service to the legal profession.  She is the Editor of Canadian Law eJournal, published by the Legal Scholarship Network. She has served on the Ontario Rhodes Scholar Selection Committee and the U.S.-Canada Fulbright Committee as well as public company and non-profit boards of directors. Her main research areas relate to the regulation of capital markets with a specific focus on corporate governance, enforcement, capital raising techniques and systemic risk.Canadian Business Law BlogTwitter: @AnitaAnand2Podcast on Cooperative Securities Regulator: https:\/\/www.buzzsprout.com\/5821\/514460-anita-anand-episode-59-mp3 Research Interests: Business Corporations; Business Law; Economic Analysis of Law; Securities Regulation",
    "listed_research_areas":"Business Corporations; Business Law; Economic Analysis of Law; Securities Regulation"
  },
  {
    "faculty":"u_toronto",
    "name":"Lisa Austin",
    "title":null,
    "email":"lisa.austin@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/lisa-austin",
    "bio":"Professor, Chair in Law and Technology Jackman Law Building 46478 Queen's Park Lisa Austin, BA &Sc (McMaster) 1994, MA (Toronto) 1995, LLM (Toronto) (1998), PhD (Toronto) 2005, called to the Bar of Ontario in 2006, is a Professor of Law. Prior to joining the faculty, she served as law clerk to Mr. Justice Frank Iacobucci of the Supreme Court of Canada. Professor Austin received a 2017 President's Impact Award from the University of Toronto.Professor Austin is an Associate Director at the Schwartz Reisman Institute for Technology and Society, and was previously a co-founder of the IT3 Lab at the University of Toronto, which engaged in interdisciplinary research on privacy and transparency.Professor Austin's research and teaching interests include privacy law, property law, and legal theory. She is published in such journals as Legal Theory, Law and Philosophy, Theoretical Inquiries in Law, Canadian Journal of Law and Jurisprudence, and Canadian Journal of Law and Society. She is co-editor (with Dennis Klimchuk) of Private Law and the Rule of Law (Oxford University Press, 2015), in which distinguished Canadian and international scholars take on the general understanding that the rule of law is essentially only a doctrine of public law and consider whether it speaks to the nature of law more generally and thus also engages private law.Professor Austin's privacy work has been cited numerous times by Canadian courts, including the Supreme Court of Canada. She is also active in a number of public policy debates in Canada. Research Interests: Charter of Rights; Legal Theory; National Security Law and Anti-Terrorism Law; Privacy Law; Property Law",
    "listed_research_areas":"Charter of Rights; Legal Theory; National Security Law and Anti-Terrorism Law; Privacy Law; Property Law"
  },
  {
    "faculty":"u_toronto",
    "name":"Jean-Christophe Bédard-Rubin",
    "title":null,
    "email":"jc.bedardrubin@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/jean-christophe-b-dard-rubin",
    "bio":"Assistant Professor 78 Queen's Park Assistant Professor Jean-Christophe Bédard-Rubin's work explores Canadian constitutional culture from historical and comparative perspectives. He studied law, political science, and philosophy at Université Laval, Yale University, and the University of Toronto. During his doctoral studies, Jean-Christophe was the McMurty Fellow of the Osgoode Society for Canadian Legal History and a Joseph-Armand Bombardier Scholar. He has done consultancy work on constitution-building for International IDEA and, prior to his graduate studies, he worked in litigation for the Quebec Department of Justice.Bédard-Rubin currently pursues two main research projects. The first is an intellectual history of the foundations of public law in French Canada. This project seeks to reconstruct the intellectual networks in which French Canadian public lawyers participated to excavate the transatlantic influences on the formation of Quebec’s legal syncretism. This genealogical reconstruction recovers the conceptual and theoretical innovations that allowed French Canadians to articulate a genuine theory of the state outside of the revolutionary framework. In so doing, this work sheds a different, somewhat oblique light on Canada’s constitutional experience and questions its status in comparative constitutional scholarship.The second research project investigates judicial bilingualism in Canada. Using mixed social science methods, this project explores the various empirical impacts of bilingualism on judicial behaviour, the normative significance of legal bilingualism for the authority of judicial decisions, and the ways in which language shapes the dominant conception of the judicial role in Canada’s French and English public spheres.Jean-Christophe’s work has been published in English and French in the Review of Constitutional Studies, the Canadian Journal of Law & Society, the Osgoode Hall Law Journal, the Bulletin d’histoire politique, and the International Journal of Canadian Studies, amongst others. Research areasCanadian Constitutional Law Research Interests: Canadian Constitutional Law",
    "listed_research_areas":"Canadian Constitutional Law"
  },
  {
    "faculty":"u_toronto",
    "name":"Peter Benson",
    "title":null,
    "email":"p.benson@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/peter-benson",
    "bio":"Professor Peter Benson joined the University of Toronto, Faculty of Law in 1998 after teaching at the McGill Faculty of Law from 1984-1998. He became a full professor in 2000. He holds law degrees from the University of Toronto and Harvard, as well as an M.Sc. in Politics from the London School of Economics and an A.B. in Sociology (magna cum laude) from Harvard. In 1983-4, Professor Benson was a law clerk to Chief Justice Bora Laskin and Justice Gerald Le Dain of the Supreme Court of Canada.His teaching and writing focus mainly on contract law, contract theory, the theory of private law, and theories of justice. He is the author of Justice in Transactions: A Theory of Contract Law (The Belknap Press of Harvard University Press, 2019) and the editor of as well as a contributor to The Theory of Contract Law: New Essays (Cambridge University Press, 2001). His work has been widely published in journals and book collections including The Oxford Handbook of Jurisprudence, The Philosophical Foundations of Tort Law, Blackwell’s A Companion to Philosophy of Law and Legal Theory, Political Theory, The Columbia Law Review, The Iowa Law Review, The Cardozo Law Review, and The Canadian Journal of Law and Jurisprudence. Research Interests: Contracts; Legal Theory; Political Philosophy and Theory",
    "listed_research_areas":"Contracts; Legal Theory; Political Philosophy and Theory"
  },
  {
    "faculty":"u_toronto",
    "name":"John Borrows",
    "title":null,
    "email":"j.borrows@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/john-borrows",
    "bio":"Professor and Loveland Chair in Indigenous Law Jackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5 John Borrows B.A., M.A., J.D., LL.M. (Toronto), Ph.D. (Osgoode Hall Law School), LL.D. (Hons., Dalhousie, York, SFU, Queen’s & Law Society of Ontario), D.H.L, (Toronto), F.R.S.C., O.C., is the Loveland Chair in Indigenous Law at the University of Toronto Law School. His publications include, Recovering Canada; The Resurgence of Indigenous Law (Donald Smiley Award best book in Canadian Political Science, 2002), Canada's Indigenous Constitution (Canadian Law and Society Best Book Award 2011), Drawing Out Law: A Spirit's Guide (2010), Freedom and Indigenous Constitutionalism ((Donald Smiley Award best book in Canadian Political Science, 2016), The Right Relationship (with Michael Coyle, ed.), Resurgence and Reconciliation (with Michael Asch, Jim Tully, eds.), Law’s Indigenous Ethics (2020 Best subsequent Book Award from Native American and Indigenous Studies Association, 2020 W. Wes Pue Best book award from the Canadian Law and Society Association). He is the 2017 Killam Prize winner in Social Sciences and the 2019 Molson Prize Winner from the Canada Council for the Arts, the 2020 Governor General’s Innovation Award, and the 2021 Canadian Bar Association President’s Award winner.  He was appointed as an Officer of the Order of Canada in 2020. John is a member of the Chippewa of the Nawash First Nation in Ontario, Canada. Research areasAboriginal Law Research Interests: Aboriginal Law",
    "listed_research_areas":"Aboriginal Law"
  },
  {
    "faculty":"u_toronto",
    "name":"Jutta Brunnée",
    "title":null,
    "email":"deansoffice.law@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/jutta-brunn-e",
    "bio":"Dean, University Professor & James Marshall Tory Dean’s Chair Jackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5 Dean, University Professor & James Marshall Tory Dean’s Chair, University of Toronto. Dean Brunnée’s teaching and research interests are in the areas of Public International Law, International Environmental Law and International Legal Theory. She has published extensively in each of these areas. Her current research agenda explores the role of international legality and legal practices in mediating between stability and change in international law. Dean Brunnée is co-author of International Climate Change Law (OUP 2017), which was awarded the American Society of International Law’s 2018 Certificate of Merit “in a specialized area of international law” and was recently translated into Korean, and of Legitimacy and Legality in International Law: An Interactional Account (CUP 2010), which was awarded the American Society of International Law’s 2011 Certificate of Merit “for preeminent contribution to creative scholarship.” Dean Brunnée also is co-editor of the Oxford Handbook of International Environmental Law (Oxford University Press, 2007). In 1998-99, she was the “Scholar-in-Residence” in the Legal Bureau of the Canadian Department of Foreign Affairs and International Trade, advising, inter alia, on matters under the Biodiversity and Climate Change Conventions. From 2006 to 2016, she served on the Board of Editors of the American Journal of International Law. She was elected Fellow of the Royal Society of Canada in 2013, and Associate of the Institut de Droit International in 2017. In 2019, she delivered a course on “Procedure and Substance in International Environmental Law” at The Hague Academy of International Law,  published in the Academy's Collected Courses \/ Recueil des Cours series (2020). In 2020, Dean Brunnée was appointed University Professor, the University of Toronto’s highest and most distinguished academic rank. See also Dean Brunnée's SSRN page. Research Interests: Environmental Law; International Law; Legal Theory",
    "listed_research_areas":"Environmental Law; International Law; Legal Theory"
  },
  {
    "faculty":"u_toronto",
    "name":"Li Chen",
    "title":null,
    "email":"lc.chen@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/li-chen",
    "bio":"Associate Professor of History, Department of Historical and Cultural Studies and Graduate Department of History UTSC Department of Historical and Cultural Studies page Li Chen received his J.D. from University of Illinois (magna cum laude) and Ph.D. in History from Columbia University. He is an Associate Professor of Chinese History at the Department of Historical and Cultural Studies and the Graduate Department of History. Professor Chen holds a non-budgetary cross-appointment at the Faculty of Law at the rank of Associate Professor. He also holds non-budgetary appointments at the Centre for Criminology and Sociolegal Studies, the Munk School of Global Affairs, and the Department of East Asian Studies.Professor Chen’s research and teaching interests include late Imperial and modern China (15th through 20th centuries), Chinese law and society, Sino-Western relations, law and empire, history of science and biopower in jurisprudence, politics of translation, cultural encounters, international law, global history, and postcolonial studies. His book, Chinese Law in Imperial Eyes: Sovereignty, Justice, and Transcultural Politics (Columbia University Press, 2016), won the 2018 Joseph Levenson Pre-1900 Book Prize of the Association for Asian Studies and Honorable Mention for the 2017 Peter Gonville Stein Book Award of the American Society for Legal History. Professor Chen is co-editor of Chinese Law: Knowledge, Practice, and Transformation, 1530s-1950s (Brill, 2015) (with Madeleine Zelin). He is working on another SSHRC-funded book project, Invisible Power, Legal Specialists, and the Juridical Field in Late Imperial China, 1651-1911. Professor Chen is a member of the editorial board of the Law and History Review (2013-20), and founding President (2014-2017) and director of the International Society for Chinese Law and History. He also served as Associate Chair (2015-2016) and Chair of the Department of Historical and Cultural Studies (2016-2019).For more information on Professor Chen’s research, see his academia.edu page: http:\/\/utoronto.academia.edu\/LiChen Research Interests: Critical Legal Theory; International Law; Legal History",
    "listed_research_areas":"Critical Legal Theory; International Law; Legal History"
  },
  {
    "faculty":"u_toronto",
    "name":"Vincent Chiao",
    "title":null,
    "email":"vincent.chiao@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/vincent-chiao",
    "bio":"Associate Professor Jackman Law BuildingRoom J33278 Queen's ParkToronto, Ontario M5S 2C5 Vincent Chiao, B.A. (University of Virginia), Ph.D. (Northwestern), J.D. (Harvard), researches and teaches primarily in the area of criminal law and criminal justice, with a particular interest in the philosophical examination of its doctrine and institutions. He is the author of Criminal Law in the Age of the Administrative State (Oxford University Press 2018). See also the Law & Philosophy focus area. Research Interests: Criminal Law ; Criminal Procedure and Evidence; Legal Theory; Political Philosophy and Theory",
    "listed_research_areas":"Criminal Law ; Criminal Procedure and Evidence; Legal Theory; Political Philosophy and Theory"
  },
  {
    "faculty":"u_toronto",
    "name":"Kamari Clarke",
    "title":null,
    "email":"kamari.clarke@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/kamari-clarke",
    "bio":"Distinguished Professor, Centre for Criminology & Sociolegal Studies and the Centre for Diaspora and Transnational Studies View Professor Clarke's Departmental Profile here Kamari Maxine Clarke is a Distinguished Professor at the University of Toronto. For more than twenty years, she has conducted research on issues related to legal institutions, human rights and international law, religious nationalism and the politics of race and globalization. She has spent her career exploring theoretical questions concerning culture and power and detailing the relationship between new social formations and contemporary problems.  One of her key academic contributions has been to demonstrate ethnographically the ways that legal and religious knowledge regimes produce practices that travel globally. In addition to her scholarly work, she has served as a technical advisor to the African Union (AU) legal counsel and produced policy reports to help the AU navigate various international law and United Nations challenges. Clarke has published nine books (3 monographs and 6 edited volumes) with over 50 peer-refereed journal articles and book chapters.  She is the author of Affective Justice: The International Criminal Court and the Pan-Africanist Pushback (2019, Duke), Fictions of Justice (Cambridge, 2010), and Mapping Yorùbá Networks (Duke, 2004). Clarke is the recipient of the 2019 Royal Anthropological Institute’s Amaury Talbot Book Prize, as well as the 2019 finalist for the Elliot Skinner book award for her latest book, Affective Justice (Duke, 2019). She is also a recipient of a Distinguished Chair in Transnational Justice sand Socio-legal Studies and a recipient of the 2021 Guggenheim Prize for career excellence. Awards and distinctions2021 Guggenheim Fellowship John Simon Guggenheim Memorial Foundation Research areasCritical Legal TheoryInternational LawLaw and GlobalizationLaw and Religion Research Interests: Critical Legal Theory; International Law; Law and Globalization; Law and Religion",
    "listed_research_areas":"Critical Legal Theory; International Law; Law and Globalization; Law and Religion"
  },
  {
    "faculty":"u_toronto",
    "name":"Brenda Cossman",
    "title":null,
    "email":"b.cossman@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/brenda-cossman",
    "bio":"Professor of Law, Goodman-Schipper Chair; Chair, Research Advisory Committee Brenda Cossman is Professor of Law at the University of Toronto. She joined the Faculty of Law in 1999, and became a full professor in 2000. She was Director of U of T's Mark S. Bonham Centre for Sexual Diversity Studies from 2009-2018. She holds degrees in law from Harvard and the University of Toronto and an undergraduate degree from Queen's. Prior to joining the University of  Toronto, she was Associate Professor at Osgoode Hall Law School of York University.  In 2012, Professor Cossman was elected as a Fellow of the Royal Society of Canada. In 2009, she was awarded the Mundell Medal for contributions to letters and law. In 2002 and 2003, she was a Visiting Professor of Law at Harvard Law School. Professor Cossman's teaching and scholarly interests include family law, law and gender, and law and sexuality. Her most recent book The New Sex Wars: Sexual Harm in the Age of #MeToo was published by NYU Press in 2021. Her publications include Sexual Citizens: The Legal and Cultural Regulation of Sex and Belonging (Stanford University Press, 2007), the co-authored Bad Attitudes on Trial: Pornography, Feminism and the Butler Decision (University of Toronto Press) and Censorship and the Arts (published by the Ontario Association of Art Galleries). Research Interests: Family Law; Feminist Analysis of Law; Sexuality and the Law",
    "listed_research_areas":"Family Law; Feminist Analysis of Law; Sexuality and the Law"
  },
  {
    "faculty":"u_toronto",
    "name":"Peter Cziraki",
    "title":null,
    "email":"peter.cziraki@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/peter-cziraki",
    "bio":"Assistant Professor of Economics,\r Assistant Professor of Law (by courtesy) Department of Economics, Max Gluskin House, Room 209St. George Street 150M5S 3G7 Toronto, ON, Canada Personal web page Research Interests: Economic Analysis of Law",
    "listed_research_areas":"Economic Analysis of Law"
  },
  {
    "faculty":"u_toronto",
    "name":"Yasmin Dawood",
    "title":null,
    "email":"yasmin.dawood@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/yasmin-dawood",
    "bio":"Professor of Law and Canada Research Chair in Democracy, Constitutionalism, and Electoral Law Jackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5 See Professor Dawood's SSRN page Yasmin Dawood, J.D. (Columbia), Ph.D. (Chicago), is Professor of Law and the Canada Research Chair in Democracy, Constitutionalism, and Electoral Law at the Faculty of Law, with a courtesy appointment in the Department of Political Science. She was named a member of the Royal Society of Canada College of New Scholars, Artists, and Scientists in 2018. Professor Dawood was awarded the Mewett Award for Teaching Excellence by the Graduating Class of 2020. In addition, she was a co-recipient of the 2020 Legal Excellence Award from the South Asian Bar Association.Professor Dawood specializes in election law, comparative constitutional law, and democratic theory. Her scholarship, which is broadly concerned with improving electoral fairness and democratic governance, has addressed such topics as the right to vote, money in politics, redistricting, constitutional design, political dysfunction, partisanship, corruption, and the oversight of the democratic process by the courts. Her work has been published in leading journals, including the Georgetown Law Journal, NYU Law Review Online, American Review of Political Science, Election Law Journal, ICON International Journal of Constitutional Law, Boston University Law Review, Duke Journal of Constitutional Law & Public Policy, University of Toronto Law Journal, McGill Law Journal, Osgoode Hall Law Journal, Supreme Court Law Review, and the Canadian Journal of Law and Jurisprudence, among others. Her work has also appeared in edited volumes, including The Oxford Handbook of the Canadian Constitution (Oxford University Press) and Democracy by the People: Reforming Campaign Finance in America (Cambridge University Press). She was awarded a four-year Social Sciences and Humanities Research Council (SSHRC) grant for her research on democracy and election law. Her research has been funded by the Social Sciences and Humanities Research Council, the Connaught Foundation, and the Mellon Foundation.Professor Dawood has testified as an election law expert before the Parliamentary House committee examining The Fair Elections Act Bill C-23, and before the Special Parliamentary Committee on Electoral Reform. She has been interviewed on election law issues by various media, including The New York Times, CBC News Network, CBC Radio, The Globe and Mail, National Post, CTV News, The Agenda, Power & Politics, Metro Morning, Toronto Star and The Huffington Post, among others. She regularly presents her work at national and international conferences and workshops. Professor Dawood serves as a Vice-President of the American Society for Political and Legal Philosophy (NOMOS). She is also a member of the Executive Committee of the International Association of Constitutional Law. In addition, she serves on the Advisory Board of the Asper Centre for Constitutional Rights at the Faculty of Law, University of Toronto. She is a member of the International Board of Advisors of the Federal Law Review and the Editorial Board of the University of Toronto Law Journal.Professor Dawood received a Ph.D. in political science from the University of Chicago, a J.D. from Columbia Law School, and an Honours B.A. in political science from the University of Toronto. She is admitted to the Bar of New York and she practiced law with the firm of Cleary, Gottlieb, Steen & Hamilton LLP in New York. Prior to joining the Faculty of Law in 2009, she was a SSHRC Postdoctoral Fellow at the Centre for Ethics, University of Toronto. See Prof. Dawood's profile, Department of Political Science Download Professor Dawood's research from SSRN Research Interests: Canadian Constitutional Law; Charter of Rights; Comparative Law; Election Law; Judicial Decision-Making; Legal Theory; Political Philosophy and Theory",
    "listed_research_areas":"Canadian Constitutional Law; Charter of Rights; Comparative Law; Election Law; Judicial Decision-Making; Legal Theory; Political Philosophy and Theory"
  },
  {
    "faculty":"u_toronto",
    "name":"Nathalie Des Rosiers",
    "title":null,
    "email":"ndesrosiers@masseycollege.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/nathalie-des-rosiers",
    "bio":"Principal, Massey College Nathalie Des Rosiers is a lawyer, academic and former politician. She is the 6th and current Principal of Massey College at the University of Toronto. She was a member of the Legislative Assembly of Ontario representing the riding of Ottawa—Vanier from 2016 to 2019. During her tenure as a Member of Provincial Parliament, Des Rosiers served in the cabinet of Kathleen Wynne as Minister of Natural Resources and Forestry.She was born in Montreal, studied law at the Université de Montréal and received a LLM from Harvard University. Des Rosiers clerked at the Supreme Court of Canada and practised law in London, Ontario with Lerners LLP. She also was a law professor at the University of Western Ontario. She was president of the Law Commission of Canada from 2000 to 2004, Dean of Law (Civil) at University of Ottawa from 2004 -2008, Vice-President (Governance) for the University of Ottawa (2008 -2009) . Des Rosiers served as general counsel for the Canadian Civil Liberties Association (CCLA) from 2009 to 2013,[ when she returned to serve as dean of the common law section at the University of Ottawa until 2016.During the 2010 G20 Toronto summit, Des Rosiers uncovered a provision invoked by the provincial government which greatly expanded police powers near a security fence on the perimeter of the summit's location. She brought this issue to the attention of the Canadian press and ensured that CCLA volunteers monitored the Toronto police for civil liberties violations during the conference. She also helped to discourage the practice of \"carding\", where police stop people who are not suspected of any criminal activity, ask for their identification and record that information for later review.Des Rosiers was inducted into the Order of Ontario in 2012 and was inducted as a Member of the Order of Canada in 2013 for her work in civil rights and Francophone advocacy and was accepted as a Fellow of the Royal Society of Canada in 2014. She was named one of Canada's 10 \"nation builders\" by the Globe and Mail in 2014 and was named one of Canada's 25 most influential lawyers by Canadian Lawyer in 2011 and in 2012.",
    "listed_research_areas":null
  },
  {
    "faculty":"u_toronto",
    "name":"Abraham Drassinower",
    "title":null,
    "email":"abraham.drassinower@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/abraham-drassinower",
    "bio":"Professor Abraham Drassinower, B.A., M.A., Ph.D., LL.B. (Toronto) is Professor at the Faculty of Law, and Chair in the Legal, Ethical and Cultural Implications of Technological Innovation. He joined the Faculty of Law in 1999, and served as Director (20006-2009) and co-Director (2012-2017) of the Centre for Innovation Law and Policy. He previously held a Postdoctoral Fellowship in the Department of Political Science at the University of Toronto (1993-1995), and lectured principally on political philosophy at York University (1993-1995) and at the University of Toronto (1995-1998).  He served as a Law Clerk to Mr. Justice John C. Major of the Supreme Court of Canada (1998-1999).Professor Drassinower's interests include property, intellectual property, legal and political philosophy, critical theory, and psychoanalysis. He has published in the areas of charitable trusts, unjust enrichment, intellectual property, and psychoanalysis and political theory.  His most recent work is What's Wrong with Copying (Cambridge: Harvard University Press, 2015). See Publisher's web page. Research Interests: Intellectual Property Law; Legal Theory; Political Philosophy and Theory; Property Law",
    "listed_research_areas":"Intellectual Property Law; Legal Theory; Political Philosophy and Theory; Property Law"
  },
  {
    "faculty":"u_toronto",
    "name":"Markus Dubber",
    "title":null,
    "email":"markus.dubber@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/markus-dubber",
    "bio":"Professor, Faculty of Law & Centre for Criminology and Sociolegal Studies Faculty of Law78 Queen's ParkToronto, Ontario M5S 2C5Canada Markus D. Dubber, B.A. (Harvard) 1988, J.D. (Stanford) 1991, is Professor, Faculty of Law & Centre for Criminology and Sociolegal Studies.Much of Markus's scholarship has focused on theoretical, comparative, and historical aspects of criminal law. He has published, as author or editor, over twenty books and eighty papers; his work has appeared in English and German, and has been translated into Arabic, Chinese, Greek, Italian, Korean, Persian, Portuguese, and Spanish, and cited across various disciplines in several other languages, including Bosnian, Croatian, Czech, Dutch, Flemish, French, Georgian, Hebrew, Hungarian, Indonesian, Italian, Norwegian, Polish, Romanian, Russian, Serbian, Slovenian, Swedish, Thai, Turkish, and Ukrainian (ssrn | Google Scholar). His books include, among others, Der doppelte Strafstaat (2022); The Oxford Handbook of Ethics of AI (with Frank Pasquale & Sunit Das) (2020); The Dual Penal State: The Crisis of Criminal Law in Comparative-Historical Perspective (2018); The Oxford Handbook of Legal History (with Christopher Tomlins) (2018); The Oxford Handbook of European Legal History (with Heikki Pihlajamäki & Mark Godfrey) (2018); Criminal Law: A Comparative Approach (with Tatjana Hörnle) (2014); The Oxford Handbook of Criminal Law (with Tatjana Hörnle) (2014); Foundational Texts in Modern Criminal Law (2014); The Sense of Justice: Empathy in Law and Punishment (2006) (available open access through Open Square @ NYU Press); The New Police Science: The Police Power in Domestic and International Governance (with Mariana Valverde) (2006); The Police Power: Patriarchy and the Foundations of American Government (2005); and Victims in the War on Crime (2002) (available open access through Open Square @ NYU Press). Journals in which his work has appeared include, among others, Stanford Law Review, Columbia Law Review, Michigan Law Review, Law & History Review, American Journal of Comparative Law, Journal of Criminal Law & Criminology, Zeitschrift für die gesamte Strafrechtswissenschaft, Kritische Vierteljahresschrift für Gesetzgebung und Rechtswissenschaft, Leiden Journal of International Law, and Journal of International Criminal Justice.From 2016-2022, Markus served as director of the University of Toronto's interdisciplinary Centre for Ethics, where he launched the Ethics of AI Lab, the Race, Ethics + Power Project, and the multimedia C4eJournal. Previously, Markus established the Buffalo Criminal Law Center at SUNY Buffalo, including the Criminal Law LL.M. Program, the Herbert Wechsler National Criminal Moot Court Competition, and the Buffalo Criminal Law Review (now New Criminal Law Review). He is also founding editor-in-chief of Ethics in Context (Oxford), Oxford Handbooks Online (Law), Critical Perspectives on Law and Crime (Stanford), and the online open-access journal Critical Analysis of Law (with Simon Stern). Other career highlights include appearing on Penelope von Schnitzel's show What in the World Do You Do?, being name dropped by Jill Lepore in the New Yorker, and hosting an academic event that featured a choir, a Poet Laureate, a printmaker, and items from the University of Toronto's Leonard Cohen collection.➤ International visitors: Over the years, I've served as academic host for junior and senior researchers in my areas of interest from various countries (including Australia, Austria, China, Finland, Germany, Israel, Italy, Japan, Poland, Singapore, Switzerland, UK, and US), who are provided with access to university resources during their research visit (library access and, if available, work space); financial support is not available. Send inquiries to markus.dubber@utoronto.ca. Projects & ResourcesEthics of AI in Context     Oxford Handbook of Ethics of AI: Online CompanionCAL     CAL Lab: Critical Analysis of Law @ UofT     CAL: An International & Interdisciplinary Law Review     CAL for Students: A Tool Kit & Read-in Group     CAL Flix: Student View-insCriminal Law     Criminal Law: A Comparative Approach     Foundational Texts in Modern Criminal Law [companion website]     An Introduction to the Model Penal Code     Oxford Handbook of Criminal Law     Criminal Law Web     Criminal Law @ UofT     Criminal Law LLM Program     Criminal Law Sciences Club     The Dual Penal State (PiPP) [https:\/\/uoft.me\/dualpenalstate]UofT     Law @ UofT: Law as a Great University Subject      Infinite Summer @ UofT Law   Course MaterialsCriminal Law     eCasebookAdministrative Law     Points of PowerCritical Perspectives on Law     ReadingsLegal Process     Annotated Outline & Syllabus Other infoSSRNGoogle ScholarWorldCatYouTubeTwitter",
    "listed_research_areas":null
  },
  {
    "faculty":"u_toronto",
    "name":"Alexander Dyck",
    "title":null,
    "email":"adyck@rotman.utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/alexander-dyck",
    "bio":"Professor of Finance and Economic Analysis and Policy, Manulife Financial Chair in Financial Services Rotman School webpage Alexander Dyck is a Professor of Finance and Economic Analysis and Policy at the Rotman School and the Manulife Financial Chair in Financial Services. He holds a non-budgetary cross-appointment at the Faculty of Law.Professor Dyck is also a board member of the Rotman International Center for Pension Management, and a Fellow at the Michael Lee-Chin Family Institute for Corporate Citizenship at the Rotman School. Previously, he was Associate Professor at the Harvard Business School. In 2009-2010, he was a visiting scholar in Finance at INSEAD. Professor Dyck teaches PhD and MBA courses in Corporate Finance, Mergers and Acquisitions and Private Equity. His research interests include corporate governance, corporate finance, corporate social responsibility, regulation and privatization, the media and financial markets, and taxation. Research Interests: Business Corporations; Business Law; Privacy Law; Securities Regulation; Tax Law",
    "listed_research_areas":"Business Corporations; Business Law; Privacy Law; Securities Regulation; Tax Law"
  },
  {
    "faculty":"u_toronto",
    "name":"David Dyzenhaus",
    "title":null,
    "email":"david.dyzenhaus@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/david-dyzenhaus",
    "bio":"University Professor of Law and Philosophy and Albert Abel Chair Jackman Law BuildingRoom J42478 Queen's ParkToronto, Ontario M5S 2C5 David Dyzenhaus is a professor of Law and Philosophy at the University of Toronto,  a Fellow of the Royal Society of Canada and a Corresponding Fellow of the British Academy.  He holds the Albert Abel Chair of Law and was appointed in 2015 to the rank of University Professor. He has taught in South Africa, England, Canada, Singapore, New Zealand, Hungary, Mexico and the USA. He holds a doctorate from Oxford University and law and undergraduate degrees from the University of the Witwatersrand, South Africa. In 2002, he was the Law Foundation Visiting Fellow in the Faculty of Law, University of Auckland. In 2005-06 he was Herbert Smith Visiting Professor in the Cambridge Law Faculty and a Senior Scholar of Pembroke College, Cambridge. In 2014-15, he was the Arthur Goodhart Visiting Professor in Legal Science in Cambridge. In 2016-17, he was a Fellow of the Wissenschaftskolleg zu Berlin. In 2020-21, he was a Guggenheim Fellow and a Visiting Fellow of All Souls College, Oxford.Professor Dyzenhaus is the author of Hard Cases in Wicked Legal Systems: South African Law in the Perspective of Legal Philosophy (now in its second edition), Legality and Legitimacy: Carl Schmitt, Hans Kelsen, and Hermann Heller in Weimar, and Judging the Judges, Judging Ourselves: Truth, Reconciliation and the Apartheid Legal Order. He has edited and co-edited several collections of essays. In 2004 he gave the JC Smuts Memorial Lectures to the Faculty of Law, Cambridge University. These were published by Cambridge University Press in 2006 as The Constitution of Law: Legality in a Time of Emergency. He is editor of the University of Toronto Law Journal and co-editor of the series Cambridge Studies in Constitutional Law. His most recent book is The Long Arc of Legality: Hobbes, Kelsen, Hart (Cambridge, 2022). Research Interests: Administrative Law; Comparative Law; Legal Theory; Moral Philosophy; National Security Law and Anti-Terrorism Law; Political Philosophy and Theory",
    "listed_research_areas":"Administrative Law; Comparative Law; Legal Theory; Moral Philosophy; National Security Law and Anti-Terrorism Law; Political Philosophy and Theory"
  },
  {
    "faculty":"u_toronto",
    "name":"Anver Emon",
    "title":null,
    "email":"anver.emon@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/anver-emon",
    "bio":"Professor of Law and History;                \r Canada Research Chair in Islamic Law and History;\r Director, Institute of Islamic Studies Jackman Law BuildingRoom J46678 Queen's ParkToronto, Ontario M5S 2C5  Website: www.anveremon.com Anver M. Emon studies pre-modern and modern Islamic legal history, the role of Shari'a both inside and outside the Muslim majority world, and the historiography of that that field of knowledge production. Since 2018, his appointment is split between the Faculty of Law and the Department of History in the Faculty of Arts and Sciences. In the Faculty of Law, he has taught torts, constitutional law, racial politics and the law, legal ethics, and statutory interpretation. In history, he teaches in the field of Islamic legal history, law and religion, and historical epistemology in Islamic studies. He was named as a 2014 Guggenheim Fellow in the field of law, a member of the College of the Royal Society of Canada and awarded its 2017 Kitty Newman Memorial Award in Philosophy, and Senior Fellow, Massey College. The recipient of numerous research grants, he recently received two grants from the Social Sciences and Humanities Research Council (SSHRC) for the projects: \"Muslims in Canada Archive\" (2020-2024) and \"On CRA Audits of Muslim-Led Faith Based Charities\" (2020-2021). In addition to publishing numerous articles, Professor Emon is the author of The 'Islamic' Deployed: The Study of Islam in Four Registers (Middle East Law and Governance, 2019), Islamic Natural Law Theories (Oxford University Press, 2010), and Religious Pluralism and Islamic Law: Dhimmis and Others in the Empire of Law (Oxford University Press, 2012), as well as the co-editor of Islamic Law and International Human Rights Law: Searching for Common Ground? (Oxford University Press, 2012).  He is the founding editor of Middle East Law and Governance: An Interdisciplinary Journal, and series editor of the Oxford Islamic Legal Studies Series.For a profile of his research, see the review in International Innovation. Research Interests: Critical Legal Theory; Islamic Law; Judicial Decision-Making; Law and Religion; Legal History; Legal Theory",
    "listed_research_areas":"Critical Legal Theory; Islamic Law; Judicial Decision-Making; Law and Religion; Legal History; Legal Theory"
  },
  {
    "faculty":"u_toronto",
    "name":"Christopher Essert",
    "title":null,
    "email":"chris.essert@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/christopher-essert",
    "bio":"Associate Professor and Associate Dean, JD Program Flavelle HouseRoom FL34278 Queen's ParkToronto, Ontario M5S 2C5 Christopher Essert, BA (McGill), JD (Toronto), LLM, JSD (Yale Law School) is Associate Professor at the Faculty of Law and the Associate Dean of the JD Program. He teaches and researches in private law, property and tort theory, and legal and political philosophy.His work has appeared in journals including Philosophy & Public Affairs, Legal Theory, Law and Philosophy, Jurisprudence, the McGill Law Journal, and the University of Toronto Law Journal. His main current research project is a book on property law and theory, defending an account of property law and its relation to equality.Professor Essert serves as a member of the International Advisory Panel for the American Law Institute’s project on the Restatement of the Law (Fourth), Property and has  participated in consultations regarding the National Housing Strategy. He is also a Faculty Affiliate at the School of Cities.Prior to joining the UofT Faculty of Law, Professor Essert was Associate Professor at the Faculty of Law at Queen’s University, and a Visiting Professor at UCLA School of Law. He also served as law clerk to Justice Michel Bastarache at the Supreme Court of Canada, and articled at Paliare Roland LLP. Research Interests: Equality and Anti-Discrimination Law; Intellectual Property Law; Legal Theory; Political Philosophy and Theory; Property Law; Tort Law and Tort Theory",
    "listed_research_areas":"Equality and Anti-Discrimination Law; Intellectual Property Law; Legal Theory; Political Philosophy and Theory; Property Law; Tort Law and Tort Theory"
  },
  {
    "faculty":"u_toronto",
    "name":"Mohammad Fadel",
    "title":null,
    "email":"mohammad.fadel@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/mohammad-fadel",
    "bio":"Full Professor & Former Canada Research Chair for the Law and Economics of Islamic Law (2006-16) Jackman Law BuildingRoom J48478 Queen's ParkToronto, Ontario M5S 2C5 Mohammad H. Fadel is a Full Professor at the Faculty of Law, which he joined in January 2006. Professor Fadel wrote his Ph.D. dissertation on legal process in medieval Islamic law while at the University of Chicago and received his JD from the University of Virginia School of Law. Professor Fadel was admitted to the Bar of New York in 2000 and practiced law with the firm of Sullivan & Cromwell LLP in New York, New York, where he worked on a wide variety of corporate finance transactions and securities-related regulatory investigations. Professor Fadel also served as a law clerk to the Honorable Paul V. Niemeyer of the United States Court of Appeals for the 4th Circuit and the Honorable Anthony A. Alaimo of the United States District Court for the Southern District of Georgia. Professor Fadel has published numerous articles in Islamic legal history and Islam and liberalism. Research Interests: Business Corporations; Economic Analysis of Law; Family Law; International Law; Islamic Law; Law and Globalization; Political Philosophy and Theory; Securities Regulation",
    "listed_research_areas":"Business Corporations; Economic Analysis of Law; Family Law; International Law; Islamic Law; Law and Globalization; Political Philosophy and Theory; Securities Regulation"
  },
  {
    "faculty":"u_toronto",
    "name":"Angela Fernandez",
    "title":null,
    "email":"angela.fernandez@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/angela-fernandez",
    "bio":"Professor Jackman Law BuildingRoom J45878 Queen's ParkToronto, Ontario M5S 2C5 Angela Fernandez is a Full Professor at the Faculty of Law at the University of Toronto with a cross-appointment in the Department of History. Her research focuses on a particular style of legal history called \"legal archaeology,\" including a book-length study on an (in)famous first possession property case involving a fox: Pierson v. Post, the Hunt for the Fox: Law and Professionalization in American Legal Culture (Cambridge University Press, 2018).Professor Fernandez is very interested in animals and the law. She is a member of the Scholars Committee of the Brooks Institute for Animal Rights, Law & Policy and the collaborative research network BASAN (Brooks Animal Studies Academic Network). She sits on the Board of Advisors and is a Director of Animal Justice Canada. She is also a fellow with the Oxford Centre for Animal Ethics.In addition to \"Animals and the Law\" (taught in the Fall of 2021 and 2022) and her legal history seminar (\"Legal Archaeology: Studies of Cases in Context\"), Professor Fernandez teaches Contracts. She is also the Chair of the Directed Research Program and is interested in supervising students on animal law and legal history topics. Professor Fernandez is the inaugural scholar in the \"Brooks U\" series, \"Fundamentals of Animal Law,\" where you can find a copy of her paper \"Animals as Property, Quasi-Property or Quasi-Person\" and an accompanying video. She can also be seen speaking about this topic at a public lecture at New York University, Yale Law School's Law, Ethics and Animals Program (LEAP), and the Cambridge Centre for Animal Rights Law series Talking Animals, Law & Philosophy. All videos are available on the Faculty of Law Youtube Animal Law Playlist. Research Interests: Animal Law; Critical Legal Theory; Law and Literature; Legal History; Legal Theory",
    "listed_research_areas":"Animal Law; Critical Legal Theory; Law and Literature; Legal History; Legal Theory"
  },
  {
    "faculty":"u_toronto",
    "name":"Andrew Green",
    "title":null,
    "email":"a.green@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/andrew-green",
    "bio":"Professor, Metcalf Chair in Environmental Law Flavelle HouseRoom FL 34278 Queen's ParkToronto, Ontario M5S 2C5 Professor Green is Professor and Metcalf Chair in Environmental Law at the University of Toronto, Faculty of Law.  He teaches environmental law, climate change law, administrative law, natural resources law, judicial decision-making and international trade.  Andrew writes in the areas of domestic environmental law including Canadian climate change law and policy, administrative law, judicial decision-making (including empirical work on how judges make decisions) and international trade (how trade rules interact with domestic environmental law).  His books include Picking up the Slack: Law, Institutions and Canadian Climate Policy (University of Toronto Press, 2022), Commitment and Cooperation on High Courts: A Cross-Country Examination of Institutional Constraints on Judicial Decision-making (with Ben Alarie) (Oxford University Press, 2017), Reconciling Trade and Climate: How the WTO Can Help Address Climate Change (with Tracey Epps) (Edward Elgar, 2010) and A Globally Integrated Climate Policy for Canada (University of Toronto Press, 2008) (with Jutta Brunneé, Steven Bernstein and David Duff).  Andrew is currently co-President of the Society for Empirical Legal Studies.  He is past President of the Canadian Law and Economics Association and former Associate Dean at the Faculty of Law.  He was a Chair of the University of Toronto Academic Appeals Committee between 2009 and 2018.Prior to joining the Faculty of Law, Andrew practiced environmental law in Toronto for six years.  His practice encompassed both litigation (including prosecutions, administrative appeals and civil actions) and transactional work. Research Interests: Administrative Law; Economic Analysis of Law; Environmental Law; International Law; International Trade Law; Judicial Decision-Making",
    "listed_research_areas":"Administrative Law; Economic Analysis of Law; Environmental Law; International Law; International Trade Law; Judicial Decision-Making"
  },
  {
    "faculty":"u_toronto",
    "name":"Gillian Hadfield",
    "title":null,
    "email":"g.hadfield@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/gillian-hadfield",
    "bio":"Schwartz Reisman Chair in Technology and Society, Professor of Law and Professor of Strategic Management. CIFAR AI Chair. Director, Schwartz Reisman Institute for Technology and Society Jackman Law Building, room J44078 Queen's ParkToronto, Ontario M5S 2C5 Personal website Gillian Hadfield is the inaugural Schwartz Reisman Chair in Technology and Society, Professor of Law, Professor of Strategic Management at the University of Toronto and holds a CIFAR AI Chair at the Vector Institute for Artificial Intelligence. She is also the inaugural Director of the Schwartz Reisman Institute for Technology and Society. Her research is focused on innovative design for legal and dispute resolution systems in advanced and developing market economies; governance for artificial intelligence (AI); and computational models of human and machine normative systems.  She has also long studied the markets for law, lawyers, and dispute resolution; and contract law and theory. She teaches Contracts and Governance of AI.Prior to rejoining the University of Toronto in 2018, Professor Hadfield was the Richard L. and Antoinette Schamoi Kirtland Professor of Law and Professor of Economics at the University of Southern California from 2001 to 2018.  She began her teaching career at the University of California Berkeley and was previously on the University of Toronto Faculty of Law from 1995-2000. Her book Rules for a Flat World: Why Humans Invented Law and How to Reinvent It for a Complex Global Economy was published by Oxford University Press in 2017 and in paperback with an updated prologue focused on AI in 2020.Professor Hadfield served as clerk to Chief Judge Patricia Wald on the U.S. Court of Appeals, D.C. Circuit.  She was the Daniel R. Fischel and Sylvia M. Neil Distinguished Visiting Professor of Law at the University of Chicago (Fall 2016), the Eli Goldston Visiting Professor (Spring 2012) and the Sidley Austin Visiting Professor (Winter 2010) at Harvard Law School, and the Justin W. D'Atri Visiting Professor of Law, Business and Society at Columbia Law School (Fall 2008.) She was a 2022 Fellow at the Rockefeller Foundation's Bellagio Center in 2022, 2006-07 and 2010-11 fellow of the Center for Advanced Study in the Behavioral Sciences and a National Fellow at the Hoover Institution in 1993. She also has held Olin Fellowships at Columbia Law School, Cornell Law School, and USC. She is president of the Society for Institutional and Organizational Economics, past president of the Canadian Law and Economics Association, a former director of the American Law and Economics Association and the Society for Institutional and Organizational Economics and a member of the American Law Institute.  She has served on the editorial boards for the Annual Review of Law and Social Science, Law and Social Inquiry and the University of Toronto Law Journal and is a founding trustee of the Cooperative AI Foundation.Professor Hadfield is a Senior Policy Advisor for OpenAI in San Francisco, and an advisor to courts and several organizations and technology companies engaged in innovating new ways to make law and policy smarter, more accessible, and more responsive to technology and artificial intelligence, including the Hague Institute for Innovation of Law, LegalZoom, and Responsive Law. She was a member of the World Economic Forum’s Future Council for Agile Governance and co-curated their Transformation Map for Justice and Legal Infrastructure; she previously served on the Forum’s Future Council for Technology, Values and Policy and Global Agenda Council for Justice; and was a member of the American Bar Association’s Commission on the Future of Legal Education, Bepress Research Interests: Contracts; Economic Analysis of Law; Law and Globalization; Law and International Development",
    "listed_research_areas":"Contracts; Economic Analysis of Law; Law and Globalization; Law and International Development"
  },
  {
    "faculty":"u_toronto",
    "name":"Ran Hirschl",
    "title":null,
    "email":"ran.hirschl@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/ran-hirschl",
    "bio":"Professor of Political Science and Law Sidney Smith HallRoom 3125100 St. George StreetToronto, Ontario Ran Hirschl (PhD, Yale) is Professor of Political Science and Law, and a Fellow of the Royal Society of Canada. His research interests focus on comparative public law, and in particular the intersection of comparative politics and comparative constitutionalism. He is the author of four books: City, State: Constitutionalism and the Megacity (Oxford University Press, 2020)—winner of the 2021 Stein Rokkan Prize in Comparative Social Science Research; Comparative Matters: The Renaissance of Comparative Constitutional Law (Oxford University Press, 2014 & 2016)—winner of the 2015 APSA C. Herman Pritchett Award for the best book on law & courts; Constitutional Theocracy (Harvard University Press, 2010)—winner of the 2011 Mahoney Prize in Legal Theory; and Towards Juristocracy: The Origins and Consequences of the New Constitutionalism (Harvard University Press, 2004 & 2007)—winner of the 2021 APSA Law & Courts Section Lasting Contribution Award, as well as over one hundred articles and book chapters on comparative constitutionalism and judicial review, public law, the judicialization of politics, constitutional law and religion, and the intellectual history of comparative constitutional inquiry published in scholarly venues such as Comparative Politics, Law & Social Inquiry, Political Theory, Human Rights Quarterly, Constellations, Annual Review of Political Science, the Oxford Handbook of Law & Politics, the Journal of Political Philosophy, Annual Review of Law & Social Science, Revue Francaise de Science Politique, International Journal of Constitutional Law, Harvard International Law Review, Texas Law Review, University of Chicago Law Review, and the American Journal of Comparative Law. Professor Hirschl has been a Fellow at Stanford University’s Center for Advanced Study in the Behavioral Sciences, Maimonides Fellow at the Institute for the Advanced Study of Law and Justice (NYU), a Fulbright Fellow at Yale, and a Fellow at Princeton University’s Program in Law and Public Affairs. He served as distinguished visiting professor of law at the National University of Singapore (NUS), Harvard Law School and NYU Law School. From 2006 to 2016 he held the Tier I Canada Research Chair in Constitutionalism, Democracy and Development. In 2010, he received a University of Toronto award for outstanding teaching, and delivered the Annual Lecture in Law and Society at Oxford University. In 2012, he was awarded a Killam Research Fellowship—one of Canada’s most prestigious research awards—by the Canada Council for the Arts, and delivered the Annual Julius Stone Address at the University of Sydney. From 2015 to 2018, he served as co-president of the International Society of Public Law, and has been an editorial board member of several leading journals, as well as the co-editor of a book series on comparative constitutional law and policy published by Cambridge University Press. In 2016, he was awarded a prestigious five-year Alexander von Humboldt International Research Award, to be hosted by the University of Göttingen. In 2018, he was granted a three-year Max Planck Fellow award in comparative constitutionalism. His work on the intersection of public law and comparative politics has been translated into various languages, discussed in numerous scholarly fora, cited in high court decisions (most recently by the Supreme Court of Canada in November 2020), and addressed in media venues from the New York Times to the Jerusalem Post. Research Interests: Canadian Constitutional Law; Comparative Law; Judicial Decision-Making; Law and Globalization; Law and International Development; Law and Religion",
    "listed_research_areas":"Canadian Constitutional Law; Comparative Law; Judicial Decision-Making; Law and Globalization; Law and International Development; Law and Religion"
  },
  {
    "faculty":"u_toronto",
    "name":"Edward Iacobucci",
    "title":null,
    "email":"edward.iacobucci@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/edward-iacobucci",
    "bio":"Professor & TSE Chair in Capital Markets Jackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5 Edward M. Iacobucci, B.A. (Hons.) (Queen's) 1991; M.Phil. (Oxon.) 1993 (Rhodes Scholar, Ontario); LL.B. (Toronto) 1996, was appointed Dean and James M. Tory Professor of Law on January 1, 2015.  Prior to this appointment he was Osler Chair in Business Law and Professor of Law at the Faculty of Law, University of Toronto, and Associate Dean, Research.  He started at the Faculty of Law in 1998.  He was a Visiting Professor at Tsinghua University School of Law in 2010 and 2018, Visiting Professor, NYU@NUS Program in 2014, Visiting Professor at New York University Law School in 2007, Visiting Professor at University of Chicago Law School in 2003, and a John M. Olin Visiting Fellow at Columbia University Law School in 2002.  Prior to joining the Faculty of Law, he was the John M. Olin Visiting Lecturer at the University of Virginia in 1997-98 and served as Law Clerk at the Supreme Court of Canada for Mr. Justice John Sopinka in 1996-97. He won a teaching prize at the Faculty of Law in 2000 and was a joint winner with his co-authors of the 2002-3 Doug Purvis Prize in Canadian Economics for The Law and Economics of Canadian Competition Policy.  His areas of interest include corporate law, competition law, and law and economics more generally. Research Interests: Business Corporations; Competition Law; Economic Analysis of Law; Securities Regulation",
    "listed_research_areas":"Business Corporations; Competition Law; Economic Analysis of Law; Securities Regulation"
  },
  {
    "faculty":"u_toronto",
    "name":"Larissa Katz",
    "title":null,
    "email":"larissa.katz@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/larissa-katz",
    "bio":"Professor and Canada Research Chair in Private Law Theory; Associate Dean, Graduate Programs Jackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5 Larissa Katz is Professor of Law and Canada Research Chair in Private Law Theory. She is also the Associate Dean (Graduate Programs). She is cross-appointed to the Munk School of Global Affairs and Public Policy. Prior to joining the Faculty of Law in 2013, Professor Katz clerked for the late Justice Charles D. Gonthier at the Supreme Court of Canada, worked in litigation at Sullivan & Cromwell LLP (NYC) and taught at Queen’s University, Faculty of Law.Professor Katz writes about moral, political and social issues relating to private law generally and property law in particular. Her work appears in journals such as Theoretical Inquiries in Law, Yale Law Journal, University of Pennsylvania Law Review, Legal Theory, Jurisprudence, University of Toronto Law Journal, McGill Law Journal and the Canadian Journal of Law and Jurisprudence, Cornell Journal of Law and Public Policy (forthcoming), Notre Dame Law Review (forthcoming). Her work is included in anthologies such as The Philosophical Foundations of Property Law (Oxford University Press), The Philosophical Foundations of Equity, The Cambridge Companion to Law and Philosophy (Cambridge U. Press). Professor Katz is currently writing People and Things: Property in the Legal Order (under contract with Oxford University Press).Professor Katz has been a visiting fellow at the John Fleming Centre for the Advancement of Legal Research at the Australian National University, a Visiting Professor at Sciences Po (Paris) and an HLA Hart Visiting Fellow at the Oxford Center for Ethics & Philosophy of Law, Oxford University. Professor Katz actively works on issues in law and policy in Canada and the United States. Professor Katz serves as a member of the International Advisory Panel for the American Law Institute’s project on the Restatement of the Law (Fourth), Property.Professor Katz is an Associate Editor of Law and Philosophy and on the advisory board of Queen’s Law Journal. Research Interests: Equity and Trusts; Private Law Theory; Property Law",
    "listed_research_areas":"Equity and Trusts; Private Law Theory; Property Law"
  },
  {
    "faculty":"u_toronto",
    "name":"Ariel Katz",
    "title":null,
    "email":"ariel.katz@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/ariel-katz",
    "bio":"Associate Professor Jackman Law BuildingRoom J34078 Queen's ParkToronto, Ontario M5S 2C5 Ariel Katz is an Associate Professor at the Faculty of Law, University of Toronto. Professor Katz received his LL.B. and LL.M from the Hebrew University of Jerusalem and his SJD from the University of Toronto. His general area of research involves economic analysis of competition law and intellectual property law, with allied interests in electronic commerce, pharmaceutical regulation, the regulation of international trade, and particularly the intersection of these fields. Between 2009 and 2012 Professor Katz was the Director of the Centre for Innovation Law and Policy. Prior to joining the University of Toronto Professor Katz was a staff attorney at the Israeli Antitrust Authority. While there, he litigated several merger appeals and restrictive arrangements cases before the Antitrust Tribunal and negotiated regulatory settlements. Professor Katz currently teaches courses on intellectual property, cyberlaw, and the intersection of competition law and intellectual property, and shares some of his current thoughts on these issues on his blog. Research Interests: Competition Law; Economic Analysis of Law; Intellectual Property Law",
    "listed_research_areas":"Competition Law; Economic Analysis of Law; Intellectual Property Law"
  },
  {
    "faculty":"u_toronto",
    "name":"Karen Knop",
    "title":null,
    "email":"k.knop@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/karen-knop",
    "bio":"Professor & Cecil A. Wright Chair (1960-2022) Jackman Law Building78 Queen's Park Toronto, Ontario M5S 2C5 It is with immense sadness that the Faculty of Law announces the passing of our dear colleague, Karen Knop, on September 26, 2022. Karen held the Faculty’s Cecil A. Wright Chair.Karen Knop, B. Sc. (Hons.), LL.B. (Dalhousie), LL.M. (Columbia), S.J.D. (Toronto), is a professor at the Faculty of Law.  She was editor of the University of Toronto Law Journal from 2007 to 2012, and associate dean for research from 2016 to 2018.  She teaches in the areas of public international law, private international law, foreign relations law and citizenship law, and is a past recipient of an award from the university student organizations for excellence in teaching.Professor Knop writes on issues of diversity, interpretation and participation in public international law.  While such issues are usually studied as part of international human rights law, her scholarship is broadly concerned with the challenges of gender and cultural differences to core concepts in public international law, including sovereignty, self-determination, nationality and the relationship between international and domestic law.  Her recent articles develop alternative approaches to these topics by turning to private international law and foreign relations law.Professor Knop’s book Diversity and Self-Determination in International Law (Cambridge University Press) was awarded a Certificate of Merit by the American Society of International Law.  She is the editor of Gender and Human Rights (Oxford University Press), co-editor of Re-Thinking Federalism: Citizens, Markets and Governments in a Changing World (UBC Press) (with Sylvia Ostry, Richard Simeon and Katherine Swinton), and co-editor of a symposium issue of the journal Law and Contemporary Problems on “Transdisciplinary Conflict of Laws” (with Ralf Michaels and Annelise Riles).  Her articles have appeared in the Cornell Law Review, European Journal of International Law, NYU Journal of International Law and Politics, Osgoode Hall Law Journal, Stanford Law Review and Transnational Legal Theory, among others.  Professor Knop currently holds a Social Sciences and Humanities Research Council (SSHRC) grant for a project entitled “A Missing Field: Foreign Relations Law of Canada” (with Robert Wai).Professor Knop is a Max Planck Law Fellow (Germany) and was the 2020-21 Jane and Aatos Erkko Visiting Professor in Studies on Contemporary Society at the Helsinki Collegium for Advanced Studies, University of Helsinki.  She has also been a British Academy visiting fellow at the Centre for Women, Peace and Security, London School of Economics; a visiting professor at Georgetown University Law Center; a visiting fellow at the University of Melbourne Law School; the J.C. Smith Visiting Fellow at the University of Nottingham School of Law and a senior fellow at the Center for International Studies, New York University School of Law.  Professor Knop sits on the editorial boards of Critical Analysis of Law, the London Review of International Law, Queen's Law Journal, the University of Toronto Law Journal and the American Journal of International Law, where she chaired the editorial committee of AJIL Unbound, the new online component of the Journal, from 2014 to 2017.  In 2020 she delivered a course at the Hague Academy of International Law and will give the Herbert Bernstein Lecture in Comparative and International Law at Duke University School of Law in 2022. Research Interests: International Law",
    "listed_research_areas":"International Law"
  },
  {
    "faculty":"u_toronto",
    "name":"Brian Langille",
    "title":null,
    "email":"brian.langille@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/brian-langille",
    "bio":"Professor Jackman Law BuildingRoom J45478 Queen's ParkToronto, Ontario M5S 2C5 A native of Nova Scotia, Professor Langille joined the faculty at Dalhousie Law School in 1978 and moved to the Faculty of Law at the University of Toronto in 1983, becoming Full Professor in 1989. He is the former Associate Dean of Graduate Studies (1999-2002) and former Acting (2003-04) and Interim Dean (2005) of the Law Faculty. He was Director of the Law Faculty’s Legal Theory Workshop from 1986-1999. He has been a Visiting Professor at a number of Law Schools around the world as well as a Fellow at the European University Institute in Florence and the Institute for Advanced Studies at Nantes, France.Professor Langille has lectured in many parts of the world on matters of globalization and social justice and also acted as advisor on constitutional and international labour law to the governments of several Canadian provinces, the Canadian Federal Government (Department of Foreign Affairs and International Trade; Human Resources and Social Development Canada), and international labour law to the North American Commission on Labour Cooperation, the International Labour Organization, and the World Commission on the Social Dimension of Globalization. He has been a member of several Canadian government delegations to the ILO, acted as a Rapporteur for the OECD, is an Editor of the International Labour Law Reports, a member of the Board of Advisors of the International Labour Review, and was a member of the executive of the International Society for Labour and Social Security Law from 1996 to 2006. Professor Langille completed a nine-year term as a Governor of the University of Toronto in 2003. He is also an experienced labour arbitrator. Research Interests: Charter of Rights; Contracts; International Law; Labour Law; Law and Globalization; Legal Theory",
    "listed_research_areas":"Charter of Rights; Contracts; International Law; Labour Law; Law and Globalization; Legal Theory"
  },
  {
    "faculty":"u_toronto",
    "name":"Ian Lee",
    "title":null,
    "email":"ian.lee@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/ian-lee",
    "bio":"Associate Professor Jackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5 Ian B. Lee clerked with Justice Claire L'Heureux-Dubé of the Supreme Court of Canada and Justice Mark MacGuigan of the Federal Court of Appeal, and later served as a legal researcher with the Privy Council Office. He practised with Sullivan & Cromwell LLP in Paris, France, and New York, New York, before joining the Faculty of Law in 2003. He served as Associate Dean (JD Program) from 2012 to 2015. His teaching and research interests are in the areas of constitutional law, corporate law and European Union law. He has also taught at the University of Sydney Law School and at the University of Graz. Professor Lee is admitted to practice in Ontario and New York. Research Interests: Business Corporations; Canadian Constitutional Law; Charter of Rights; Comparative Law",
    "listed_research_areas":"Business Corporations; Canadian Constitutional Law; Charter of Rights; Comparative Law"
  },
  {
    "faculty":"u_toronto",
    "name":"Trudo Lemmens",
    "title":null,
    "email":"trudo.lemmens@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/trudo-lemmens",
    "bio":"Professor, Scholl Chair in Health Law and Policy 78 Queen's Park Toronto, Ontario M5S 2C3Twitter: @TrudoLemmens Trudo Lemmens, CandJur, LicJur (KULeuven), LLM bioethics, DCL (McGill), is Professor and Scholl Chair in Health Law and Policy. He is cross appointed to the Dalla Lana School of Public Health, the Faculty of Medicine, and the Joint Centre for Bioethics. His research focuses on the interaction between law, governance tools, and ethical norms and values in the context of health care, biomedical research, pharmaceutical and other health product development, and knowledge production.Since joining the Faculty of Law, professor Lemmens has been a member of the School of Social Science of the Institute for Advanced Study in Princeton, a visiting fellow of the Royal Flemish Academy of Belgium for Science and the Arts, a visiting professor at the K.U.Leuven (Belgium), the Pontificia Universidad Javeriana (Bogota, Colombia), the University Torcuato di Tella (Buenos Aires, Argentina), and the University of Otago (Dunedin, New Zealand) ; a Plumer Visiting Fellow at Oxford’s St. Anne’s College, and an academic visitor at the Faculty of Law and the HeLEX Center for Health, Law and Emerging Technologies of the University of Oxford.Professor Lemmens’ publications include the co-authored book Reading the Future? Legal and Ethical Challenges of Predictive Genetic Testing, the co-edited volumes Regulating Creation: The Law, Policy and Ethics of Assisted Human Reproduction, and Law and Ethics in Biomedical Research: Regulation, Conflict of Interest, and Liability, as well as numerous chapters and articles in national and international law, policy, science, medicine and bioethics journals. He has been consulted widely by national and international organizations and has presented in the area of his expertise before a variety of parliamentary committees. He is currently a member of the Advisory Committee on Health Research of the Pan American Health Organization. In the last five years, he was a member of two expert panels of the Council of Canadian Academies: one on access to health data, the other on advance requests and medical assistance in dying. Research Interests: Health Law",
    "listed_research_areas":"Health Law"
  },
  {
    "faculty":"u_toronto",
    "name":"Ron Levi",
    "title":null,
    "email":"ron.levi@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/ron-levi",
    "bio":"Professor of Global Affairs & Public Policy and Sociology; Distinguished Professor of Global Justice; Director, Global Justice Lab, Munk School of Global Affairs & Public Policy 315 Bloor Street West, Room 213 url: http:\/\/individual.utoronto.ca\/ronlevi\/ Ron Levi is Professor at the Munk School of Global Affairs & Public Policy and the Department of Sociology, and is Distinguished Professor of Global Justice. He holds a courtesy cross-appointment to the Faculty of Law, and is a Permanent Visiting Professor at the University of Copenhagen.Ron works at the intersection of the sociology of law and political sociology. He studies two related questions: (1) responses to crime, violence, repression, and atrocities, through legal institutions, in collective memory, and across professional groups; and (2) how legal ideas are institutionally promoted across eras and political contexts, and how individuals and groups grapple with them. He directs the Global Justice Lab in the Munk School, which works with justice systems under stress.In recent years, Ron has taught courses on events and turbulent times; police violence in global affairs; the sociology of atrocities; law, politics and globalization; justice measurement; and the sociology of law.Ron has served as Secretary of the Law and Society Association, and as an elected Council Member for the Sociology of Law section of the American Sociological Association. He was made Chevalier in l'Ordre des Palmes Académiques by the French Government, is a recipient of the Ludwik and Estelle Jus Memorial Human Rights Prize, and has served as Scholar-in-Residence for Holocaust Education Week. In 2022, he received the Global Educator Award from the University of Toronto. Other infoGlobal Justice Lab Research Interests: Comparative Law; Critical Legal Theory; International Law; Law and Globalization",
    "listed_research_areas":"Comparative Law; Critical Legal Theory; International Law; Law and Globalization"
  },
  {
    "faculty":"u_toronto",
    "name":"David Lie",
    "title":null,
    "email":"lie@eecg.toronto.edu",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/david-lie",
    "bio":"Professor, Edward S. Rogers Department of Electrical and Computer Engineering and Department of Computer Science Sandford Fleming Building 10 King’s College Road Toronto, ON M5S 3G4 Personal website David Lie received his BASc from the University of Toronto in 1998, and his MS and PhD from Stanford University in 2001 and 2004, respectively. He is currently a Professor in the Department of Electrical and Computer Engineering at the University of Toronto.  He holds a non-budgetary cross-appointment at the Faculty of Law.He is known for his seminal work on the XOM architecture, which was an early precursor to modern trusted execution processor architectures such as ARM Trustzone and Intel SGX.  He was the recipient of a best paper award at SOSP for this work. David is also a recipient of the MRI Early Researcher Award, Connaught Global Challenge Award and previous holder of a Canada Research Chair.  He developed the PScout Android Permission mapping tool, whose datasets have been downloaded over 10,000 times and used in dozens of subsequent papers.  David has served on various  program committees including OSDI, Usenix Security, IEEE Security & Privacy, NDSS and CCS.  Currently, his interests are focused on securing mobile platforms, cloud computing security and bridging the divide between technology and policy.",
    "listed_research_areas":null
  },
  {
    "faculty":"u_toronto",
    "name":"Sida Liu",
    "title":null,
    "email":"sd.liu@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/sida-liu",
    "bio":"Associate Professor, Department of Sociology 725 Spadina Avenue, Toronto Personal website Professor Sida Liu received his LL.B. degree from Peking University Law School and his Ph.D. in sociology from the University of Chicago. He joined the Department of Sociology at the University of Toronto in 2016 after teaching sociology and law at the University of Wisconsin-Madison. He holds a non-budgetary cross-appointment at the Faculty of Law.Professor Liu’s research interests include the sociology of law, organizations and professions, criminal justice, globalization, and social theory. He has conducted extensive empirical research on China’s legal reform and legal profession, including the globalization of corporate law firms, the political mobilization of criminal defense lawyers, the feminization of judges, and the career mobility of law practitioners. His current project examines China’s influence on the legal professions in Hong Kong and Taiwan. In addition to his empirical work, Professor Liu also writes on sociolegal theory and general social theory, particularly theories of social space and social process following the tradition of Georg Simmel and the Chicago School of sociology.Professor Liu is the author of three books in Chinese and English, most recently, Criminal Defense in China: The Politics of Lawyers at Work (with Terence C. Halliday, Cambridge University Press, 2016). He has also published many articles in leading law and social science journals, including the American Journal of Sociology, Sociological Theory, Law & Society Review, Law & Social Inquiry, China Quarterly, etc. Professor Liu is a Faculty Fellow at the American Bar Foundation, as well as an affiliated scholar of the U.S.-Asia Law Institute at New York University School of Law and the Center on the Legal Profession at Harvard Law School. In 2016-2017, he was a Member of the Institute for Advanced Study in Princeton. Research Interests: Comparative Law; Criminal Law ; Law and Globalization; Legal Process",
    "listed_research_areas":"Comparative Law; Criminal Law ; Law and Globalization; Legal Process"
  },
  {
    "faculty":"u_toronto",
    "name":"Jeffrey MacIntosh",
    "title":null,
    "email":"j.macintosh@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/jeffrey-macintosh",
    "bio":"Professor 78 Queen's ParkToronto, Ontario M5S 2C5 Jeffrey MacIntosh holds the Toronto Stock Exchange Chair in Capital Markets Law at the Faculty of Law and is a past Associate Director and Director of the Capital Markets Institute at the University of Toronto. He holds law degrees from Harvard and Toronto, and a bachelor of science degree from M.I.T. Prior to joining the University of Toronto, Professor MacIntosh served as an assistant professor at Osgoode Hall Law School. He was appointed a John M. Olin Fellow at Yale Law School in 1988-89.  He also served as a member of the Ontario Securities Commission Task Force on Small Business FinancingProfessor MacIntosh specializes in Corporation Law, Corporate Finance, Securities Regulation, Venture Capital, and Small Firm Financing. Research Interests: Business Corporations; Securities Regulation",
    "listed_research_areas":"Business Corporations; Securities Regulation"
  },
  {
    "faculty":"u_toronto",
    "name":"Audrey Macklin",
    "title":null,
    "email":"audrey.macklin@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/audrey-macklin",
    "bio":"Professor & Rebecca Cook Chair in Human Rights Law 78 Queen's ParkToronto, Ontario M5S 2C5 Audrey Macklin is a professor at the Faculty of Law. She holds law degrees from Yale and Toronto, and a bachelor of science degree from Alberta. After graduating from Toronto, she served as law clerk to Mme Justice Bertha Wilson at the Supreme Court of Canada. She was appointed to the faculty of Dalhousie Law School in 1991, promoted to Associate Professor 1998, moved to the University of Toronto in 2000, and became a full professor in 2009. While teaching at Dalhousie, she also served as a member of the Immigration and Refugee Board.Professor Macklin’s teaching areas include criminal law, administrative law, and immigration and refugee law. Her research and writing interests include transnational migration, citizenship, forced migration, feminist and cultural analysis, and human rights. She has published on these subjects in journals such as Refuge and Canadian Woman Studies, and in collections of essays such as The Security of Freedom: Essays on Canada's Anti-Terrorism Bill and Engendering Forced Migration.Prof. Macklin has been active in the Omar Khadr case. See the Omar Khadr case resources page. Research Interests: Administrative Law; Feminist Analysis of Law; Immigration and Citizenship Law; International Law",
    "listed_research_areas":"Administrative Law; Feminist Analysis of Law; Immigration and Citizenship Law; International Law"
  },
  {
    "faculty":"u_toronto",
    "name":"Mayo Moran",
    "title":null,
    "email":"mayo.moran@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/mayo-moran",
    "bio":"Professor of Law, University of Toronto and Provost and Vice-Chancellor of Trinity College, University of Toronto Professor Moran was appointed as the 15th Provost and Vice-Chancellor of Trinity College on July 1, 2014. Prior to assuming her role as Provost, Professor Moran served as the first female Dean of the Faculty of Law at the University of Toronto. As Dean, she led curriculum change, revised the admissions process and created the Asper Centre for Constitutional Rights and the Centre for the Legal Profession, among many other initiatives.  Her strong relationships with students, alumni and faculty led to her successful leadership of a $53 million campaign for the Faculty’s new Jackman Law Building.   Provost Moran has brought to Trinity College her commitment to students.  In 2016, she released the College’s new Strategic Plan: People, Program and Place, which builds upon the College’s reputation for academic excellence and interdisciplinary innovation and focuses on enhancing the whole student experience in order to make the College an even a better place to live, work and learn.  As Provost she has emphasized the student experience with initiatives ranging from mental health and wellness, to revitalized food services, to student services and program enhancements, to infrastructure renewal.Provost Moran’s teaching interests include both private and public law.  She continues to supervise graduate and undergraduate students.  At Trinity she teaches a fourth-year undergraduate course in the Ethics, Society & Law program entitled Ten Cases that Changed the World, which Maclean’s Magazine recently noted as one of the “cool courses” at the University of Toronto.Provost Moran publishes extensively on comparative constitutional law, legal and feminist theory, and historical injustices among other topics. Her book Rethinking the Reasonable Person (OUP) examines how judicial ideas of “normal” behaviour may discriminate against women and girls, and she recently co-edited The Residential Schools Litigation and Settlement special edition of the University of Toronto Law Journal.  Her current work considers how the past became a legal problem and what we should do about it.  She is a frequent guest lecturer and presents scholarly work at conferences around the world.Provost Moran is an active member of many committees both inside and outside the University of Toronto.  Recently she chaired the University of Toronto’s Expert Panel on Sexual Violence Policies and co-chaired the Faculty of Law’s Response to the Truth and Reconciliation Commission Committee.  She also serves on the Council of Ontario Universities Reference Group on Sexual Violence and is a founding member of the Transnational Advisory Group of the Association of American Law Schools.  In 2010, at the request of the Attorney General of Ontario, Provost Moran chaired an inquiry into Strategic Litigation against Public Participation (SLAPP).   The Government of Ontario also appointed her as the Independent Reviewer for the 2013 Review of the Accessibility for Ontarians with Disabilities Act. Since 2007, Provost Moran has chaired the Government of Canada’s Independent Assessment Process Oversight Committee that assists in the implementation of the Indian Residential Schools Agreement.Provost Moran obtained a B.A. (1980, English and Sociology) and B.Ed. (1981) at the University of British Columbia and taught secondary school in northern British Columbia before attending law school. She completed her LL.B. at McGill University (1990), her LL.M. at the University of Michigan (1992) and her S.J.D. at the University of Toronto (1999).  In addition to numerous other awards, in 2012 Provost Moran received a YWCA Woman of Distinction Award. Research Interests: Equality and Anti-Discrimination Law; Legal Theory; Tort Law and Tort Theory",
    "listed_research_areas":"Equality and Anti-Discrimination Law; Legal Theory; Tort Law and Tort Theory"
  },
  {
    "faculty":"u_toronto",
    "name":"Sophia Moreau",
    "title":null,
    "email":"sr.moreau@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/sophia-moreau",
    "bio":"Professor of Law and Philosophy Jackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5 BioSophia Moreau is Professor of Law and Philosophy (with a cross-appointment in the Department of Philosophy), a Faculty Associate at the U of T’s Centre for Ethics, and a Faculty Associate of Victoria College. She is an Associate Editor of Philosophy and Public Affairs, Book Reviews Editor of the University of Toronto Law Journal, and a member of the Editorial Board of Law and Philosophy. Prior to coming to the University of Toronto, she clerked for Chief Justice Beverley McLachlin at the Supreme Court of Canada; was a Frank Knox Memorial Fellow at Harvard University; and was a Commonwealth Scholar at Balliol College Oxford. In 2023, Professor Moreau will be the HLA Hart Distinguished Visiting Fellow at University College, Oxford. She was a Visiting Professor at NYU Law School in the fall of 2022, a Weinstein Fellow at Berkeley in the spring of 2022; and held a Chancellor Jackman Research Fellowship in 2021-22. Major PublicationsProfessor Moreau’s most recent book, Faces of Inequality: A Theory of Wrongful Discrimination,” won the 2022 CPA Book prize. It has been the subject of three international Symposia: a 2022 Review Symposium published in Jurisprudence 12.4 (2022), available here through www.tandfonline.com with essays by Deborah Hellman, Niko Kolodny, Seana Shiffrin, Kasper Lippert-Rasmussen and Rebecca Cook; a 2022 Symposium in the Jerusalem Review of Legal Studies 25.1 (2022), available here, with essays by David Estlund, Cheshire Calhoun, Adi Goldiner and Re’em Segev; and a Symposium in Dialogue forthcoming in 2023 with essays by Andrea Sangiovanni, Alysia Blackham, Pablo Gilabert, Dale Smith, Iyiola Solanke, Jess Eisen, and Daniel Viehoff.Professor Moreau’s other work on discrimination includes articles such as “Discrimination and Subordination”, “The Moral Seriousness of Indirect Discrimination”, “Equality and Discrimination”, “What is Discrimination?”, “Discrimination as Negligence” and “In Defense of a Liberty-Based Account of Discrimination.” Her other books include Philosophical Foundations of Discrimination Law (co-edited with Deborah Hellman) and Law and Morality (co-edited with David Dyzenhaus and Arthur Ripstein).Current ProjectsProfessor Moreau is currently working on three major projects:The Tort Law & Social Equality Project (hyperlink to: www.tortlawandsocialequality.ca), which Professor Moreau runs together with Professors Zoe Sinel (UWO) and Professor Jean Thomas (Queen’s) involves a database tracking the impact of a variety of torts and tort law rules on minority groups in Canada, as well as a monthly Discussion Forum promoting awareness of the ways in which tort law perpetuates social inequalities. See, in connection with this project, the paper “Beyond Anti-Discrimination Law: Combatting Subordination Through Other Laws, such as Tort Law.” “Institutional Roles and Morality” is a research project in normative ethics, which explores the many ways in which morality is structured by our institutional roles and the obligations to which they give rise. For two draft papers connected to this project, see “Morality and Role Obligations” and “Objectionable Obligations” (draft paper). “Systemic Discrimination and Violence Against Indigenous Women” is a research project in legal philosophy and discrimination law, which asks what we can learn about systemic discrimination —its nature and its self-perpetuating mechanisms— by considering the many forms of institutional discrimination that Indigenous women in Canada have faced, which has been extensively documented in the Final Report of Canada’s National Inquiry into Missing and Murdered Indigenous Women and Girls.\"Upcoming TalksOxford University Obligations Discussion Group, Paper Presentation, Feb. 16, 2023Warwick University, Philosophy Graduate Conference, Keynote Lecture, Feb. 18, 2023Oxford University Public Law Discussion Group, Paper Presentation, Feb. 21, 2023Seminar on Normativity and Conventions, Paper presentation, University of Pompeu-Fabra, Feb. 24, 2023Oxford Jurisprudence Discussion Group, Paper presentation, March 2, 2023Uehiro Centre, Faculty of Philosophy, Oxford, Lecture, March 7, 2023King’s Legal and Political Philosophy Workshop, Lecture, King’s College London, March 8, 2023Pacific APA, Commentary on Niko Kolodny’s The Pecking Order, April 5, 2023McGill-Concordia Conference on \"Human Dignity: Theory and Practice,” Paper presentation, April 28, 2023Involvement with the Legal ProfessionProfessor Moreau believes that legal theory should be informed by, and engaged with, legal practice. She was called to the Ontario Bar in 2006. Her approach to discrimination has been cited by the Canadian Supreme Court in seminal equality rights cases (most recently, Fraser v Canada, 2020 SCC 28; Quebec v. A, [2013] 1 S.C.R. 61); Withler v. Canada, [2011] 1 SCR 396; and R. v. Kapp, [2008] 2 S.C.R. 483,. She has made presentations to the Ontario Court of Appeal and the Constitutional Law Branch of the Ministry of the Attorney General, Ontario; has worked with L.E.A.F.; and has been a member of the Research Ethics Board at Toronto’s Hospital for Sick Children. In 2005, she wrote a commissioned report for the Government of Canada recommending that “gender identity” be added to the Canadian Human Rights Act as a prohibited ground of discrimination (it was added in 2017). She was called to the Bar of Ontario in 2006. Research Interests: Equality and Anti-Discrimination Law; Moral Philosophy; Political Philosophy and Theory; Tort Law and Tort Theory",
    "listed_research_areas":"Equality and Anti-Discrimination Law; Moral Philosophy; Political Philosophy and Theory; Tort Law and Tort Theory"
  },
  {
    "faculty":"u_toronto",
    "name":"Anthony Niblett",
    "title":null,
    "email":"anthony.niblett@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/anthony-niblett",
    "bio":"Associate Professor and Canada Research Chair in Law, Economics, & Innovation Jackman Law BuildingRoom J36678 Queen's ParkToronto, Ontario M5S 2C5 Anthony Niblett is an Associate Professor and Canada Research Chair in Law, Economics, & Innovation at the Faculty of Law. Professor Niblett researches law & economics, innovation, contracts, judicial behaviour, and competition policy. He is also the Academic Advisor at the Future of Law Lab at the Faculty and an Affiliate Researcher with the Vector Institute for AI. You can find some of his research papers here.Professor Niblett holds a Ph.D. in economics from Harvard as well as degrees in law and commerce from the University of Melbourne. He was a Bigelow Fellow at the University of Chicago before moving to Canada.Professor Niblett teaches Contracts, Torts, Competition Policy, Economic Analysis of Law, Law & New Technologies, and Legal Methods.In 2019, Professor Niblett gave a TEDx talk on machine learning and law. In addition to his academic career, Professor Niblett is a co-founder of Blue J, a legal tech startup that helps predict legal outcomes in tax and employment law.",
    "listed_research_areas":null
  },
  {
    "faculty":"u_toronto",
    "name":"Jim Phillips",
    "title":null,
    "email":"j.phillips@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/jim-phillips",
    "bio":"Professor Jackman Law BuildingRoom J43478 Queen's ParkToronto, Ontario M5S 2C5 Jim Phillips (M.A. Edinburgh, Ph.D. (History) and LL.B. Dalhousie) is Professor in the Faculty of Law and and is cross-appointed to the Department of History and the Centre for Criminology and Socio-Legal Studies. He was a law clerk to Madam Justice Wilson of the Supreme Court of Canada prior to joining the University, and was Associate Dean of the Faculty of Law 1994-1997. He teaches property and legal history, and was the winner of the Mewett Award for Excellence in Teaching in 2001. In 1991, 1998, 2001, 2003, 2006, 2015 and 2016 he was elected by the graduating class to speak at their post-convocation reception.His research is principally in legal history, and he has coedited four volumes in the Osgoode Society for Canadian Legal History series of Essays in the History of Canadian Law. His most recent book is A History of Law In Canada: Volume 1, Beginnings to 1866, with Philip Girard and Blake Brown. Volume 2, Law for a New Dominion, 1867-1914, will be published in 2022. He was Director of the Centre of Criminology at the University of Toronto 2003-2005. In 2013 he was awarded the David Mundell Medal by the Ontario Ministry of the Attorney-General for excellence in legal writing. He is also active in debates on the future of public and accessible legal education at the University of Toronto. Research Interests: Legal History; Property Law",
    "listed_research_areas":"Legal History; Property Law"
  },
  {
    "faculty":"u_toronto",
    "name":"Mariana Mota Prado",
    "title":null,
    "email":"mariana.prado@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/mariana-mota-prado",
    "bio":"Professor; William C. Graham Chair in International Law and Development Flavelle House78 Queen's ParkToronto, Ontario M5S 2C5 Mariana Mota Prado obtained her law degree (LLB) from the University of Sao Paulo, and her master's (LLM) and Doctorate (JSD) from Yale Law School. She is currently a Professor at the Faculty of Law, University of Toronto, where she was also the Associate Dean for the Graduate Programs from 2014 to 2019. She has published extensively on law and development, including three co-authored books with Michael J. Trebilcock: Institutional Bypasses: A Strategy to Promote Reforms for Development (Cambridge University Press, 2019), Advanced Introduction to Law and Development (Edward Elgar, 1st ed. 2014; 2nd ed. 2021), and What Makes Poor Countries Poor (Edward Elgar, 2011). A Brazilian national, she has taught courses at the Centre for Transnational Legal Studies in London, Direito Rio - Getulio Vargas Foundation Law School in Brazil, ITAM Law School in Mexico, Los Andes Law School in Colombia, Universidad Torcuato Di Tella in Argentina and University of Puerto Rico School of Law in the United States. Her scholarship focuses on law and development, corruption and comparative law. Research Interests: Administrative Law; Law and Globalization; Law and International Development",
    "listed_research_areas":"Administrative Law; Law and Globalization; Law and International Development"
  },
  {
    "faculty":"u_toronto",
    "name":"Cheryl Regehr",
    "title":null,
    "email":"provost@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/cheryl-regehr",
    "bio":"Vice-President and Provost Simcoe Hall 27 King’s College Circle, Room 225 Toronto, ON  M5S 1A1 Faculty of Social Work biography Cheryl Regehr is the Vice-President and Provost for the University of Toronto. Former Dean of the Factor-Inwentash Faculty of Social Work, she is a Professor in the Faculty of Social Work, and has cross-appointments to the Faculty of Law and the Institute for Medical Sciences at University of Toronto.Professor Regehr’s practice background includes over 20 years of direct service in forensic social work and emergency mental health and in the administration of mental health programs, specializing in civil litigation and criminal court assessments of trauma victims and violent offenders, and organizationally based trauma interventions. She was the director of the Crisis Response Team at Pearson International Airport, served on the mental health advisory for the Department of National Defence and Veteran’s Affairs Canada, and currently is a member of the CIHR Mental Health Advisory Group for COVID-19. In 2004, she was awarded the Amicus Award by the American Academy of Psychiatry and the Law for her contributions to forensic mental health.Professor Regehr’s six books and over 150 scholarly articles focus on forensic mental health; trauma and recovery; and stress, trauma and decision-making in high stress professions. This research was has been recognized by the International Campbell Collaboration for Systematic Reviews and the American Academy of Psychiatry and the Law. Her current SSHRC funded research projects involve testing a new model for improving professional decision-making in situations of risk and uncertainty; and understanding trauma in archivists. A further project explores the impact of video evidence of violent crime on those involved in the justice system. Research Interests: Health Law",
    "listed_research_areas":"Health Law"
  },
  {
    "faculty":"u_toronto",
    "name":"Arthur Ripstein",
    "title":null,
    "email":"arthur.ripstein@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/arthur-ripstein",
    "bio":"Professor of Law and Philosophy, University Professor; Howard Beck, Q.C. Chair Address: Jackman Law Building (Room J322)78 Queen's ParkToronto, Ontario M5S 2C5  Secondary Address: Jackman Humanities Building (Room 506)170 St. George St.Toronto, Ontario M5R 2M8 Arthur Ripstein is Professor of Law and Philosophy and University Professor. He was appointed to the Department of Philosophy in 1987, promoted to Full Professor in 1996, appointed to the Faculty of Law in 1999, and appointed to the rank of University Professor in 2016. He was awarded the Killam prize in humanities in 2021.  He served as Chair of the Department of Philosophy 2011-14 and as Acting Chair 2018-19.  He received a doctorate in philosophy from the University of Pittsburgh, a master’s degree in law from Yale, and an undergraduate degree from the University of Manitoba.Professor Ripstein’s research and teaching interests include torts, legal theory, political philosophy and Kant. In addition to numerous articles in legal theory and political philosophy, he is the author of Kant and the Law of War (Oxford 2021), Rules for Wrongdoers (Oxford 2021),  Private Wrongs (Harvard 2016), Force and Freedom: Kant’s Legal and Political Philosophy (Harvard 2009) and Equality, Responsibility and the Law (Cambridge 1999). He is editor of Ronald Dworkin (Cambridge 2007) and co-editor of Waheed Hussein’s posthumous book,, Living with the Invisible Hand, (Oxford University Press, forthcoming 2023), Law and Morality (Toronto 1996, second edition 2001, third edition 2007), and Practical Rationality and Preference (Cambridge 2001). He was awarded a Killam Fellowship in 2016, and the Killam Prize in 2021, both by the Canada Council for the Arts. He served for 15 years as Associate Editor of Philosophy and Public Affairs, for which he is now Advisory Editor. He is a former Associate Editor of Ethics and the Canadian Journal of Philosophy, serves on the editorial board of Legal Theory, and is Advisory Editor of the Canadian Journal of Law and Jurisprudence. His popular work has appeared on Ideas on CBC Radio One. Video:Kissel Lecture at Harvard University, “Perpetual War or Perpetual Peace?”Lecture at University of Girona “A Wrong Personal to You.”Audio: Society for Applied Philosophy Annual Lecture, King’s College London, “Reclaiming Proportionality.” An interview with Ripstein about the lecture.Listen to Ripstein’s Tanner Lectures on Human Values  “Rules for Wrongdoers,” and “Combatants and Civilians” delivered at Berkeley in April 2019, together with comments from Christopher Kutz, Oona Hathaway, and Jeff McMahan. Read the Transcripts 1 and 2.Listen to an interview with Ripstein about the Killam prize on CBC Radio Ideas (interview starts at 24:00)Listen to Ripstein Kant and Private Law on the Private Law PodcastListen to Ripstein on Kant and the Law of War on the Conversations on Globalization and Law PodcastListen to Ripstein on Kant and the Law of War on the Political Theory Review PodcastInterviews:Read an interview with Ripstein in Noesis (Interview begins on p. 48)Read an interview with Ripstein about graduate supervision. Research Interests: Legal Theory; Tort Law and Tort Theory",
    "listed_research_areas":"Legal Theory; Tort Law and Tort Theory"
  },
  {
    "faculty":"u_toronto",
    "name":"Kerry Rittich",
    "title":null,
    "email":"kerry.rittich@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/kerry-rittich",
    "bio":"Professor Jackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5 Kerry Rittich is Professor of Law, Women and Gender Studies, and Public Policy and Governance at the University of Toronto. She has served as Associate Dean, JD Program.  She writes in the areas of labour law, international institutions and global governance, law and development, and gender and critical theory. Publications include Recharacterizing Restructuring: Law, Distribution and Gender in Market Reform (Kluwer Law International, 2002); (with Joanne Conaghan), Labour Law, Work and Family: Critical and Comparative Perspectives, (OUP, 2005); “The Future of Law and Development: Second Generation Reforms and the Incorporation of the Social” in David M. Trubek and Alvaro Santos eds., The New Law and Economic Development: A Critical Appraisal (CUP, 2006); “Black Sites: Locating the Family and Family Law in Development” (American Journal of Comparative Law, 2010); “The Right to Work and Labour Market Flexibility: Labour Market Governance Norms in the International Order”, V. Mantouvalou, ed., The Right to Work: Legal and Philosophical Perspectives (Hart, 2015) and (with Guy Mundlak) “The challenge to comparative labor law in a globalized era”, M. Finkin and G. Mundlak, eds., Comparative Labor Law (Elgar, 2015); and “Theorizing International Law and Development”, F. Hoffman and A. Orford, eds., Oxford Handbook of the Theory of International Law (OUP, 2016).  She has been the Mackenzie King Visiting Professor of Canadian Studies at Harvard University, Visiting Professor at the Watson Institute for International Studies at Brown University, and Professor and Academic Director of the Center for Transnational Legal Studies, London. Research Interests: Critical Legal Theory; Feminist Analysis of Law; Labour Law; Law and Globalization; Law and International Development",
    "listed_research_areas":"Critical Legal Theory; Feminist Analysis of Law; Labour Law; Law and Globalization; Law and International Development"
  },
  {
    "faculty":"u_toronto",
    "name":"Kent Roach",
    "title":null,
    "email":"kent.roach@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/kent-roach",
    "bio":"Professor Jackman Law BuildingRoom J446 78 Queen's ParkToronto, Ontario M5S 2C5 Kent Roach is Professor of Law at the University of Toronto Faculty of Law. He is a former law clerk to Justice Bertha Wilson of the Supreme Court of Canada. Professor Roach has been editor-in-chief of the Criminal Law Quarterly since 1998. In 2002, he was elected a Fellow of the Royal Society of Canada. In 2013, he was one of four academics awarded a Trudeau Fellowship in recognition of his research and social contributions. In 2015, he was appointed a Member of the Order of Canada. In 2016, named (with Craig Forcese) one of the top 25 influential lawyers in Canada (change-maker category) by Canadian Lawyer.  He was awarded the Molson Prize for the social sciences and humanities in 2017.He is the author of Constitutional Remedies in Canada (winner of the Owen best law book Prize); Due Process and Victims’ Rights (short listed for the Donner Prize for public policy), The Supreme Court on Trial (same); (with Robert J. Sharpe) Brian Dickson: A Judge’s Journey (winner of the Dafoe Prize) and The 9\/11 Effect: Comparative Counter-Terrorism (winner of the Mundell Medal); (with Craig Forcese) False Security: The Radicalization of Canadian Anti-Terrorism (winner of the Canadian Law and Society Association best book prize);  Canadian Justice, Indigenous Injustice: The Gerald Stanley\/Colten Boushie Case (short listed for the Shaughnessy Cohen prize for political writing); Remedies for Human Rights Violations: A Two-Track Approach to Supra-national and National Law (runner up for Canadian Council on International law book prize for 2020-21) and Canadian Policing: Why and How it Must Change (finalist for the 2022 Balsillie Prize in Public Policy.) He is also the author of the Criminal Law and Charter volumes in Irwin Law’s essentials of Canadian law series. His next book Wrongfully Convicted: Guilty Pleas, Imagined Crimes and What Canada Must Do To Safeguard Justice will be published by Simon and Schuster in 2023.  He is the co-editor of 13 collections of essays including Comparative Counter-Terrorism published by Cambridge University Press in 2015 and 3 casebooks  He has also written over 275 articles and chapters published in Australia, China, Hong Kong, India, Israel, Italy, Japan, Singapore, South Africa, the United Kingdom and the United States, as well as in Canada.Professor Roach has served as research director for the Goudge Inquiry into Pediatric Forensic Patholology,  for the Commission of Inquiry into the Investigation of the Bombing of Air India Flight 182, for the Independent Civilian Review of Toronto Police Missing Persons Investigations and for the public consultations resulting in A Miscarriage of Justice Commission report. He served as volume lead for the Truth and Reconciliation Commission's Report on the Legacy of Residential Schools  He was a member of the research advisory committees for the inquiry into the rendition of Maher Arar, the Ipperwash Inquiry into the killing of Dudley George and the Commission into the 2022 Public Order Emergency.  He has been a member of Canadian Council of Academies expert panels on policing and subsequently on Indigenous policing. He is also co-founder of the Canadian Registry of Wrongful Convictions at https:\/\/www.wrongfulconvictions.ca\/Professor Roach has won awards for his pro bono work and contributions to civil liberties. He has represented Aboriginal and civil liberties groups in many interventions before the courts, including Gladue, Wells, Ipeelee and Anderson on sentencing Indigenous  offenders, Latimer on mandatory minimum sentences, Stillman, Dunedin Construction,  Ward, Conseil Francophone and G v. Ontario  on Charter remedies, Golden on strip searches, Khawaja on the definition of terrorism, Williams and Chouhan on jury selection and Corbiere and Sauve on voting rights. Research Interests: Charter of Rights; Comparative Law; Criminal Law ; National Security Law and Anti-Terrorism Law",
    "listed_research_areas":"Charter of Rights; Comparative Law; Criminal Law ; National Security Law and Anti-Terrorism Law"
  },
  {
    "faculty":"u_toronto",
    "name":"Douglas Sanderson",
    "title":null,
    "email":"d.sanderson@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/douglas-sanderson",
    "bio":"Associate Professor,                                                      \r The Prichard Wilson Chair in Law & Public Policy,                         \r Decanal Advisor on Indigenous Issues. Jackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5 Douglas Sanderson (Amo Binashii) was managing editor of the inaugural edition of the Indigenous Law Journal in 2002 while a student in the JD program.  He went on to get his LL.M from Columbia University as a Fulbright Scholar. Prof. Sanderson is a member of the Opaskwayak Cree Nation, and he has been deeply engaged in Aboriginal issues from a policy perspective. From 2004-2007 he was a Senior Advisor to the Government of Ontario, first in the Office of the Minister Responsible for Aboriginal Affairs, and later, to the Attorney General.Prof. Sanderson's research areas include Aboriginal and Indigenous legal theory, as well as private law (primarily property law) and public and private legal theory. His work uses the lens of material culture and property theory to examine the nature of historic injustice to Indigenous peoples and possible avenues for redress. Moving beyond the framework of common law property rights and constitutional land\/treaty rights, his scholarship focuses on Aboriginal institutions, post-colonial reconciliation and rebuilding community.  Professor Sanderson's current research interests include the Peace and Friendship Treaties (1600-1763) and the Fur Trade in Canada.Valley of the Birdtail, a book of narrative non-fiction, and co-authored with former student, will be published by Harper Collins in the fall of 2022. Research Interests: Aboriginal Law; Indigenous Legal Traditions; Legal History; Legal Theory; Political Philosophy and Theory; Property Law",
    "listed_research_areas":"Aboriginal Law; Indigenous Legal Traditions; Legal History; Legal Theory; Political Philosophy and Theory; Property Law"
  },
  {
    "faculty":"u_toronto",
    "name":"David Schneiderman",
    "title":null,
    "email":"david.schneiderman@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/david-schneiderman",
    "bio":"Professor Jackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5 David Schneiderman, B.A (McGill) 1980, LL.B. (Windsor) 1983, LL.M. (Queen's) 1993, is Professor of Law and Political Science. He was called to the Bar of British Columbia in 1984 where he practised law and then served as Research Director of the Canadian Civil Liberties Association in Toronto from 1986-89. He was Executive Director of the Centre for Constitutional Studies, an interdisciplinary research institute, at the University of Alberta from 1989-99. Professor Schneiderman has authored numerous articles on Canadian federalism, the Charter of Rights, Canadian constitutional history, and constitutionalism and globalization. He has authored Constitutionalizing Economic Globalization: Investment Rules and Democracy's Promise (Cambridge University Press, 2008) and co-authored The Last Word: Media Coverage of the Supreme Court of Canada with Florian Sauvageau and David Taras (UBC Press, 2006).  He also has edited several books, including The Quebec Decision (1999); Charting the Consequences: The Impact of the Charter of Rights on Canadian Law and Politics (1997) with Kate Sutherland; Police Powers in Canada: The Police Power in History, Law, and Politics (1993) with R.C. MacLeod; Social Justice and the Constitution: Perspectives on a Social Union for Canada (1992) with Joel Bakan; and Freedom of Expression and the Charter (1991). He is founding editor of the quarterly Constitutional Forum Constitutionnel and founding editor-in-chief of the journal Review of Constitutional Studies. Research Interests: Canadian Constitutional Law; International Law",
    "listed_research_areas":"Canadian Constitutional Law; International Law"
  },
  {
    "faculty":"u_toronto",
    "name":"Ayelet Shachar",
    "title":null,
    "email":"ayelet.shachar@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/ayelet-shachar",
    "bio":"R.F. Harney Chair in Ethnic, Immigration and Pluralism Studies\r Professor of Law, Political Science & Global Affairs, and former Canada Research Chair in Citizenship and Multiculturalism Jackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5 Ayelet Shachar (FRSC) is Professor of Law, Political Science, and Global Affairs, and the holder of the R.F. Harney Chair in Ethnic, Immigration and Pluralism Studies at the University of Toronto, where she directs the Harney Program at the Munk School of Global Affairs & Public Policy. Previously, she was a Scientific Member of the Max Planck Society—one of the foremost research organizations in the world—and Director at the Max Planck Institute for the Study of Religious and Ethnic Diversity. She was awarded the Gottfried Wilhelm Leibniz Prize in 2019. Before her recruitment to the Max Planck Society, she held the Canada Research Chair in Citizenship and Multiculturalism. At Goethe University Frankfurt she is affiliated with both the Faculty of Law and the Normative Orders Research Centre, where she is the leader of the \"Transformations of Citizenship\" research group. Shachar has published extensively on the topics of citizenship theory, immigration law, cultural diversity and women's rights, new border regimes, highly skilled migration and global inequality, and the marketization of citizenship. Her research is motivated by the need to develop new legal principles to address some of the most pressing issues of our time: how to live together in diverse societies, how to grant rights to those who lack formal access to membership, and how to tame the ever-expanding reach of borders and migration control in a world of persistent inequality.Shachar is the author of Multicultural Jurisdictions: Cultural Differences and Women's Rights (Cambridge University Press, 2001 & 2009), for which she won the American Political Science Association 2002 Foundations of Political Theory Section Best First Book Award. This work has inspired a new generation of thinking about how to best mitigate the tensions between gender equality and religious diversity. It has also proved influential in the real world, intervening in actual public policy and legislative debates. It has been cited by, among others, England's Archbishop of Canterbury (who described Shachar's work as \"highly original and significant\"), Ontario's Ministry of the Attorney General, and the Supreme Court of Canada. Over the last twenty years, Multicultural Jurisdictions has become a key reference point for feminist approaches to the study of law and religion.Shachar's work combines \"big ideas\" from law and political theory with innovative problem-solving and institutional design. The Birthright Lottery: Citizenship and Global Inequality (Harvard University Press, 2009) was named 2010 International Ethics Notable Book in recognition of its \"superior scholarship and contribution to the field of international ethics.\" It has created a groundswell of interest among policymakers and academics alike. Located at the intersection of law, economics, and political philosophy, The Birthright Lottery crafts new legal concepts and innovative institutional designs to promote global justice, with the aim of ameliorating the most glaring opportunity inequalities that attach to this system of allocation in today's world. This work has been the topic of special-issue symposiums, international workshops and roundtables, and the subject of essays that have appeared in professional and interdisciplinary publications, including the American Journal of Comparative Law, Ethics & International Affairs, Harvard Law Review, Issues in Legal Scholarship, La Revue Nouvelle, Political Theory, Rorotoko, Nexus, Edge, Tikkun, and the Literary Review of Canada.  Shachar is also the lead editor of the field-defining The Oxford Handbook of Citizenship (Oxford University Press, 2017 & 2020). This work has already emerged as a major reference work in the field for those engaged with citizenship from a philosophical, political, legal and cultural perspective. It has been described by Joseph Weiler as: “The definitive source on a critical concept in political and social life. Innovative in its conception and authoritative in its excitation.” Pratap Mehta observes that “[n]o other single volume achieves the theoretical acuity, historical depth, legal grounding, and sociological analysis of citizenship that this book manages to achieve. It is clear, wide ranging, and admirably un-parochial in the range of its references.”Shachar newest book, The Shifting Border: Legal Cartographies of Migration and Mobility (Critical Powers Series, Manchester University Press, 2020; shortlisted for the 2022 C.B. Macpherson Prize), critically examines the role of territory and new measures of managed migration control in selectively restricting - or, conversely, accelerating - mobility and access to the world’s prosperous countries, as governments seek to regain control over a crucial realm of their allegedly waning sovereign authority. Here, as in her previous writings, Shachar not only reveals the deep currents that are reshaping the terrain of law and mobility, but also seeks to develop innovative legal responses to break the current deadlock as she seeks to refute the claim that applicable solutions are beyond reach or impossible to imagine. This work appears under the auspices of the Critical Powers Series, which is “dedicated to constructing dialogues around innovative and original work in social and political theory”.The Shifting Border has been described by Hiroshi Motomura as “a remarkable book. Essential for understanding government responses to people on the move, Shachar’s vivid description, analytical precision, and reasoned persuasion combine to challenge conventional wisdom about ‘borders’ and how they work. The result: exceptional insights into how migration control can be more just. The Shifting Border offers an indispensable roadmap to immigration and refugee debates all around the world\". A recent LSE book review opines: \"In her impressive book, The Shifting Border, Ayelet Shachar refuses to adhere to what she views as false dichotomies between traditional approaches to a concept (culture, citizenship, borders) and premature diagnoses of the concept’s demise. The force of her argument is consistently oriented towards rethinking the question, offering a new framework to understanding the world. … Shachar’s innovative framework nicely exemplifies the shift from idealized ethical debates to institutional and political analysis.\" \"Reading this essay by Shachar...is like getting the dream dinner invitation to hear cutting-edge thought on borders\" (CHOICE magazine).  Shachar is a global citizen at heart and the recipient of research excellence awards in four different countries (Canada, Israel, Germany, and the United States). She has presented her work across the world and held visiting professorships in leading universities, including the Leah Kaplan Visiting Professor in Human Rights at Stanford Law School and the Jeremiah Smith Jr. Visiting Professor of Law at Harvard Law School. She was also a Member of the Institute for Advanced Study, Princeton, Fulbright Fellow, Distinguished Visiting Scholar at Princeton’s Law and Public Affairs Program (LAPA), Emile Noël Senior Fellow at NYU School of Law, Visiting Scholar at Harvard's Edmond J. Safra Center for Ethics, and the W. M. Keck Fellow in Legal Ethics and Professional Culture at Yale Law School. In recognition of her excellence in research and teaching as a faculty member at Toronto, she has received the University's Provostial Merit Increase Award for five consecutive years. Her work has appeared in leading law reviews, social science, and political philosophy journals, including the Yale Law Journal, Journal of Political Philosophy, Ethics & International Affairs, NYU Law Review, University of Chicago Law Review, Yale Journal of Law & the Humanities, Philosophy and Social Criticism, Jurisprudence, Political Theory, Perspectives on Politics, and Theoretical Inquiries in Law. Beyond contributing to key scholarly debates, she has provided pro-bono consultation to judges, non-governmental organizations, the European Parliamentary Research Services, and the World Bank. She is a member of the Board of Trustees of the Association of Members of the Institute for Advanced Study, Princeton; the Advisory Board of the Boundaries, Membership & Belonging program of the Canadian Institute for Advanced Research (CIFAR); and the Advisory Board of the Max Planck-Cambridge Centre for Ethics, Economics, and Social Change at the University of Cambridge. Shachar earned her LL.B in law and B.A. in political science, summa cum laude, from Tel Aviv University; LL.M. and J.S.D, both from Yale Law School. Before arriving at Yale, she was law clerk to Chief Justice Aharon Barak of the Supreme Court of Israel. She sits on the editorial boards of major peer-reviewed journals and book series in her field, and has delivered countless talks on her research in a range of academic, policy, and popular venues across the globe. In 2014, she was elected Fellow of the Royal Society of Canada. In 2015, she became Director of the Max Planck Institute for the Study of Religious and Ethnic Diversity. In 2017, she was elected member of the Göttingen Academy of Sciences and Humanities (past famous members include the Brothers Grimm and Gauss the mathematician). In 2019, she was awarded the Gottfried Wilhelm Leibniz Prize, Germany's most prestigious research award, for her groundbreaking work on citizenship and the legal frameworks of accommodation in multicultural societies. In 2021, she was appointed the R.F. Harney Chair in Ethnic, Immigration, and Pluralism Studies. Video: Shachar's academic profile, prepared on the occasion of her selection to the Leibniz Prize.Video: Author interview and lecture, \"The Shifting Border in the Time of Covid-19\"  Podcast: \"Rights at the Border\" | Entitled, University of Chicago Law School Research Interests: Equality and Anti-Discrimination Law; Immigration and Citizenship Law; Law and Globalization; Law and Religion; Legal Ethics; Legal Theory; Political Philosophy and Theory",
    "listed_research_areas":"Equality and Anti-Discrimination Law; Immigration and Citizenship Law; Law and Globalization; Law and Religion; Legal Ethics; Legal Theory; Political Philosophy and Theory"
  },
  {
    "faculty":"u_toronto",
    "name":"Martha Shaffer",
    "title":null,
    "email":"m.shaffer@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/martha-shaffer",
    "bio":"Professor Jackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5 Professor Shaffer joined the Faculty of Law in 1990 after serving as a law clerk to Chief Justice Brian Dickson at the Supreme Court of Canada. She holds law degrees from Harvard and U of T.Professor Shaffer teaches Criminal Law, Evidence Law and Legal Methods, and has taught Family Law as well as courses on cultural diversity and gender issues. She writes in the areas of family and criminal law, with a focus on gender, violence against women, and on the use of social science evidence to inform legal reasoning.",
    "listed_research_areas":null
  },
  {
    "faculty":"u_toronto",
    "name":"Richard Stacey",
    "title":null,
    "email":"richard.stacey@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/richard-stacey",
    "bio":"Associate Professor Jackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5 Richard Stacey is an Associate Professor of law at the University of Toronto Faculty of Law. He works in public law, with a research focus is on how governments and their administrative branches uphold and fulfil, or can be encouraged to uphold and fulfil, their constitutional commitments. Richard's undergraduate and law degrees are from the University of the Witwatersrand in South Africa, and his PhD is from New York University. He was law clerk to Justice Kate O’Regan and Justice Bess Nkabinde at the Constitutional Court of South Africa, and has taught at the City University of New York Law School, the University of Witwatersrand and the University of Cape Town. He recently co-edited a collection of essays entitled The Limits and Legitimacy of Referendums (with Richard Albert) published by Oxford University Press, and is currently engaged in a project exploring the connections between popular sovereignty, the rule of law, and referendums. All publications Research Interests: Aboriginal Law; Administrative Law; Canadian Constitutional Law; Charter of Rights; Comparative Law; Legal Theory",
    "listed_research_areas":"Aboriginal Law; Administrative Law; Canadian Constitutional Law; Charter of Rights; Comparative Law; Legal Theory"
  },
  {
    "faculty":"u_toronto",
    "name":"Simon Stern",
    "title":null,
    "email":"simon.stern@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/simon-stern",
    "bio":"Professor of Law and English; Director, Centre for Innovation Law & Policy; Chair in Innovation Law Jackman Law Building               Room 47278 Queen's ParkToronto, Ontario M5S 2C5 List of all publications, or see Prof. Stern's pages on SSRN, academia.edu, google scholar, or ORCID.B.A. (Yale), Ph.D., English (UC Berkeley), J.D. (Yale), member of the Washington, D.C. Bar. While in law school he was Editor-in-Chief of the Yale Journal of Law & the Humanities. After law school he clerked for Ronald M. Gould on the U.S. Court of Appeals for the Ninth Circuit, practiced litigation at Shea & Gardner (now Goodwin Procter) in Washington, D.C., and then served as a Climenko Fellow and Lecturer on Law at Harvard Law School.Prof. Stern teaches and researches in the areas of law and literature, legal history, law and sexuality, and criminal law.  His research focuses on the evolution of legal doctrines and methods in relation to literary and intellectual history. Current research topics include the development of the \"reasonable man\" standard (and its precursors and analogues) since the eighteenth century, and the changing conception of legal fictions between the early modern period and the present. His research has been funded by the Social Sciences and Humanities Research Council, the Foundation for Legal Research, and the American Society for Legal History.He is co-editor (with Robert Spoo) of the series Law and Literature, published by Oxford University Press. With colleagues at other universities in North America, Europe, and the UK, he convenes the Works in Progress series in Law and Literature, which provides a venue for new work in the field. He is also co-editor of Critical Analysis of Law, and a co-editor of the New Rambler Review.In 2012 Prof. Stern was the recipient of the SLS Partnership Award, bestowed by the U of T Students' Law Society in recognition of faculty members who have shown a commitment to student-friendly initiatives and student advocacy.Ph.D. & S.J.D. advising      Prof. Stern supervises dissertation projects related to legal history, law and literature, eighteenth-century literature, criminal law, and law & sexuality. Recent and current projects include:  Michael Donnelly, For All Peoples and All Nations: Anglophone Literature and the Imaginative Work of International Law (1884-2017); Daniel Kennedy, Legal and Literary Fictions at the Early Modern Inns of Court; Michael Reid, Gay Lives: Literature, Secrecy, and the Problem of Evidence in Eighteenth-Century England; Daniel Del Gobbo, Feminism Goes to College: The Law and Politics of Campus Sexual Violence. Research Interests: Criminal Law ; Intellectual Property Law; Law and Literature; Legal History; Legal Theory; Privacy Law; Sexuality and the Law",
    "listed_research_areas":"Criminal Law ; Intellectual Property Law; Law and Literature; Legal History; Legal Theory; Privacy Law; Sexuality and the Law"
  },
  {
    "faculty":"u_toronto",
    "name":"Hamish Stewart",
    "title":null,
    "email":"hamish.stewart@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/hamish-stewart",
    "bio":"Professor 78 Queen's ParkToronto, Ontario M5S 2C5 Hamish Stewart joined the Faculty of Law in 1993 and is now a Professor of Law at the University of Toronto.  Before attending law school, he studied economics (B.A., University of Toronto, 1983; Ph.D., Harvard University, 1989) and taught for a year in the economics department at Williams College.   He received an LL.B. degree from the University of Toronto in 1992, clerked at the Ontario Court of Appeal in 1992-93, and was called to the Ontario Bar in 1998.Professor Stewart teaches criminal law and the law of evidence, and has published numerous papers in these areas as well as papers on legal theory ,the law of contract, and economic methodology.  He is the general editor of Evidence: A Canadian Casebook, 4th ed. (Toronto: Emond Montgomery, 2016) and the associate editor of the Canadian Criminal Cases.  His most recent book is Fundamental Justice, 2d ed. (Toronto: IrwinLaw, 2019), a treatise on s. 7 of the Canadian Charter of Rights and Freedoms.See also the Law & Philosophy focus area. Research Interests: Contracts; Criminal Law ; Criminal Procedure and Evidence; Economic Analysis of Law; Legal Theory",
    "listed_research_areas":"Contracts; Criminal Law ; Criminal Procedure and Evidence; Economic Analysis of Law; Legal Theory"
  },
  {
    "faculty":"u_toronto",
    "name":"Anna Su",
    "title":null,
    "email":"anna.su@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/anna-su",
    "bio":"Associate Professor Jackman Law BuildingRoom J47078 Queen's ParkToronto, Ontario M5S 2C5 Anna Su's primary areas of research include the law and history of international human rights law, comparative constitutional law, technology and international law, and law and religion. She is currently a Faculty Fellow at the Schwartz Reisman Institute for Technology and Society. Anna holds an SJD from Harvard Law School where her dissertation was awarded the John Laylin Prize for best paper in international law. She received her JD and AB degrees from the Ateneo de Manila University in the Philippines. Prior to coming to Toronto, she held a postdoctoral fellowship at the Baldy Center for Law and Social Policy based in SUNY Buffalo Law School, and a graduate fellowship in ethics with the Edmond J. Safra Center for Ethics at Harvard University. She worked as a law clerk for the Philippine Supreme Court and was a consultant to the Philippine government negotiating panel with the Moro Islamic Liberation Front.She holds a cross-appointment at the Department of History (by courtesy). Research Interests: Canadian Constitutional Law; Comparative Law; International Law; Law and Religion; Legal History; Political Philosophy and Theory",
    "listed_research_areas":"Canadian Constitutional Law; Comparative Law; International Law; Law and Religion; Legal History; Political Philosophy and Theory"
  },
  {
    "faculty":"u_toronto",
    "name":"Cheryl Suzack",
    "title":null,
    "email":"cheryl.suzack@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/cheryl-suzack",
    "bio":"Associate Professor; Graduate Faculty, Undergraduate Instructor, Department of English Jackman Humanities Building170 St. George StreetToronto, ON M5R 2M8 English Department profile page Professor Cheryl Suzack (Batchewana First Nations) is an Associate Professor at the Department of English. She is cross-appointed to the Aboriginal Studies Program and teaches courses for English and Aboriginal Studies on comparative Indigenous literatures, comparative Indigenous studies, and Indigenous decolonization with a focus on gender issues and Indigenous women. She also holds a non-budgetary cross-appointment at the Faculty of Law.Prof. Suzack obtained her BA (Honours) in English and Political Science and MA English at the University of Guelph in 1993 and 1995, respectively. She received a BEd degree from Nipping University in 1996 and her PhD in English at the University of Alberta in 2004.Professor Suzack's research focuses on Indigenous law and literature with a particular emphasis on writing by Indigenous women. In her book, Indigenous Women's Writing and the Cultural Study of Law, she explores how Indigenous women's writing from Canada and the United States addresses case law concerning tribal membership, intergenerational residential school experiences, and land claims. Her current project analyzes Justice Thurgood Marshall's papers in the context of Indian civil rights claims from the 1960s. She is a co-editor (with Greig Henderson and Simon Stern) of “The Critical Work of Law and Literature,” University of Toronto Quarterly (Fall 2013) and a co-editor and contributor (with Shari Huhndorf, Jeanne Perreault, and Jean Barman) to the award-winning collection, Indigenous Women and Feminism: Politics, Activism, Culture (UBC 2010). Professor Suzack has completed a book length study, Indigenous Women’s Writing and the Cultural Study of Law, and is starting a new project on Justice Thurgood Marshall’s Indian law cases. Past projects include editing special issues for Topia: Canadian Journal of Cultural Studies, Ariel: A Review of International English Literature, and English Studies in Canada. Research Interests: Aboriginal Law; Law and Literature",
    "listed_research_areas":"Aboriginal Law; Law and Literature"
  },
  {
    "faculty":"u_toronto",
    "name":"Malcolm Thorburn",
    "title":null,
    "email":"malcolm.thorburn@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/malcolm-thorburn",
    "bio":"Professor; \r Chair, Legal, Ethical and Cultural Implications of Technological Innovation; \r Associate Dean, Graduate Programs Jackman Law Building78 Queen's ParkRoom J326Toronto, Ontario M5S 2C5 Malcolm Thorburn, B.A. (Hons.) (Toronto); M.A. (Pennsylvania); J.D. (Toronto); LL.M. (Columbia); J.S.D. (Columbia) is a Professor at the University of Toronto Faculty of Law. Prior to joining the Faculty of Law in 2013, he was Canada Research Chair in Crime, Security and Constitutionalism at Queen’s University. In 2000-2001, he served as Law Clerk at the Supreme Court of Canada for Mr. Justice Louis LeBel. He has held visiting fellowships at Sciences Po, Paris, France (2019), the Australian National University (2008), Ludwig Maximilians University in Munich, Germany (2011), and the French National Centre for Criminology (CESDIP) in Paris, France (2011). In the 2011-2012 academic year, he was the Robert S. Campbell visiting fellow at Magdalen College, University of Oxford, UK.His writing focuses on theoretical issues in criminal justice and public law including criminal law and procedure, sentencing, policing, constitutional rights and proportionality reasoning. He is the editor of two books: The Philosophical Foundations of Constitutional Law (with David Dyzenhaus) and The Dignity of Law (with Dwight Newman). His work has appeared in such publications as the Yale Law Journal, Ratio Juris, the Boston University Law Review, the University of Toronto Law Journal, Criminal Law and Philosophy and several books at Oxford University Press and Hart Publishing. He is co-convenor of the Legal Theory Workshop, an associate editor of the New Criminal Law Review and a member of the editorial boards of Law and Philosophy and Criminal Law and Philosophy.See also the Law & Philosophy focus area. Research Interests: Canadian Constitutional Law; Charter of Rights; Comparative Law; Criminal Law ; Criminal Procedure and Evidence; Legal Theory",
    "listed_research_areas":"Canadian Constitutional Law; Charter of Rights; Comparative Law; Criminal Law ; Criminal Procedure and Evidence; Legal Theory"
  },
  {
    "faculty":"u_toronto",
    "name":"Catherine Valcke",
    "title":null,
    "email":"c.valcke@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/catherine-valcke",
    "bio":"Professor Jackman Law BuildingRoom J42278 Queen's ParkToronto, Ontario M5S 2C5 Catherine Valcke (LL.B. Civil Law, University of Sherbrooke; LL.B. Common Law, University of Toronto; LL.M. University of Chicago; S.J.D. Columbia) is Professor at University of Toronto Faculty of Law, where she served as Associate Dean from 1997 to 2000.  Professor Valcke has lectured on contract law, the civil law of obligations, comparative law, and comparative legal theory in North America, Europe, and North Africa, and published in those fields nationally and internationally, in such journals as Nomos, the American Journal of Comparative Law, Harvard Journal of Law and Public Policy, Yale Journal of International Law, European Review of Private Law, and Canadian Journal of Law and Jurisprudence.  An elected member of the International Academy of Comparative Law, Professor Valcke as acted on several occasions as National Reporter for Canada to the Congress of the Academy.  Her recent book Comparing Law: Comparative Law as Reconstruction of Collective Commitments (Cambridge University Press, 2018) draws on legal theory to develop an interpretive conception of, and analytic framework for, comparative legal studies.  That analytic framework finds application in her current SSHRC-funded project -- French and English Private Law Paradigms -- which seeks to provide a deep comparative understanding of the French and English legal rules governing contract, tort, and property. A new author of the forthcoming 2021 edition of Pineau et al, Théorie des Obligations (Thémis, Montréal), a prominent treatise on the law of obligations of Quebec, Professor Valcke also is a co-editor of the forthcoming 2023 edition of the prestigious Elgar Encyclopedia of Comparative Law. Research Interests: Civil Law; Comparative Law; Contracts; Legal Theory",
    "listed_research_areas":"Civil Law; Comparative Law; Contracts; Legal Theory"
  },
  {
    "faculty":"u_toronto",
    "name":"Mariana Valverde",
    "title":null,
    "email":"m.valverde@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/mariana-valverde",
    "bio":"Professor of Criminology Complete profile page Mariana Valverde is a professor at the Centre for Criminology and Sociolegal Studies at the University of Toronto, and a Fellow of the Royal Society of Canada since 2006.  She served as Director of the Centre from 2007 to 2013 and was one of the founders of the Sexual Diversity Studies program.  She holds a courtesy cross-appointment to the Department of Geography and Planning as well as the Faculty of Law.  Prior to joining the University of Toronto in 1993, she was an associate professor in the Department of Sociology at York University and previously taught in Women’s Studies at Trent University.In 2016, Professor Valverde received the Law and Society Association’s Harry J. Kalven Jr. Award in recognition of “empirical scholarship that has contributed most effectively to the advancement of research in law and society.”  She has twice won the Association’s Herbert Jacobs Book Prize for a major contribution to socio-legal scholarship: in 2000 for Diseases of the Will: Alcohol and the Dilemmas of Freedom (Cambridge University Press, 1998) and again in 2013 for Everyday Law on the Streets: City Governance in an Age of Diversity (University of Chicago Press, 2012).  Professor Valverde is also the author of Chronotopes of Law: Jurisdiction, Scale and Governance; The Force of Law; The Age of Light, Soap, and Water: Moral Reform in English Canada 1880s-1920s (now in its second edition); Law and Order: Signs, Meanings, Myths; Law’s Dream of a Common Knowledge; and Sex, Power and Pleasure.  Her most recent book Michel Foucault (Routledge, 2017) is the first title in a series on key thinkers in criminology, and gives an accessible account of Foucault’s work and how it can be used for purposes of legal studies and criminological research. Her co-edited collections include Police and the Liberal State (Stanford University Press, 2008) and The New Police Science: The Police Power in Domestic and International Governance (Stanford University Press, 2006) (both with Markus Dubber), and Wife Assault and the Canadian Criminal Justice System: Issues and Policies (Centre of Criminology, 1995) (with Linda Macleod and Kirsten Johnson).Professor Valverde’s main research interests are currently urban law and governance (historically and in the present) and, at the theoretical level, Foucault, sexuality studies, theories of spatiotemporality, and actor-network theory.  In addition, her SSHRC-funded research project, “Planning by Contract?” (2013-2016), illuminates how legal tools from private law, such as contracts, as well as the governance structures developed for and by public-private partnerships, are changing local and municipal governance.  This project is being conducted with urban political scientist Professor Aaron Moore, planning scholar Professor Sue Bunce and transnational financing expert Professor Fleur Johns. Research areasCriminal Law Sexuality and the Law Research Interests: Criminal Law ; Sexuality and the Law",
    "listed_research_areas":"Criminal Law ; Sexuality and the Law"
  },
  {
    "faculty":"u_toronto",
    "name":"Stephen Waddams",
    "title":null,
    "email":"s.waddams@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/stephen-waddams",
    "bio":"Professor Jackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5 Stephen Waddams is a University Professor at the Faculty of Law, where he has been teaching since 1968. He served as graduate co-ordinator from 1976 to 1987, and held the Goodman\/Schipper Chair from 2000 to 2020.  He holds B.A. and LL.B. degrees from Toronto, M.A. and Ph.D degrees from Cambridge, and LL.M and S.J.D. degrees from Michigan. He has been visiting senior research fellow, Jesus College, Oxford; visiting senior lecturer, University of Otago, Dunedin, New Zealand, and visiting fellow, All Souls College, Oxford. He is a fellow of Trinity College at the University of Toronto and was elected a fellow of the Royal Society of Canada in 1988.  He is a senior fellow of Massey College.  In 1989, he was awarded the Canadian Association of Law Teachers\/Law Reform Commission of Canada Award for Outstanding Contribution to Legal Research and Law Reform; in 1994, the first Albert Abel Professorship; in 1996 the David W. Mundell medal for contributions to Law and Letters; and in 1999, a Killam Research Fellowship. He was appointed University Professor in 2005. He was selected as a Herbert Smith Freehills Visitor to Cambridge University in 2017.Professor Waddams specializes in contract law and is the author of nine books: Products Liability, The Law of Contracts, The Law of Damages, Introduction to the Study of Law, Law, Politics and the Church of England, Sexual Slander in Nineteenth-Century England, Dimensions of Private Law: Categories and Concepts in Anglo-American Legal Reasoning, Principle and Policy in Contract Law: Competing or Complementary Perspectives?, and  Sanctity of Contracts in a Secular Age: Equity, Fairness and Enrichment as well as numerous law review articles and notes. He was co-winner of the Owen Prize in 1987 for The Law of Damages. He is also a past editor of University of Toronto Law Journal. In 1990, he received an award from the university student organizations for excellence in teaching. He has received several grants from the Social Sciences and Humanities Research Council Canada (SSHRC), most recently an Insight Grant (2020-2023) for the study of “Continuity and change in private law: the equitable perspective”. Research Interests: Contracts; Legal History",
    "listed_research_areas":"Contracts; Legal History"
  },
  {
    "faculty":"u_toronto",
    "name":"Arnold Weinrib",
    "title":null,
    "email":"arnold.weinrib@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/arnold-weinrib",
    "bio":"Professor (Retired) Jackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5 Arnold Weinrib, B.A. (Toronto) 1962, LL.B. (Toronto) 1965, LL.M. (Harvard) (1966), called to the Bar of Ontario, 1969, is Associate Professor of Law. Professor Weinrib served as Acting Dean in 1990 and as Associate Dean from 1988-1991. Professor Weinrib's teaching and scholarship have been concentrated on Property, Community Planning and Taxation. He is the Editor-in-Chief of the Land Compensation Reports and was Research Director to the Ontario Government's Select Committee on Land Drainage. He also acted as counsel to the Airport Inquiry Commission on a Second International Airport in the Toronto Area. For many years Professor Weinrib has been the Chair of the Admissions Committee at the Faculty of Law.",
    "listed_research_areas":null
  },
  {
    "faculty":"u_toronto",
    "name":"Albert Yoon",
    "title":null,
    "email":"albert.yoon@utoronto.ca",
    "href":"https:\/\/www.law.utoronto.ca\/faculty-staff\/full-time-faculty\/albert-yoon",
    "bio":"Professor and Michael J. Trebilcock Chair in Law and Economics Jackman Law Building78 Queen's ParkToronto, Ontario M5S 2C5 Albert Yoon holds the Michael J. Trebilcock Chair in Law and Economics.Albert received his undergraduate degree from Yale and his law and doctoral (political science) degrees from Stanford. During law school, he was the senior articles editor of the Stanford Law Review. After graduation, he clerked for the Hon. R. Guy Cole of the U.S. Court of Appeals for the Sixth Circuit. Before joining the Faculty of Law, Albert was professor of law at Northwestern University. At the Faculty of Law, he was Associate Dean - Research and Curriculum for the 2018-20 academic years. He has held fellowships at Princeton University and the Robert Wood Johnson, Russell Sage, and Pierre Elliott Trudeau foundations.Albert examines labor markets within and outside the legal profession.  He has published in the Chicago, Stanford, and Virginia law reviews; and the Annals of Applied Statistics, Journal of Law & Economics, Journal of Theoretical Politics, among others. He is a recipient of the Ronald H. Coase Prize for best article in Law and Economics and a member of the American Law Institute. His recent scholarship focuses on legal ethics, and applications of machine learning and natural language processing to law.Beyond his academic career, Albert is co-founder of Blue J Legal, the company behind Tax Foresight and Employment Foresight: the next generation of legal research tools that harness the power of artificial intelligence to provide instant and comprehensive answers in complex areas of tax, labor, and employment law.",
    "listed_research_areas":null
  }
]