[
  {
    "faculty":"uottawa-civil",
    "name":"André Bélanger",
    "title":"Professeur titulaire",
    "email":"andre.belanger@uottawa.ca",
    "href":"https:\/\/uniweb.uottawa.ca\/members\/4708\/profile",
    "bio":"Avant de joindre le corps professoral de la Section de droit civil de la Faculté de droit de l’Université d’Ottawa en 2020, André Bélanger était professeur titulaire à la Faculté de droit de l’Université Laval où il enseignait et faisait de la recherche depuis 2002. Ses intérêts portent sur le droit des obligations, la théorie du contrat et le droit des assurances. Ses recherches et publications sur le contrat et le droit des assurances l'ont amené à développer des liens qui unissent le droit et l'anthropologie, l’art contemporain, la linguistique, la statistique, la théorie littéraire, la philosophie, la sociologie et la théorie de l'architecture.",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Sarah Berger Richardson",
    "title":"Professeure adjointe",
    "email":"sarah.bergerrichardson@uottawa.ca",
    "href":"https:\/\/uniweb.uottawa.ca\/members\/4299\/profile",
    "bio":"My research focuses on the regulation of food and agricultural systems, with a particular emphasis on ethical and sustainable practices in animal agriculture.&nbsp;",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Emmanuelle Bernheim",
    "title":"Professeure titulaire",
    "email":"ebernhe2@uottawa.ca",
    "href":"https:\/\/uniweb.uottawa.ca\/members\/4302\/profile",
    "bio":"My research focuses on the role of law and justice in the production and reproduction of inequalities. In the last five years, I have been involved in various research activities, developing a research program around the issue of access to justice and its implementation for marginalized citizens. I am developing this problematic under three main axes: 1- mental health, 2- youth protection and 3- self-representation in court.&nbsp;",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Thomas Burelli",
    "title":"Professeur agrégé",
    "email":"tburelli@uottawa.ca",
    "href":"https:\/\/www.uottawa.ca\/faculte-droit\/droit-civil\/corps-professoral\/burelli-thomas",
    "bio":"Thomas Burelli donne le cours de Droit international de l’environnement. Il est membre du Centre de recherche en droit, technologie et société de l'Université d'Ottawa. Visitez Academia pour la liste des Publications de Thomas Burelli.",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Vincent Caron",
    "title":"Professeur agrégé",
    "email":"vincent.caron@uOttawa.ca",
    "href":"https:\/\/www.uottawa.ca\/faculte-droit\/droit-civil\/corps-professoral\/caron-vincent",
    "bio":"Vincent Caron est professeur agrégé. Ses intérêts de recherche et d'enseignement portent principalement sur le droit des obligations, le droit des assurances, le droit romain, l'interprétation d'actes juridiques ainsi que la justification des décisions. Il s'intéresse également à la pédagogie et à l'enseignement du droit. Il est lauréat du Prix d'excellence 2014 en enseignement à l'Université de Montréal décerné par le vice-rectorat aux études dans la catégorie «Chargé de cours doctorant et chercheur post-doctorant». Titulaire d'un baccalauréat en droit et d'une maîtrise en droit de l'entreprise de l'Université Laval, il a poursuivi des études de troisième cycle en droit privé à la Faculté de droit de l'Université de Montréal. Sa thèse de doctorat, rédigée sous la direction des professeurs Benoît Moore et Didier Lluelles et intitulée Jalons pour une théorie pragmatique de l'interprétation du contrat: du temple de la volonté à la pyramide de sens, a reçu les plus hautes distinctions: mention exceptionnelle, suggestion de figurer au tableau d'honneur du Doyen, suggestion de pouvoir représenter l'Université de Montréal à des concours de rédaction et Prix Thémis 2015. Membre du Barreau du Québec, il a effectué son stage sous la supervision du professeur Benoît Moore lors de la mise à jour du Traité des obligations, corédigé par les professeurs Lluelles et Moore. Il a été auxiliaire de recherche pendant quatre ans à la Chaire Jean-Louis Baudoin en droit civil.",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Céline Castets-Renard",
    "title":"Professeure titulaire",
    "email":"celine.castets-renard@uottawa.ca",
    "href":"https:\/\/uniweb.uottawa.ca\/members\/4949\/profile",
    "bio":"<div>Céline Castets-Renard is the Research Chairholder Accountable AI in a Global Context. She also holds a research chair in Law, Accountability and Social Trust in AI at ANITI (Artificial and Natural Intelligence Toulouse Institute) in France.<\/div><div><br><\/div><div>She is a member expert at the European Commission, Observatory Online Platform Economy.<\/div><div><br><\/div><div>She is a former junior member at the \"Institut Universitaire de France\" and Fellow at the Internet Society Project, Law Faculty, Yale University.<br><\/div><div><br><\/div><div>Her research generally focuses on the law and regulation of digital technologies and artificial intelligence in a comparative perspective (Canadian, European and American law), especially the protection of personal data and privacy, policing technologies, online platforms and  cybersecurity. <\/div><div><br><\/div><div>She also studies the impact of technologies on human rights, equity and social justice in a global perspective, particularly in North-South relationships.<\/div>",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Naivi Chikoc Barreda",
    "title":"Professeure adjointe",
    "email":"nchikocb@uottawa.ca",
    "href":"https:\/\/www.uottawa.ca\/faculte-droit\/droit-civil\/corps-professoral\/naivi-chikoc-barreda",
    "bio":"La professeure Chikoc Barreda s'intéresse au droit international privé et au droit privé comparé dans un contexte de mondialisation. Elle détient un doctorat en droit (Université de Lleida, Prix extraordinaire de doctorat, 2020), une maîtrise en droit (Université de Montréal, 2014), un diplôme de droit notarial (Université de Montréal, 2011) et une licence en droit (Université de La Havane, 2001). Elle a été chercheuse invitée au Centre for Private International Law de l’Université de Aberdeen (2023) et à l’Institut de droit international privé de l’Université de Heidelberg (2022). Ses travaux portent sur différentes problématiques concernant la régulation des situations privées internationales et le notariat. En droit international privé, ses recherches couvrent un large éventail de sujets, tels les contrats, le télétravail transfrontalier, la circulation des actes notariés, la succession, la gestation pour autrui, les mariages, les divorces et la responsabilité extracontractuelle. Elle est membre de l’Association européenne de droit international privé (2021), de l’Association québécoise de droit comparé (2020), du Centre for Private international law de l'Université d'Aberdeen (2023) et de l’Observatoire pluridisciplinaire sur le devenir du droit privé (2022). Elle représente le Québec en tant que conseillère générale à l’Union internationale du notariat latin (2023). Au sein de cette institution, elle intègre la Commission des affaires américaines, l’Académie notariale américaine et le groupe de travail « Numérique et authenticité ».",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Pascale Cornut St-Pierre",
    "title":"Professeure agrégée",
    "email":"pascale.cornutst-pierre@uottawa.ca",
    "href":"https:\/\/www.uottawa.ca\/faculte-droit\/droit-civil\/corps-professoral\/Cornut-St-Pierre-Pascale",
    "bio":"Pascale Cornut St-Pierre est professeure agrégée à la Section de droit civil de la Faculté de droit de l’Université d’Ottawa. Dans ses recherches, elle s’intéresse aux façons dont les milieux d’affaires perçoivent, mobilisent et développent le droit dans leurs domaines d’activités. Ses travaux, qui touchent principalement au droit des affaires, au droit de l’entreprise, au droit financier ainsi qu’à l’impact de la globalisation économique sur le droit, puisent abondamment dans les recherches menées dans les disciplines des sciences sociales, telles la sociologie du droit, la sociologie économique, l’économie politique et les théories critiques. La professeure Cornut St-Pierre est titulaire d’un baccalauréat (2007) et d’une maîtrise (2009) en philosophie de l’Université de Montréal, d’un baccalauréat intégré en droit civil et common law de l’Université McGill (2013) et d’un doctorat de l’École de droit de Sciences Po Paris (2017). Sa thèse de doctorat, qui porte sur le rôle du travail juridique dans l’innovation financière, a été récompensée par le Prix Jean Carbonnier de la recherche sur le droit et la justice, ainsi que par le Prix solennel André Isoré de droit privé de la Chancellerie des Universités de Paris. Ce travail a mis en évidence le rôle crucial des juristes dans l’émergence d’un marché global pour les swaps et les autres instruments dérivés de gré à gré. Dans ses travaux en cours, la professeure Cornut St-Pierre s’intéresse à d’autres formes contemporaines d’innovation financière, dont la finance verte et les fintechs, de même qu’aux délinquances financières. Avant de se joindre à la Section de droit civil, la professeure Cornut St-Pierre a enseigné la sociologie du droit au Collège universitaire de Sciences Po, à Paris, ainsi que le droit civil avancé des obligations à la Faculté de droit de l’Université McGill. Elle est membre associée du Centre Perelman de philosophie du droit et chercheuse affiliée à l’ Initiative canadienne de droit climatique.",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Anne-Francoise Debruche",
    "title":"Professeure agrégée",
    "email":"Anne-Francoise.Debruche@uOttawa.ca",
    "href":"https:\/\/www.uottawa.ca\/faculte-droit\/droit-civil\/corps-professoral\/Debruche-Anne-Francoise",
    "bio":"Anne-Françoise Debruche a étudié le droit civil à Liège (Belgique) et la common law à Moncton. Elle a obtenu le titre de docteur en droit à Liège en 2004. Sa thèse de doctorat, qui portait sur l'équité judiciaire et les territoires du droit privé dans les systèmes romanistes et de common law, a été couronnée en 2006 du Prix Canada de l'Académie Internationale de Droit Comparé. Cette thèse a été publiée en 2008 sous le titre Équité judiciaire et territoires du droit privé par les Éditions Bruylant (Bruxelles) et Yvon Blais (Québec). Ses domaines de recherche comprennent le droit privé comparé (droit des biens en particulier), l'histoire du droit et la méthodologie juridique. Elle enseigne à la section de droit civil depuis 2005. Elle travaille actuellement à un projet de droit privé comparé avec des chercheurs brésiliens (les professeurs Ana Frazao de l'Université de Brasilia, Gustavo Tepedino de l'UERJ et Pablo Renteria de PUC Rio) sur le thème de l'effectivité des droits civils au Canada et au Brésil; projet financé par le CRSH.",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Lili DAO",
    "title":"Professeure adjointe",
    "email":"lili.dao@uottawa.ca",
    "href":"https:\/\/www.uottawa.ca\/faculte-droit\/droit-civil\/corps-professoral\/lili-dao",
    "bio":null,
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Geneviève Dufour",
    "title":"Professeur titulaire",
    "email":"genevieve.dufour@uottawa.ca",
    "href":"https:\/\/www.uottawa.ca\/faculte-droit\/droit-civil\/corps-professoral\/genevieve-dufour",
    "bio":"Site de la Chaire de recherche en droit du commerce durable, responsable et inclusif",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Patrick Dumberry",
    "title":"Professeur titulaire",
    "email":"pdumberr@uottawa.ca",
    "href":"https:\/\/uniweb.uottawa.ca\/members\/4803\/profile",
    "bio":"Patrick Dumberry, Ph.D. (Graduate Institute of International Studies, Geneva, Switzerland), is Full Professor at the University of Ottawa (Faculty of Law, Civil Law Section). He practiced in international law and international arbitration for several years with law firms in Geneva (Lalive), Montreal (Ogilvy Renault, now Norton Rose Fulbright) and with Canada’s Ministry of Foreign Affairs (Trade Law Bureau). He is the author of more than 80 publications in the fields of international investment law and international law. He has also published 8 books with Cambridge UP, Oxford UP, Elgar Publ., Brill, Martinus Nijhoff and Wolters Kluwer.&nbsp;",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Karen Eltis",
    "title":"Professeure titulaire",
    "email":"Karen.Eltis@uOttawa.ca",
    "href":"https:\/\/www.uottawa.ca\/faculte-droit\/droit-civil\/corps-professoral\/eltis-karen",
    "bio":"La professeure Karen Eltis est professeure titulaire à la Faculté de droit de l’Université d’Ottawa. Ses recherches se concentrent sur le ‘cyberdroit’ (l’intelligence artificielle, la cyber sécurité et la vie privée), l’impact des nouvelles technologies sur les droits constitutionnels, la santé\/bioéthique ainsi que la gouvernance démocratique dans une perspective de droit comparé. Karen est ancienne directrice du Centre des droits de la personne, Chercheure affiliée au CITP de l’Université Princeton (2016-2018) et professeure\/chercheure invitée à Columbia Law School.",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Jabeur Fathally",
    "title":"Professeur agrégé",
    "email":"jabeur.fathally@uOttawa.ca",
    "href":"https:\/\/www.uottawa.ca\/faculte-droit\/droit-civil\/corps-professoral\/fathally-jabeur",
    "bio":"Member of the Bar of Ontario ( Barrister & solicitor), Professor Fathally,holds a PhD, an LLM and an LLL from the University of Ottawa, as well as Maîtrise and a University Diploma of Legal Studies from the University of Tunis. He is a specialist in comparative law and international humanitarian law, with research focusing on a variety of complex legal topics and current events that promote critical analysis and dialogue on the various relationships between law, religion and human rights. Through his research and teaching, as well as his deep knowledge of legal and political issues in Canadian foreign policy and international human rights, Professor Fathally has quickly become an internationally renowned expert. He is a recipient of the prestigious Van Calker Scholarship from the Swiss Institute of Comparative Law, the University of Ottawa’s Gerald A. Beaudoin Scholarship and several other scholarships and grants. He is also an expert consultant to several international and intergovernmental organizations, including the World Health Organization , the World Justice Project and the Varieties of Democracy ( University of Oslo). Professor Fathally was a co-founder of JuriGlobe in 2007, oversaw the launching of the group’s innovative and widely-used website in 2009, and serves as the group’s current Executive Director and Senior Researcher. The JuriGlobe website – JuriGlobe World Legal Systems, www.juriglobe.ca – serves as an essential comparative legal tool, describing the legal systems in use around the world, the different official languages used in different jurisdictions, and the most important international commercial conventions at play in regions around the globe. In addition to becoming an educational tool for the teaching of comparative law and international law, and a key source of information for a number of international institutions and organizations, JuriGlobe work has drawn the attention of the legal scientific community in general, as evidenced by quotes and comments in various recent publications (e.g., in the American Journal of Comparative Law; Notarius, the scientific journal of the international Union of Notaries; and the Journal of UNESCO). As a professor of comparative law courses, specifically the world’s dominant contemporary legal systems, Professor Fathally emphasizes the importance of dialogue between legal cultures by explaining to students the different correlations between the world’s major legal traditions. He engages his students in a conversation-like manner and students are actively encouraged to raise questions. Within the University of Ottawa’s unique law school, which offers both common law and civil law courses in both French and English, Professor Fathally works to bridge the gaps between Canada’s two legal traditions by offering a course on civil law reasoning to students who have previously received training only in common law. In recognition of the quality of his teaching, Professor Fathally was awarded the prestigious Capital Educator’s Award by the Ottawa Network for Education (ONE) in 2015 after being a finalist for the same award in 2014. This award celebrates the achievements of outstanding educators and commends public education in the Ottawa community. Candidates from the University of Ottawa are selected by a committee at the University’s central administration on the basis of course evaluations completed by students. In the biography presented by the ONE upon awarding Professor Fathally the Capital Educator’s Award, the organization called him “a model of success for young people from immigrant backgrounds.” Professor Fathally is frequently asked by Canadian and international media for his analysis of national and international issues related to the different armed conflicts in the Middle –East, the interaction between systems of law and religion in the resolution of armed conflicts, the political changes recently experienced by certain Arab countries and the impact of these changes on women's rights, as well as countless other topics concerning the Arab-Muslim world and the legal implications of Canadian foreign policy in the Middle East. Drawing on his expertise in comparative law, Professor Fathally takes very seriously the need to educate the public on such topics, and he has been widely recognized for his efforts. In 2013, with a résumé that then boasted over hundreds of national and international media appearances, Professor Fathally was awarded the University of Ottawa’s Excellence in Media Relations Award, an impressive accomplishment given the University of Ottawa’s reputation as a leader in Canadian University media hits. According to the selection committee, Professor Fathally ranked as the University’s “most popular expert among the Canadian public” and the committee noted that “he has become a model of excellence for his peers.” This recognition led to him being hired in 2014 as a collaborator on the French-language program “Les Voies du Retour” mounted by Canada’s French-language public broadcaster, Radio-Canada. In only a few short years as a professor, Jabeur Fathally has become one of Canada’s go-to sources for understanding the specificities of Islamic law, and for bringing a knowledge of contemporary legal systems to the Canadian public. Following the political changes in various Arab countries after the Arab Spring in 2011, and at the insistence of Professor Fathally, the JuriGlobe group collaborated with the University of Ottawa’s Human Rights Research and Education Centre (HRREC) in the creation of numerous workshops and conferences aimed at providing the Canadian public with a better understanding of the challenges posed by these changes and, more specifically, to draw the public’s attention to the impact of these changes on women's rights in the region. Indeed, Professor Fathally was among the first Canadian intellectuals to draw attention to the specific challenges these policy changes posed for Arab women. His article “Les droits des femmes à l’aube du printemps arabe : de « ne pas oublier les femmes » au « Femmes : n’oubliez pas ! »” [Translation: “The rights of women at the dawn of the Arab Spring: From ‘do not forget the women’ to ‘Women: do not forget!’”, won the prestigious Paul Pinchaud award in 2013 for the best scholarly article published in the journal Études internationals, awarded by the Institute of International Studies of Laval University. In addition to the excellence of the text, the Committee stressed its originality and its timeliness. Jabeur Fathally is a member of the Faculty of graduate studies of the University of Ottawa and entitled to supervise Ph.D and Master thesis.",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Audrey Ferron Parayre",
    "title":"Professeure agrégée",
    "email":"audrey.parayre@uottawa.ca",
    "href":"https:\/\/uniweb.uottawa.ca\/members\/4739",
    "bio":"La professeure Ferron-Parayre s'intéresse globalement à l'adéquation entre les normes et les pratiques cliniques en santé. Ses recherches portent par exemple sur le consentement éclairé aux soins dans différents contextes, sur la santé reproductive des femmes et sur les directives médicales anticipées.&nbsp;",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Marie-France Fortin",
    "title":"Professeure agrégée",
    "email":"marie-france.fortin@uOttawa.ca",
    "href":"https:\/\/uniweb.uottawa.ca\/members\/5112\/profile",
    "bio":null,
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Pascale Fournier",
    "title":"Professeure titulaire",
    "email":"Pascale.Fournier@uOttawa.ca",
    "href":"https:\/\/www.uottawa.ca\/faculte-droit\/droit-civil\/corps-professoral\/fournier-pascale",
    "bio":"Pascale Fournier est professeure titulaire à la Section de droit civil de l’Université d’Ottawa et membre du Barreau du Québec, qui lui a décerné la distinction Advocatus Emeritus (Ad.E.) en 2009. En 2014, l’Assemblée nationale du Québec la nommait Commissaire à la Commission des droits de la personne et des droits de la jeunesse. Titulaire de la Chaire de recherche sur le pluralisme juridique et le droit comparé, Pascale est affiliée à différents centres de recherche : le Centre for the Study of Religion and Politics du St. Mary’s College (University of St. Andrews, Écosse), le “Religion and Diversity Project” de l’Université d’Ottawa, le Laboratoire de recherche interdisciplinaire sur les droits de l’enfant de l’Université d’Ottawa, le Centre de recherche en droit public de l’Université de Montréal et le Centre de recherche en éthique de l’Université de Montréal. Elle enseigne les droits et libertés, le droit de la famille ainsi que l’analyse critique du droit. Elle a également occupé le poste de vice-doyenne à la recherche de 2010 à 2012. La professeure Fournier détient un baccalauréat en droit de l’Université Laval (LL.B., 1997), une maîtrise en droit de l’Université de Toronto (LL.M., 2000) et un doctorat en droit de l’Université Harvard (S.J.D., 2007). Boursière de la Fondation Trudeau et du programme Fulbright, elle a également été clerc auprès de l’Honorable Claire L’Heureux-Dubé à la Cour suprême du Canada (2000-2001). Pascale a enseigné le droit à l’Université d’État d’Haïti, à l’Université McGill, à l’Université pour la Paix du Costa Rica, à l’Université de Montréal et à l’Institut de recherche sur le droit des femmes en Iran. En 2008, elle a agi à titre d’experte consultante auprès du Programme des Nations Unies pour le développement sur la question du droit à l’égalité des femmes musulmanes en Tunisie, en Égypte, en Malaisie et au Nigéria. La professeure Fournier est passionnée par les questions d’accessibilité à la justice, notamment pour les femmes et les enfants appartenant à des groupes minoritaires, et fascinée par les entrecroisements entre le droit religieux et le droit séculier. Ses travaux portent principalement sur le droit de la famille, le droit criminel, les droits de la personne et le droit constitutionnel comparé. Auteure de plus d’une quarantaine de publications académiques, Pascale Fournier est reconnue à l’échelle internationale pour sa contribution significative à l’avancement du droit des femmes. Ses travaux, qui ont fait l’objet de publications au Canada et à l’étranger, ont été couronnés par le Harvard-Stanford International Junior Faculty Forum (2008), le prix de la Fondation du Barreau du Québec dans la catégorie “manuscrit d’écrit juridique” (2009) et l’Association canadienne des professeurs de droit (“Mention honorable” \/ Meilleur essai juridique: 2010). Son livre, Muslim Marriage in Western Courts: Lost in Transplantation, est paru en 2010 aux éditions Ashgate et les Presses de Sciences Po Paris ont publié une version française en 2013. Elle a dirigé l’édition de deux numéros spéciaux de revues scientifiques, respectivement Social Identities: Journal for the Study of Race, Nation and Culture et la Revue canadienne de droit pénal. Les réalisations de Pascale Fournier ont été récompensées par plusieurs distinctions : la médaille Raymond-Blais (2008) et la médaille Gloire de l’Escolle (2016) de l’Université Laval, le prix du Recteur de l’Université d’Ottawa pour l’excellence en relations médiatiques (2011), la distinction “Fulbrighter of the Month” (Novembre 2011), le prix d’excellence académique et contribution humanitaire de la Chambre de commerce canado-arabe (2014), la distinction « Mur des grands diplômés du CÉGEP Garneau » (2016) et le prix d’excellence en enseignement de la capitale 2016 décerné par le réseau d’Ottawa pour l’éducation (ROPE). En 2014, la Professeure Fournier a été choisie par l’International Women’s Forum et, en 2015, elle a été invitée à se joindre à la Conférence canadienne du Gouverneur général sur le leadership (Groupe d’étude : Territoires du Nord-Ouest). En 2015, le magazine Canadian Lawyer désignait Pascale Fournier comme « l’une des 25 avocat.e.s les plus influent.e.s au Canada » dans la catégorie « internationale ». En 2016, elle a été élue membre du Collège de nouveaux chercheurs et créateurs en art et en science de la Société royale du Canada. CV Fr Pascale Fournier (mars 2018) CV En Pascale Fournier",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Margarida Garcia",
    "title":"Professeure titulaire",
    "email":"mgarcia@uOttawa.ca",
    "href":"https:\/\/www.uottawa.ca\/faculte-droit\/droit-civil\/corps-professoral\/Garcia-Margarida",
    "bio":"Margarida Garcia est professeure à la Faculté de droit, Section de droit civil. Elle est également professeure au département de criminologie de la Faculté des sciences sociales. La professeure Garcia s’intéresse aux thèmes du leadership, de l’innovation et des obstacles à l’innovation dans la réforme du droit (surtout dans le domaine du droit pénal et des droits de la personne) et du changement institutionnel. Elle s’est aussi spécialisée dans la réflexion épistémologique et méthodologique entourant la recherche empirique en droit. La professeure Garcia détient un doctorat en sociologie (du droit), une maîtrise en criminologie, une licence en droit et une post-licence en droit. Elle est membre de la Chaire de recherche du Canada en traditions juridiques et rationalité pénale, de l’Association internationale de droit pénal (comité des pénalistes francophones) et chercheure associée de l’axe « Justice et droit » du Centre interdisciplinaire de recherche sur la citoyenneté et les minorités (CIRCEM). La professeure Garcia s’intéresse au droit pénal et aux droits de la personne dans ses travaux et elle aborde ces thèmes dans la perspective interdisciplinaire qui a marqué sa formation universitaire (droit, criminologie, sociologie du droit pénal). Le fil d’Ariane qui traverse son projet intellectuel et académique est celui de stimuler des idées qui puissent contribuer à la transformation et à la réforme de la recherche, de l’enseignement et de la pratique du droit, en mettant l’accent sur le besoin de trouver des ponts et des lieux d’échange entre ces trois univers. Sa réflexion est traversée par le pari de croiser le(s) savoir(s) juridique(s) produits par le droit et les connaissances produites par les sciences sociales, méthode que la chercheure considère essentielle pour comprendre la production de normes dans un monde multiculturel, pluraliste et diversifié. Ses recherches à ce jour ont porté principalement sur la théorie de la rationalité pénale moderne, le rapport entre les droits de la personne et le droit criminel, le concept de peine, de punition et le processus de détermination de la peine, et les questions épistémologiques qui entourent la recherche empirique en droit. Aujourd’hui la professeure Garcia est engagée à développer une approche du leadership bien ancré dans les humanités (leadership ontologique), en faisant de la salle de classe un laboratoire expérientiel et transformationnel. Elle explore aussi le thème du leadership dans l’univers de la recherche et de la production de connaissances. Ses travaux, subventionnés notamment par le Conseil de recherches en sciences humaines du Canada et par la Fondation du droit de l’Ontario, comptent sur l’apport et la participation active d’acteurs judiciaires canadiens, européens et sud-américains (surtout juges et procureurs de la Couronne). Les résultats de ses enquêtes ont fait l’objet de plusieurs bourses d’excellence et notamment de la bourse doctorale décernée par la Fondation Pierre Elliott Trudeau (Canada) et du Prix de la meilleure thèse de la Faculté des sciences humaines de l’Université du Québec à Montréal (2011). Ils ont aussi fait l’objet de plusieurs conférences nationales et internationales et de publications au Canada, au Brésil, en Argentine, en Belgique, en Italie et en France. Elle a co-édité avec Richard Dubé (Université d'Ottawa, Canada) et Maira Rocha Machado (Fundação Getúlio Vargas, Brazil) le livre La rationalité pénale moderne: réflexions théoriques et explorations empiriques (2013). Elle a également co-édité, avec Marie-Eve Sylvestre (Université d'Ottawa, Canada) et Julie Desrosiers (Université Laval, Canada), l'ouvrage Réformer le droit criminel au Canada: défis et possibilités (2017).",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Michelle Giroux",
    "title":"Professeure titulaire",
    "email":"Michelle.Giroux@uOttawa.ca",
    "href":"https:\/\/www.uottawa.ca\/faculte-droit\/droit-civil\/corps-professoral\/giroux-michelle",
    "bio":"Michelle Giroux est professeure titulaire à la Section de droit civil. Elle enseigne le droit des personnes et de la famille, la bioéthique et le droit médical. Ses recherches portent sur les soins de fin de vie ainsi que sur la filiation et la définition de la famille. Elle travaille notamment sur des thèmes liés à la procréation assistée dont le droit fondamental de connaître ses origines et la maternité pour autrui. Elle s’intéresse aux approches multidisciplinaires pour analyser le droit. Elle est l’auteure de plusieurs publications, rapports de recherche et communications, au Canada et à l’étranger. Elle a été professeure invitée à la Faculté de droit de l'Université de Montréal, (2008 et 2017), à l'Institut national de la recherche scientifique - Urbanisation Culture Société à Montréal (2014-2015), à l’Université Paris 1- Panthéon-Sorbonne et à l’École des Hautes études en sciences sociales (EHESS), à Paris (2012) ainsi qu’à l’Université de Barcelone (2003). En août 2017, elle a été élue membre associée de l’Académie internationale de droit comparé. Depuis juillet 2015, elle est membre du Comité consultatif de la Commission du droit de l’Ontario, sur le projet Améliorer les dernières étapes de la vie. Elle a fait partie du comité de juristes experts désigné par le gouvernement du Québec pour étudier la mise en œuvre des recommandations de la Commission spéciale de l'Assemblée nationale du Québec sur la question de mourir dans la dignité et dont le rapport a été rendu public en janvier 2013. En 2007, elle s’est vue octroyer une bourse de réorientation pour le développement de l’expertise multidisciplinaire en santé de la Fondation canadienne de recherche sur les services de santé. Elle a présidé l’Association québécoise de droit comparé en 2013-2014 ainsi que l'Association des professeures et des professeurs de droit du Québec en 1998-1999. Elle a été vice-doyenne et secrétaire de la Section de droit civil en 1999-2000. Michelle Giroux est membre du Laboratoire de recherche interdisciplinaire sur les droits de l’enfant (LRIDE) et du Centre de droit, politique et éthique de la santé (CDPES). Elle est impliquée dans plusieurs projets et partenariats de recherche sur le plan national et international.",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Mistrale Goudreau",
    "title":"Professeure titulaire",
    "email":"Mistrale.Goudreau@uottawa.ca",
    "href":"https:\/\/uniweb.uottawa.ca\/members\/2612\/profile",
    "bio":"Mistrale Goudreau est une spécialiste de propriété intellectuelle et industrielle. Elle enseigne aussi en interprétation des lois et en théorie du droit. Ses activités de recherche portent principalement sur le droit fédéral canadien de la propriété intellectuelle et son interaction avec les règles générales du droit civil.",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Lynda Hubert Ta",
    "title":"Professeure adjointe",
    "email":"lhubertt@uottawa.ca",
    "href":"https:\/\/www.uottawa.ca\/faculte-droit\/droit-civil\/corps-professoral\/hubert-ta-lynda",
    "bio":"La nouvelle professeure en droit de l’entreprise possède un riche parcours universitaire, qui se démarque par son excellence et son interdisciplinarité. Elle est titulaire de trois diplômes de l’Université catholique de Madagascar : un diplôme d’études universitaires en sciences sociales, une maîtrise en économie et en gestion et un diplôme d’études approfondies en population et développement ; de trois diplômes du Centre national de télé-enseignement de Madagascar (diplôme de premier cycle, diplôme supérieur et magistère en études juridiques); ainsi que de deux diplômes de l’Université Laval : une maîtrise en droit de l’environnement, développement durable et sécurité alimentaire et un doctorat en droit, obtenu en 2021. Sa thèse de doctorat porte sur la protection de la biodiversité dans le contexte du développement minier à Madagascar, et s’intéresse notamment au rôle des entreprises multinationales du secteur minier dans la mise en œuvre des mesures de protection de l’environnement et aux enjeux de légitimité sociale auxquelles elles font face. La réalisation de sa thèse a été soutenue par de nombreuses bourses, dont la prestigieuse Bourse d’études supérieures du Canada Joseph-Armand-Bombardier du CRSH, et a été reçue - avec éloges - par les membres de son jury de soutenance, ce qui lui vaut de figurer sur le tableau d’honneur de la Faculté des études supérieures de l’Université Laval. La professeure Hubert Ta est chercheure associée à la Chaire de recherche du Canada en droit de l’environnement, au Groupe de recherche sur le droit des ressources naturelles et de l’énergie en Afrique et au Centre interdisciplinaire de recherche sur l’Afrique et le Moyen-Orient à l’Université Laval. Depuis mai 2021, elle est également conseillère en changements climatiques et environnement auprès du ministère des Relations internationales et de la Francophonie du Québec. Possédant un réseau international bien ancré dans la francophonie, et en particulier avec les pays de l’Afrique francophone, elle a l’intention de continuer le développer et d’en faire profiter notre communauté étudiante. La professeure Hubert Ta se joint à nous dès le 1er juillet 2022 et enseignera le cours obligatoire de droit des entreprises et un cours optionnel portant sur la responsabilité sociale des entreprises et les enjeux de durabilité.",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Mariève Lacroix",
    "title":"Professeure titulaire",
    "email":"marieve.lacroix@uottawa.ca",
    "href":"https:\/\/uniweb.uottawa.ca\/members\/4788\/profile",
    "bio":"Les intérêts de recherche et d’enseignement en droit privé (obligations, personnes et responsabilité) et comparé (systèmes juridiques alémanique, belge, français et helvétique) de la professeure Lacroix incluent la recherche fondamentale et certaines dimensions plus pratiques. Elle a développé trois axes de recherche.&nbsp;<div><br><\/div><div>D’abord, la matière de la responsabilité civile, dont elle renouvelle l’étude, la présentation et la compréhension par une analyse théorique fondamentale des concepts qui structurent son édifice. Dans une visée plus pragmatique, elle poursuit une étude de la responsabilité civile confrontée à des professionnels dûment identifiés, notamment les avocats, les notaires, les juges et les forces policières. Plus spécifiquement, ses travaux publiés sur la responsabilité des forces policières ont été cités par la Cour suprême du Canada dans l’arrêt Kosoian c. Société de transport de Montréal, 2019 CSC 59, et par la Cour d’appel du Québec dans l’arrêt Procureur général du Canada c. Manoukian, 2020 QCCA 1486. Elle a été invitée à être conseillère éditoriale pour le JurisClasseur Québec – Responsabilité civile professionnelle des Éditions LexisNexis au Canada.&nbsp;<\/div><div><br><\/div><div>Ensuite, elle nourrit des réflexions critiques sur les droits fondamentaux de la personne suivant un arrimage de deux instruments normatifs dans le panorama québécois, soit le Code civil du Québec et la Charte des droits et libertés de la personne. Si le principe matriciel de la dignité humaine, notamment à la mort, l’intéresse tout particulièrement, une conceptualisation renouvelée du droit à la réputation, ainsi qu’une perspective du droit à la vie privée par sa composante de l’image (l’égoportrait) stimulent son intérêt. Par voie analogue, elle a proposé la reconnaissance d’un droit nouveau en droit privé québécois, soit le droit à la vie familiale.&nbsp;<\/div><div><br><\/div><div>Enfin, elle appréhende le statut juridique du corps humain au moment du décès, qui oscille entre un sujet et un objet de droit. Pour ce faire, elle favorise une analyse transversale des droits de la personne, des biens et des obligations afin de favoriser un traitement adéquat du cadavre humain.<\/div>",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Céline Lévesque",
    "title":"Professeure titulaire",
    "email":"Celine.Levesque@uOttawa.ca",
    "href":"https:\/\/www.uottawa.ca\/faculte-droit\/droit-civil\/corps-professoral\/levesque-celine",
    "bio":"Céline Lévesque est professeure à l’Université d’Ottawa depuis bientôt vingt-quatre ans, où elle a occupé le poste de doyenne de la Faculté de droit, Section de droit civil, de 2014 à 2019. C’est une spécialiste du droit international économique, en particulier du droit international des investissements. Céline a été professeure invitée à l’Université Paris 1 Panthéon-Sorbonne et à l’Université Xi’an Jiaotong, en Chine. Elle a aussi donné des cours et des conférences dans une douzaine de pays. De 2019 à 2021, elle était la présidente du Conseil canadien de droit international (CCDI). La professeure Lévesque agit aussi à titre d’arbitre dans des affaires entre investisseurs et États (comme présidente et co-arbitre). En juillet 2020, elle a été désignée pour faire partie de la liste des trente membres de groupes spéciaux pour le règlement des différends au titre du chapitre 31 de l’Accord Canada–États-Unis–Mexique (ACEUM). De plus, sa désignation à la liste des membres des groupes spéciaux créés en vertu du chapitre 19 de l’ALENA, datant de 2018, demeure effective pour ce qui est du chapitre 10 (recours commerciaux) de l’ACEUM. En 2008–2009, Céline a occupé le poste d’universitaire en résidence au ministère des Affaires étrangères et du Commerce international à Ottawa. Au sein de la Direction générale du droit commercial international, elle a participé à des affaires traitées en vertu du chapitre 11 de l'ALENA et à la négociation de traités bilatéraux portant sur l'investissement. En début de carrière, Céline a travaillé à la Banque mondiale, à Washington, DC, au sein d’un groupe spécialisé dans la participation du secteur privé aux infrastructures des pays en développement (de 1995 à 1998). Elle a participé à des projets liés à l’eau et à l’énergie, notamment en Afrique de l’Ouest, ainsi qu’à des missions en Côte d’Ivoire, en Guinée (Conakry), en Mauritanie et au Sénégal.",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Pascal McDougall",
    "title":"Professeur adjoint",
    "email":"pascal.mcdougall@uottawa.ca",
    "href":"https:\/\/www.uottawa.ca\/faculte-droit\/droit-civil\/corps-professoral\/mcdougall-pascal",
    "bio":"Pascal McDougall est professeur adjoint à la Section de droit civil de la Faculté de droit de l’Université d’Ottawa. Ses domaines de recherche principaux sont le droit du travail comparé et international, le développement économique et les droits humains. Ses projets actuels visent à élaborer des propositions de réformes pour orienter davantage le droit syndical et les politiques macroéconomiques vers les besoins des travailleurs précaires à bas salaires, dans les pays du Nord ainsi que dans les pays du Sud. Le professeur McDougall détient un doctorat en droit de Harvard Law School (2021), une maîtrise en droit de l’Université de Toronto (2013) et une Licence en droit de l’Université d’Ottawa (2011). Sa thèse de doctorat, intitulée Labor Unions, Firm Governance, and Their Macroeconomic Infrastructure: A Legal Institutionalist Revision of the Economics of Collective Bargaining, développe une nouvelle modélisation économique de la négociation collective qui met en évidence l’impact des rouages juridiques du marché comme le droit privé et le droit de l’entreprise sur la distribution des richesses. Membre du Barreau du Québec, le professeur McDougall a travaillé comme stagiaire en droit au sein du contentieux de la Confédération des syndicats nationaux (CSN) à Montréal (2014) et comme auxiliaire juridique pour le juge Clément Gascon à la Cour suprême du Canada (2015-2016). Il a été chercheur invité à l'Institut de hautes études internationales et du développement à Genève (2018) et au Laboratoire de recherche sur le droit du travail et le développement de l’Université McGill (2019). Avant de se joindre à la Section de droit civil, le professeur McDougall a enseigné le droit international et européen du travail ainsi que le droit et le développement économique à Sciences Po Paris, où il était visiting fellow en 2020 et 2021.",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Ghislain Otis",
    "title":"Professeur titulaire",
    "email":"Ghislain.Otis@uOttawa.ca",
    "href":"https:\/\/www.uottawa.ca\/faculte-droit\/droit-civil\/corps-professoral\/otis-ghislain",
    "bio":null,
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Peter Oliver",
    "title":"Professeur titulaire",
    "email":"Peter.Oliver@uOttawa.ca",
    "href":"https:\/\/www.uottawa.ca\/faculte-droit\/droit-civil\/corps-professoral\/oliver-peter",
    "bio":"Avant de revenir au Canada en 2005, le professeur Oliver occupait la Chaire en droit à l’Université de Londres (KCL) et a été professeur invité à l’Université Toulouse I. En 2005-6 Il a été choisi à titre de chercheur invité à la Section du droit constitutionnel, administratif et international de Justice du Canada. Par la suite, il s’est vu offrir le rôle de conseiller spécial en matière d’affaires juridiques et constitutionnelles au secrétariat des Affaires intergouvernementales du Bureau du Conseil privé, où lui et les autres membres de l'équipe ont remporté une Prime au mérite pour leur travail sur « la nation québécoise ». Depuis son arrivée à la faculté de droit, le professeur Oliver a occupé le poste de vice-doyen (études, recherche) à deux reprises. Il est membre de la Section droit civil depuis 2022, tout en poursuivant son enseignement (deux cours par année) au sein de la Section common law. Il était un des co-fondateurs du Groupe de droit public et (avec Vanessa MacDonnell) du Centre de droit public uOttawa Public Law Centre. Il était « Co-Convenor » (avec Michael Pal et Jason Varuhas) de la quatrième Conférence de droit public qui devrait en principe se dérouler à Ottawa du 18 au 20 juin 2020 (mais qui a dû être annulée à cause de la pandémie globale). Au début de carrière, le professeur Oliver visait plusieurs enjeux de nature constitutionnelle dans ses recherches. Il a appliqué son approche théorique, comparée et historique à des problèmes juridiques pratiques tels que la dévolution du Commonwealth, une Union européenne plus étroite, l’indépendance, la sécession et fédéralisme. Le professeur Oliver concentrait ses recherches sur les interprétations de deux concepts théoriques fondamentaux : la « souveraineté » et le « système juridique ». Sa façon d’aborder ces deux concepts donnait lieu à un compte rendu théorique de transitions juridiques fondamentales, en expliquant notamment la manière dont la continuité constitutionnelle peut engendrer l’indépendance constitutionnelle. Ses travaux ont été cités dans des publications majeures en Allemagne, en Australie, au Canada, en Inde, en Israël, au Japon, en NouvelleZélande, en Afrique du Sud, au Royaume-Uni et aux États-Unis. Il discute de façon approfondie de son approche envers la continuité et l’indépendance constitutionnelles dans son livre publié en 2005 The Constitution of Independence: The Development of Constitutional Theory in Australia, Canada and New Zealand (Oxford University Press). Cet ouvrage contribuait au regain d’intérêt pour le droit, les politiques et l’histoire entourant le Commonwealth. Ses recherches font souvent appel à des textes érudits oubliés sur le Commonwealth qu’il applique à de nouveaux contextes, notamment le R.-U.-Europe, le R.U.-Écosse et le Canada-Québec. Le travail du professeur Oliver sur la souveraineté et les systèmes juridiques a été cité dans de prestigieuses publications à l’échelle du monde. Le chercheur australien, Jeffrey Goldsworthy, a consacré un chapitre au complet de sa monographie, publiée en 2010 et intitulée Parliamentary Sovereignty: Contemporary Debates, aux recherches du professeur Oliver; dans sa critique de The Constitution of Independence rédigée pour la revue majeure, Public Law, David Dyzenhaus, professeur de droit et de philosophie à l’Université de Toronto, qualifie la contribution de P. Oliver « d’excellente illustration de la manière dont la théorie et l’histoire du droit parviennent à s’éclairer mutuellement » ; quant à Andrew Macdonald, de l’Université de Californie à Berkeley, il le qualifie de « formidable travail d’érudition … fouillé, rigoureux et profondément révélateur ». L’éminente Society of Legal Scholars, située au R.U., lui a décerné un des prestigieux prix Peter Birks « for Outstanding Legal Scholarship » pour 2006. Les écrits plus récents du professeur Oliver explorent les enjeux liés à la Constitution canadienne, et en particulier en ce qui a trait au partages des compétences, l’histoire constitutionnelle et la théorie constitutionnelle. Les textes les plus récents du professeur Oliver sont empreints des mêmes qualités qui distinguaient déjà ses travaux antérieurs, soit l’identification d’hypothèses théoriques non formulées qui sous-tendent les débats de nature constitutionnelle ainsi que leur évolution dans l’histoire canadienne et par rapport à des développements comparables dans d’autres pays. Le professeur Oliver a obtenu une subvention Savoir du Conseil de recherches en sciences humaines (CRSH) en 2023 pour sa recherche sur la constitution canadienne et « une théorie de droit durable » (a sustainable jurisprudence), c’est-à-dire un cadre théorique qui considère le droit à la fois comme une norme faisant autorité et comme un projet durable et nécessairement adaptable, capable de répondre aux besoins actuels et en même temps d’aider les générations futures à répondre à leurs propres besoins probablement bien différents. Plusieurs facteurs entrent en ligne de compte dans l’élaboration de ce cadre, notamment la légitimité et l’autorité des règles émanant de sources reconnues et la qualité morale de ces règles. De plus, ce qui distingue cette approche des autres, la théorie de droit durable encourage à prendre en considération la pertinence de ces règles dans un contexte en constante évolution. Les problèmes environnementaux, les crises de santé publique et la montée de l’intelligence artificielle sont quelques-unes des questions urgentes qui alimentent les débats dans le milieu de la recherche en droit constitutionnel, notamment sur la pertinence d’adapter nos lois fondamentales aux réalités de la société canadienne d’aujourd’hui. Ces questions sont au centre des discussions sur la théorie de l’arbre vivant et l’originalisme dans l’interprétation constitutionnelle, sur le rôle des principes constitutionnels non écrits et sur celui de la fonction judiciaire. Le professeur Oliver a été invité à présenter ses recherches dans le monde entier, notamment à des institutions de premier plan telles que l’Université d’Oxford, l’Université d’Édimbourg, le Max Planck Institute à Heidelberg, l’Université de Melbourne, l’Université de Toronto, l’Université McGill et l’Université de Montréal. Il a en outre été invité à deux reprises comme conférencier principal à la Conférence en droit constitutionnel, international et administratif organisée par Justice Canada. Le professeur Oliver a occupé le poste de « Christensen Visiting Fellow » à l’Université Oxford. Il était co-directeur du Oxford Handbook of the Canadian Constitution (2017). Il est membre de l'équipe (Canadian Law Group) qui rédige l'ouvrage Canadian Constitutional Law (Emond). En 2019, le professeur Oliver a reçu le Prix pour une contribution remarquable à la Revue de droit d’Ottawa. En 2020, il a obtenu le Prix d'excellence en recherche de la Faculté de droit, Section de common law. Il était le récipiendaire du prix Alumni of Influence de University College, Université de Toronto en 2021. En 2022, l’association des étudiant.e.s à la faculté de droit lui a décerné un prix pour son enseignement.",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Eva Ottawa",
    "title":"Professeure adjointe",
    "email":"eva.ottawa@uottawa.ca",
    "href":"https:\/\/www.uottawa.ca\/faculte-droit\/droit-civil\/corps-professoral\/ottawa-eva",
    "bio":"Eva Ottawa est une chercheuse atikamekw nehirowisiw originaire de Manawan, au Québec. Elle détient un baccalauréat en droit de l’Université Laval et est présentement en voie de terminer une thèse de maîtrise à l’Université d’Ottawa portant sur les pratiques et les normes coutumières en matière de circulation et de prise en charge des enfants chez les Atikamekw Nehirowisiwok de Manawan. Eva Ottawa a décidé d’entreprendre des études supérieures à la suite d’un parcours professionnel exceptionnel. Très impliquée depuis plus de 20 ans sur le plan politique au sein de sa nation, elle a notamment occupé la fonction de grand chef de la nation Atikamekw durant deux mandats, soit de 2006 à 2013. À ce titre, elle a entre autres assumé des responsabilités de première importance en lien avec la négociation des revendications territoriales et d’autonomie gouvernementale des Atikamekw, et la mise en place de démarches novatrices de gouvernance au sein de la nation. Plus récemment, en plus de son implication continue au sein de sa communauté, elle a pu mettre à profit sa formation juridique en agissant à titre de commissaire à la Commission des droits de la personne et de la jeunesse du Québec. Eva Ottawa a intégré le monde de la recherche universitaire en 2012 en s’impliquant de manière active dans le projet de recherche partenarial dirigé par Ghislain Otis sur le pluralisme juridique et les ordres juridiques autochtones (Legitimus), à la fois à titre membre du comité de direction du projet et de chercheuse dans l’équipe de recherche atikamekw. Dans le cadre de ce projet, Eva a participé à plusieurs manifestations scientifiques majeures dans le cadre desquels elle a présenté ses travaux de recherche. Elle a de plus joué un rôle central dans l’organisation du Forum sur le droit et la gouvernance d’atikamekw nehirowisiw qui a eu lieu à Manawan en octobre 2018. Elle s’est par ailleurs activement impliquée auprès de la Faculté, à titre de membre de notre Comité de vérité et de réconciliation, dans l’organisation et le déroulement du cours DRC1500 « Initiation aux traditions juridiques autochtones », une formation obligatoire pour tous nos étudiants de première année et dans la supervision de l’équipe d’étudiants qui participe au concours de médiation Kawaskimhon. Eva Ottawa vient de remporter la Médaille Premiers Peuples (Premières Nations) décernée par le lieutenant-gouverneur du Québec en décembre 2019.",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"John Packer",
    "title":"Directeur du Centre de recherche et d’enseignement sur les droits de la personne",
    "email":"jpacker@uOttawa.ca",
    "href":"https:\/\/www.uottawa.ca\/faculte-droit\/common-law\/personnes\/packer-john",
    "bio":"John Packer est professeur de droit agrégé et directeur du Centre de recherche et d’enseignement sur les droits de la personne (CREDP) à l'Université d'Ottawa. Il a auparavant enseigné à l’École Fletcher de l’Université de Tufts et à l’Université d'Essex, il a été nommé boursier de recherche au sein des universités Cambridge et Harvard et a donné des conférences dans plusieurs universités et établissements professionnels dans le monde. Il est aussi membre du conseil d'administration de plusieurs ONG et il fait partie du groupe consultatif d'experts du Shared Societies Project du Club de Madrid, qui comprend près de 100 anciens chefs d'État ou de gouvernements de démocraties. Avant de se joindre à l’Université d’Ottawa en 2014, le professeur Packer a agi à titre d’expert en matière de constitutions et de conception de processus au sein de l’équipe volante d’experts des Nations unies dans le domaine de la médiation prodiguant des conseils sur de nombreux processus de paix et sur des transitions politiques dans le monde, mettant l’accent sur la prévention et la résolution de conflits, la gestion de la diversité, la réforme constitutionnelle et juridique et la protection des droits de la personne, y compris les minorités. En trente ans de carrière, John a collaboré à des processus de pacification dans plus de cinquante pays et a dispensé des conseils à nombre d’organisations intergouvernementales, de gouvernements, de communautés et d’autres intervenants. De 1995 à 2004, il a été conseiller juridique principal, puis le premier directeur du bureau du Haut Commissariat pour les minorités nationales de l'OSCE à La Haye, œuvrant à l’échelle de l’Europe de l'Est et de l’Europe centrale ainsi que sur tout le territoire de l'ancienne Union soviétique. De 1987 à 1995, il a œuvré pour l’Organisation internationale du travail, le HCR puis auprès du Haut Commissaire des Nations Unies aux droits de la personne en dirigeant principalement des enquêtes au sujet de graves violations de droits de la personne en Iraq, en Afghanistan et en Birmanie\/Myanmar. L’expertise du professeur Packer en matière de pratique du droit international et des relations internationales sous-tend sa vision de la recherche appliquée et la résolution de problèmes dans le domaine de la politique publique internationale et des conflits internes. Son enseignement, sa formation, ses recherches et ses publications, de même que son travail à la défense des droits, ont contribué au développement du domaine en plein essor qu’est la médiation de paix au niveau international.",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Charles-Maxime Panaccio",
    "title":"Professeur agrégé",
    "email":"Charles-Maxime.Panaccio@uottawa.ca",
    "href":"https:\/\/www.uottawa.ca\/faculte-droit\/droit-civil\/corps-professoral\/panaccio-charles-maxime",
    "bio":"Charles-Maxime Panaccio est diplômé des universités McGill (B.C.L., L.L.B. 1999), d'Oxford (B.C.L. 2003) et de Toronto (S.J.D. 2008). Il a été clerc auprès du juge Charles D. Gonthier de la Cour suprême du Canada. Il s'intéresse à la protection constitutionnelle des droits fondamentaux, à la philosophie du droit, à l'éthique des avocats et des juges et au droit de la preuve.",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Julie Paquin",
    "title":"Professeure agrégée",
    "email":"jpaqui4@uottawa.ca",
    "href":"https:\/\/uniweb.uottawa.ca\/members\/409\/profile",
    "bio":null,
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Muriel Paradelle",
    "title":"Professeure agrégée",
    "email":"Murielle.Paradelle@uOttawa.ca",
    "href":"https:\/\/www.uottawa.ca\/faculte-droit\/droit-civil\/corps-professoral\/paradelle-muriel",
    "bio":"Publications et Communications Monographies \"Des usages d'un répertoire normatif en politique étrangère. La place et le rôle de la shar'îa islamique (loi islamique) dans la pratique internationale des Etats musulmans\", thèse de troisième cycle. \"L'institution du muftî et de sa fatwâ dans le droit islamique\", mémoire pour l'obtention du DEA en sciences politiques. \"La sorcellerie comme vision du monde (XVè-XVIIè siècle)\", Compte rendu d'ouvrages, IEP d'Aix-en-Provence, IREMAM. Chapitres de livres « Les études féministes sur les bancs d’une faculté de droit : Entre gageure et nécessité »; dans Louise Langevin (dir.), Rapports sociaux de sexe\/genre et droit : Repenser le droit, Paris, Éditions des Archives contemporaines, 2008 (à paraître); \"The notion of 'Person' between Law and Practice : A Study of the Principles of Personal Responsability and the Personal Nature of Punishment in Egyptian Criminal Law\", dans Baudouin Dupret (ed.), Standing Trial. Law and the Person in the Modern Middle East, London, New York, I.B. Tauris, 2004, 319-349. \" Le Tribunal pénal international pour le Rwanda et la réconciliation après le génocide rwandais de 1994 \", dans \" La voie canadienne vers la Cour pénale internationale : Tous les chemins mènent à Rome \", Les Journées Maximilien Caron 2003, Montréal, Les Éditions Thémis, 2004, 315-326. \" Du déterminisme du milieu. La notion de culpabilité dans la tradition juridique inuit \", Actes des XXèmes Journées d'Histoire du Droit consacrées à la Culpabilité, Cahiers de l'Institut d'Anthropologie juridique, 2001, n° 6, 127-158. \"Legal pluralism and international law. An analysis on the International Convention on the Rights of the Child\", dans Baudoin Dupret, Mauritz Berger, Laïla al-Zwaini (eds), Legal pluralism in the Arab world, Kluwer Law International, The Hague, London, 1999, 16 p. Articles publiés dans des revues avec comité de lecture « Le récit judiciaire de l’anéantissement : La force des mots du droit pour transmettre le génocide »; R evue Tangente (à paraître); \"L'emprunt à la culture, un atout dans le jugement du crime de génocide ? Étude à partir des juridictions traditionnelles gacaca saisies du génocide des Tutsis du Rwanda\"; Criminologie, 2006, vol. 39\/2, 97-135. \"Quelle justice pour quelle réconciliation ? Le Tribunal pénal international pour le Rwanda et le jugement du génocide\", Revue de droit de McGill, juin 2005, vol. 50, 359-413. \"Actes du Congrès international du Cinquantenaire du Code civil égyptien (1948-1998)\", Note de lecture, L'Annuaire de l'Afrique du Nord, 1999. \"Analyse d'un paradoxe : le nouvel ordre mondial entre globalisation et fragmentation\", Revue de l'Institut égyptien des Juristes francophones, 1999. \"Conversation entre le Conseiller Tarîq al-Bishrî et le journal al-Sha'b\", (traduction à partir d'un article en arabe), Revue Egypte-Monde arabe, n° 34, 2ème trimestre 1998, p. 215-235. Contributions majeures sur invitation et\/ou rapports techniques Enquête de terrain et travaux de recherche portant sur les usages des plantes chez les Naskapis de Kawawachikamach : Article : \" De la transmission des savoirs à la diffusion de connaissances. Impacts et enjeux d'un changement de paradigmes \" ; mai 2004, 36 p. Ouvrage pédagogique : \" Des usages des plantes chez les Naskapis de Kawawachikamach \" ; mai 2004, 50 p. Enquête de terrain et travaux de recherche portant sur les Naskapis de Kawawachikamach et le caribou : Ouvrage pédagogique : \" Les Naskapis et le caribou \" ; mai 2004, 50 p. Contribution à la rédaction des rapports présentant les profils socio-économiques de différentes communautés autochtones, destinés au ministère Développement économique Canada : C. LÉVESQUES, M. PARADELLE et autres; Enjeux économiques et développement communautaire. Étude de cas à Waskaganish; Institut national de la Recherche scientifique, Montréal, 2005; C. LÉVESQUES, M. PARADELLE et autres, Enjeux économiques et développement communautaire. Étude de cas à Kawawachikamach; Institut national de la Recherche scientifique, Montréal, 2004; C. LÉVESQUES, M. PARADELLE et autres; Enjeux économiques et développement communautaire. Étude de cas à Matimekush\/Lac John; Institut national de la Recherche scientifique, Montréal, 2004; C. LÉVESQUES, M. PARADELLE et autres; Enjeux économiques et développement communautaire. Étude de cas à Salluit; Institut national de la Recherche scientifique, Montréal, 2004; C. LÉVESQUES, M. PARADELLE et autres; Enjeux économiques et développement communautaire. Étude de cas à Aupaluk Institut national de la Recherche scientifique, Montréal, 2004; C. LÉVESQUES, M. PARADELLE et autres; Enjeux économiques et développement communautaire. Étude de cas à Kujjuarapik; Institut national de la Recherche scientifique, Montréal, 2004; Rédactrice de la chronique de science politique de la revue Egypte-Monde arabe : Revue publiée par le Centre de Recherche et de Documentation du Caire (CEDEJ). Fonctions assumées de janvier 1995 à janvier 1999. \"Les juridictions traditionnelles rwandaises gacaca et le jugement du génocide : Des difficultés à se réapproprier la justice après la commission d'un tel crime\", Intervention au séminaire du Centre de Recherche en Droit Public (CRDP), Université de Montréal, 4 mai 2004. \"La place de la victime dans le jugement du génocide rwandais (TPIR et juridictions gacaca\", Intervention dans le cadre du cours de droit pénal avancé de Mme Hélène Dumont, Université de Montréal, 23 mars 2004. \"Le Tribunal pénal international pour le Rwanda et la réconciliation après le génocide rwandais de 1994\", Colloque \"La voie canadienne vers la Cour pénale internationale : Tous les chemins mènent à Rome\", Les Journées Maximilien Caron 2003, 1er et 2 mai 2003. \"Le Tribunal pénal international pour le Rwanda et les juridictions traditionnelles Gacaca : Le jugement du génocide en partage\", Intervention dans le cadre du cours de droit pénal de Mme Anne-Marie Boisvert, Université de Montréal, 27 mars 2003. \"Entre droit et sociologie du droit : Étude de la Cour de Justice itinérante du district de l'Abitibi-Témiscamingue\", Intervention au séminaire du Centre International de Criminologie Comparée, Université de Montréal, le 18 avril 2001. \"Les Autochtones et la justice pénale\", Intervention au séminaire du Centre de Recherche en Droit public (CRDP), Université de Montréal, 12 février 2001. \"Justice blanche \/ justice autochtone. Analyse d'un face à face normatif à partir de l'étude du concept de culpabilité\", XXèmes Journées d'Histoire du Droit organisées à Limoges par l'Institut d'Anthropologie de Limoges de la Faculté de Droit et des Sciences économiques, les 4, 5 et 6 octobre 2000. \"Nul n'est responsable qu'à raison de son fait personnel. Le principe de la personnalité des peines en droit pénal égyptien entre règle et pratique\", Table ronde sur le thème de \" La personnalité juridique \" organisée au Caire en novembre 1999 par la Communauté européenne. \"Analyse d'un paradoxe : le nouvel ordre mondial entre globalisation et fragmentation\", Table ronde sur le thème du \"Nouvel ordre mondial à l'aube du XXIème siècle\", organisée par l'Institut égyptien des juristes francophones, 29 mars 1998 au Caire.",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Mona Paré",
    "title":"Professeure titulaire",
    "email":"mona.pare@uottawa.ca",
    "href":"https:\/\/uniweb.uottawa.ca\/members\/4768\/profile",
    "bio":"Mona Paré's research interests include children's rights and the rights of persons with disabilities, as well as the implementation of international law in domestic law. Her current projects focus on children's access to justice and children as human rights defenders. Other projects have addressed children's rights in the context of education, the right to education for children with disabilities, violence in schools and the sexual rights of persons with disabilities.&nbsp;",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Benoît Pelletier",
    "title":"Professeur titulaire",
    "email":"Benoit.Pelletier@uOttawa.ca",
    "href":"https:\/\/www.uottawa.ca\/faculte-droit\/droit-civil\/corps-professoral\/pelletier-benoit",
    "bio":"Admis au Barreau du Québec en 1982, Benoît Pelletier a d’abord pratiqué le droit au sein du contentieux des affaires civiles et du droit immobilier du ministère de la Justice du Canada (de 1983 à 1989) et des Services juridiques du Service correctionnel du Canada (en 1989 et 1990), à Ottawa. C’est en 1990 qu’il s’est joint au corps professoral de la Faculté de droit de l’Université d’Ottawa, dont il fait encore partie et où il assume en ce moment la fonction de professeur titulaire. Benoît Pelletier a aussi assumé la fonction de doyen adjoint à cette faculté de droit de 1996 à 1998. Pendant dix ans, Benoît Pelletier a représenté la circonscription de Chapleau à l’Assemblée nationale du Québec. Il a été ministre du gouvernement du Québec pendant près de six ans. À ce titre, il a été notamment responsable des Affaires intergouvernementales canadiennes, de la Francophonie canadienne, des Affaires autochtones et de la Réforme des institutions démocratiques. Détenteur d’un baccalauréat en droit de l’Université Laval, Benoît Pelletier détient aussi une maîtrise en droit de l’Université d’Ottawa et deux doctorats en droit, l’un de l’Université de Paris I (Panthéon-Sorbonne), l’autre de l’Université Aix-Marseille. Il détient de plus un doctorat honoris causa en droit de l’Université de Moncton. En 1989, Benoît Pelletier a obtenu la Médaille du Barreau de Paris, à titre de meilleur étudiant des programmes des Études supérieures en droit de l’Université d’Ottawa. En 1998, il s’est vu décerner le Prix d’excellence en enseignement de l’Université d’Ottawa. En 2011, il a reçu la médaille Gloire de l’Escolle à titre de Grand diplômé de l’Université Laval et le Barreau du Québec lui a décerné le titre d’Avocat émérite. En 2012, il a été le récipiendaire du Mérite du Barreau de l’Outaouais. Il est officier de l'Ordre national du Québec depuis 2014. Il a été élu membre à titre spécial de la Société Royale du Canada en 2015. En 2016, il a été élu membre de l’Ordre du Canada. Au cours des ans, il s’est vu attribuer de nombreux autres prix et distinctions. Benoît Pelletier est l’auteur de nombreuses publications à caractère scientifique. Il a aussi prononcé de nombreuses conférences au Canada et à l’étranger. Il a été reçu comme professeur invité par les universités de Nantes, de Corse, de Paris II, de Paris V et de Lyon III. Il a aussi été reçu à deux reprises, soit en 2007 et en 2009, à titre de Public Policy Scholar par le Woodrow Wilson International Center for Scholars de Washington. En 2016, il a été reçu comme professeur invité par l'Université Queen's et par l'Université Cornell.",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Jennifer Quaid",
    "title":"Professeure agrégée et vice-doyenne à la recherche",
    "email":"Jennifer.Quaid@uottawa.ca",
    "href":"https:\/\/www.uottawa.ca\/faculte-droit\/droit-civil\/corps-professoral\/Quaid-Jennifer",
    "bio":"Jennifer Quaid est professeure agrégée et vice-doyenne à la recherche à la Section de droit civil. Elle est une experte reconnue du droit pénal des entreprises, la gestion responsable et les pratiques commerciales éthiques. Ses activités savantes et ses interventions publiques s’inscrivent dans la poursuite d’un programme de recherche axé sur l’étude de la perpétration d’infractions criminelles et réglementaires par des entreprises dans le cours normal de leurs activités commerciales (telles la corruption, la fraude et le défaut de protéger la sécurité des travailleurs et l’environnement) et ce, dans le but d’élaborer des mesures juridiques et politiques favorisant une saine gestion des risques et l’adoption de pratiques d’affaires éthiques. Ses recherches interdisciplinaires, qui marient le droit pénal à des approches tirées du domaine des études des organisations, portent sur le rôle que joue les entreprises dans la création des conditions propices à la perpétration d’infractions criminelles et réglementaires. Ses projets actuels étudient l’opportunité de favoriser la réhabilitation des entreprises par l'entremise d'un processus d'imposition de la peine qui préconise le changement de culture et la consultation des parties prenantes. Elle est également interpellée par les questions liées à la lutte contre la corruption et l'adoption du nouveau régime canadien d’accords de réparation. À l'extérieur du droit pénal des entreprises, la professeure Quaid s'intéresse au droit pénal général, le droit régissant les agressions sexuelles, l'imposition de la peine ainsi qu'aux divers aspects du droit des affaires, notamment le droit de la concurrence, les mesures anti-corruption et la gouvernance d’entreprise. Membre du Barreau du Québec, de l’Ontario and de l’État de New York, la professeure Quaid a exercé la profession d’avocate pendant de nombreuses années, d’abord au Ministère de la Justice fédéral et ensuite en pratique privée au sein d’un cabinet new-yorkais. Elle a été auxiliaire juridique auprès de l’honorable Frank Iacobucci à la Cour suprême du Canada. La prof. Quaid est membre de Transparency International Canada et siège à son comité juridique. Elle était membre du Bureau des gouverneurs de l'Université de 2018 à 2021.",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"David Robitaille",
    "title":"Vice-doyen aux études et professeur titulaire",
    "email":"david.robitaille@uottawa.ca",
    "href":"https:\/\/www.uottawa.ca\/faculte-droit\/droit-civil\/corps-professoral\/david-robitaille",
    "bio":"David Robitaille est professeur titulaire à la Section de droit civil de l’Université d’Ottawa. Il y enseigne et mène des recherches en droit constitutionnel et administratif, droit municipal, droit de l’environnement et droits et libertés depuis 2005. Ses recherches et publications récentes, subventionnées notamment par le Conseil de recherches en sciences humaines du Canada (CRSH), portent sur le partage des compétences fédérales-provinciales-municipales en matière d’aménagement du territoire, d’environnement, de transport et de droits et libertés de la personne. Il a reçu de nombreux prix et bourses, dont le prix du Concours d’essai juridique de l’Association canadienne des professeur·e·s de droit en 2012 (avec la professeure Sophie Thériault). Sa thèse de doctorat s’est méritée, en 2008, la Médaille d’or de la Gouverneure générale du Canada, le Prix d’excellence de l’Association québécoise des professeur·e·s de droit et la Médaille du Barreau de Paris. Certaines de ses publications ont été citées avec approbation par les tribunaux, dont la Cour suprême du Canada, la Cour d’appel du Québec, la Cour supérieure du Québec, la Cour du Québec et le Tribunal des droits de la personne du Québec. Le professeur Robitaille est engagé dans la collectivité. Il agit comme procureur pro bono dans des dossiers d’intérêt public en droit constitutionnel de l’environnement. Il a plaidé au nom du Centre québécois du droit de l'environnement (CQDE), intervenant devant la Cour suprême du Canada dans Canada (Procureur général) c. Alberta (Procureur général), CSC 40195, au soutien de la validité constitutionnelle de la Loi sur l'évaluation d'impact, adoptée en 2019 et renforçant le processus fédéral d'évaluation des impacts environnementaux des grands projets de développement. Il a également plaidé pour le CQDE et Équiterre devant la Cour suprême dans les Renvois relatifs à la Loi sur la tarification de la pollution causée par les gaz à effet de serre, 2021 CSC 11 et devant la Cour d'appel de l'Ontario dans le même dossier (Reference re Greenhouse Gas Pollution Pricing Act, 2019 ONCA 544). Il représentait aussi le CQDE devant la Cour d’appel fédérale dans Groupe Maison Candiac Inc. c. Canada (Procureur général), 2020 CAF 88, portant sur la protection de l’habitat essentiel de la rainette faux-grillon, une espèce menacée, ainsi que dans Procureure générale du Québec c. IMTT-Québec Inc., 2019 QCCA 1598 mettant en cause l’applicabilité de la Loi sur la qualité de l’environnement du Québec au Port de Québec. Il a aussi plaidé devant la Cour supérieure (avec Me Jean-François Girard, avocat principal au dossier) dans l'affaire Gastem c. Ristigouche, à la défense d'une municipalité gaspésienne de 168 citoyens, ayant fait face à une poursuite abusive en dommages et intérêts de 1,5 million de dollars après avoir adopté un règlement visant la protection des sources d’eau potable. Le professeur Robitaille pratique aussi comme avocat-conseil au sein du cabinet DHC Avocats de Montréal. Il y conseille les avocat·e·s et municipalités sur divers enjeux de droit public auxquels ces dernières font face. Il siège également comme avocat-conseil au Comité juridique du CQDE depuis 2014, a siégé au CA du CQDE de 2014 à 2018, et a été membre de la Commission consultative de l’environnement et du développement durable de la ville de Gatineau de 2015 à 2017. Il a siégé plusieurs années au Conseil de la Section de droit civil, au Comité du personnel enseignant de la Section de droit civil ainsi que sur le Comité d’embauches professorales. Il a également été directeur de la Revue générale de droit (2012-2014), Président de l’Association des professeur·e·s de droit du Québec (2012) et clerc auprès de l’Honorable François Pelletier de la Cour d’appel du Québec (2002-2003).",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Terry Skolnik",
    "title":"Professeur agrégé",
    "email":"tskolnik@uottawa.ca",
    "href":"https:\/\/uniweb.uottawa.ca\/members\/4305\/profile",
    "bio":"Terry Skolnik is an associate professor (tenured) at the University of Ottawa's Faculty of Civil Law and Co-Director of the uOttawa Public Law Centre. He is currently a visiting research fellow at the Academy for Justice and the Center for Constitutional Design at the Sandra Day O'Connor College of Law at Arizona State University.&nbsp;<div><br><\/div><div>His primary research interests are criminal law and procedure, policing, property law, legal philosophy, poverty law, and law and behavioural economics.&nbsp;<\/div><div><br><\/div><div>He co-directed the Faculty's Mental Health and Well-Being Committee, and was a member of the University of Ottawa's Mental Health and Wellness Advisory Committee. He was a visiting research fellow at Tel Aviv University's Faculty of Law (2021) and was an affiliated scholar at NYU's Center for Human Rights and Global Justice (2018-2019).&nbsp;<div><div><br><\/div><div>He was awarded the faculty's&nbsp;distinguished teaching prize for&nbsp;2020-2021.&nbsp;&nbsp;<div><br><\/div><div>Prior to joining the Faculty, he served as a law clerk for the Honourable Justice Russell Brown at the Supreme Court of Canada. Prior to academia, he worked as a police officer with the Montreal Police Service.&nbsp;<\/div><div><br><\/div><div>Terry Skolnik completed the S.J.D. at the University of Toronto's Faculty of Law as a SSHRC Joseph-Armand Bombardier doctoral research fellow and as a FRQSC doctoral research fellow. He is a graduate of the University of Cambridge (L.L.M.) where he studied as a Commonwealth Trust Scholar and the University of Ottawa, Faculty of Law (L.L.L., summa cum laude).<\/div><div><br><b><a href=\"https:\/\/drive.google.com\/file\/d\/1SqlB0nZXaucgAa7VkqZ3slSRxEvW9WiZ\/view?usp=share_link\">Click here to access his&nbsp;CV and list of publications&nbsp; &nbsp;<\/a><\/b><\/div><\/div><\/div><\/div>",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Marie-Eve Sylvestre",
    "title":"Doyenne, professeure titulaire",
    "email":"Marie-Eve.Sylvestre@uottawa.ca",
    "href":"https:\/\/www.uottawa.ca\/faculte-droit\/droit-civil\/corps-professoral\/Sylvestre-Marie-Eve",
    "bio":"Marie-Eve Sylvestre est doyenne et professeure titulaire à la Section de droit civil de la Faculté de droit de l’Université d’Ottawa. Elle est titulaire d’un baccalauréat en droit de l’Université de Montréal (LL.B. 1999 : Médaille d’or de la Faculté) et d’une maîtrise et d’un doctorat de l’Université Harvard (LL.M. 2002, S.J.D. 2007) où elle était boursière de la Fondation Frank Knox Memorial. De 2000 à 2001, elle a été auxiliaire juridique auprès du juge Charles D. Gonthier de la Cour suprême du Canada.Ses travaux de recherche portent sur le système de justice pénale et en particulier, sur les effets discriminatoires de certaines pratiques policières et judiciaires et règles de droit sur les personnes pauvres et marginalisées. Elle s'intéresse aussi aux mesures de rechange à la criminalisation, notamment en contexte autochtone, ainsi qu’à la régulation des personnes qui utilisent les espaces publics. Elle est l'auteure de nombreuses publications en droit, criminologie et géographie. Son dernier livre, Red Zones: Criminal Law and the Territorial Governance of Marginalized People, co-rédigé avec Nicholas Blomley et Céline Bellot et publié par Cambridge University Press, a remporté le Prix W. Wesley Pue 2021 de l’Association canadienne droit et société. De 2018 à 2019, elle a été titulaire de la Chaire de recherche de l’Université d’Ottawa sur le droit, les politiques pénales et la régulation des personnes marginalisées.De 2017 à 2019, la doyenne Sylvestre a agi à titre d’experte en matière de justice auprès de la Commission d’enquête sur les relations entre les Autochtones et certains services publics au Québec: écoute, réconciliation, progrès (CERP). Elle est membre fondatrice de l’Observatoire sur les profilages et en 2022, elle a agi comme experte pour le demandeur dans l’affaire Luamba c. PG Québec portant sur les interceptions routières et le profilage racial au Québec.Tout au long de sa carrière, la doyenne Sylvestre s’est méritée plusieurs prix et distinctions. En 2011, elle a remporté le prix du meilleur essai juridique décerné par l’Association des professeurs de droit du Canada pour un article portant sur la responsabilité pénale des personnes pauvres et publié dans la Revue de droit de McGill, ainsi que le Prix du manuscrit juridique de la Fondation du Barreau du Québec pour un article publié dans la Revue canadienne droit et société sur les parcours judiciaires des personnes en situation d’itinérance. En 2012, elle a été la première professeure de droit à remporter le prix Jeune chercheuse de l’année de l’Université d’Ottawa dans la catégorie arts, humanités et sciences sociales. Elle est membre du Collège des nouveaux chercheurs et créateurs en arts et en science de la Société royale du Canada depuis 2018. En 2022, elle a reçu la distinction d’avocate émérite du Barreau du Québec et le Mérite du Barreau de l’Outaouais en 2023.La doyenne Sylvestre est co-présidente du Comité permanent sur la liberté académique de l’Université d’Ottawa. Elle siège au Conseil des gouverneurs de l’Institut national de la magistrature et au Conseil d’administration du Conseil de recherche en sciences humaines du Canada.",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Sophie Thériault",
    "title":"Professeure titulaire",
    "email":"Sophie.Theriault@uOttawa.ca",
    "href":"https:\/\/www.uottawa.ca\/faculte-droit\/droit-civil\/corps-professoral\/theriault-sophie",
    "bio":"Sophie Thériault est professeure titulaire et vice-doyenne aux études à la Faculté de droit (Section droit civil) de l’Université d’Ottawa. Elle est aussi membre du Barreau du Québec (2003). La professeure Thériault détient un doctorat de l’Université Laval (LL.D. 2009), aux fins duquel elle s’est méritée une bourse doctorale de la Fondation Pierre Elliott Trudeau. Elle a été chercheure invitée à l’Université de Washington à Seattle (2004-2005) et à l’Université de Victoria (2005-2007). De 2015 à 2017, elle a été vice-doyenne aux études supérieures en droit à l'Université d'Ottawa. Elle a également été auxiliaire juridique auprès de l’Honorable Louis LeBel à la Cour suprême du Canada en 2002-2003. Les recherches de la Professeure Thériault portent sur les droits des peuples autochtones dans le contexte de l’extraction des ressources naturelles; sur la gouvernance environnementale par les peuples autochtones; sur la justice et les droits environnementaux; et sur la sécurité et la souveraineté alimentaires pour les peuples autochtones. En 2012, elle fut récipiendaire du prix pour le meilleur essai juridique de l’Association canadienne des professeurs de droit (ACPD) pour son article intitulé « Les droits environnementaux dans la Charte des droits et libertés de la personne du Québec: Pistes de réflexion », publié avec le professeur David Robitaille dans la Revue de droit de McGill. La professeure Thériault est membre du Centre interuniversitaire d’études et de recherches autochtones (CIÉRA, Université Laval), du Centre du droit de l’environnement et du développement durable (Université d’Ottawa), du Centre de recherche et d’enseignement sur les droits de la personne (Université d’Ottawa), et de la Chaire de recherche en droit sur la diversité et la sécurité alimentaires (détenue par la Professeure Geneviève Parent de l’Université Laval). Elle est aussi membre du Comité de rédaction de la Revue canadienne Droit et Société. La professeure Thériault est disposée à diriger des travaux de recherche à la maîtrise et au doctorat dans les domaines suivants: Droit et peuples autochtones; Droit de l'environnement et du développement durable; Justice environnementale et droit; Gouvernance du territoire et des ressources naturelles.",
    "listed_research_areas":null
  },
  {
    "faculty":"uottawa-civil",
    "name":"Joao Velloso",
    "title":"Professeur agrégé",
    "email":"joao.velloso@uottawa.ca",
    "href":"https:\/\/www.uottawa.ca\/faculte-droit\/common-law\/corps-professoral\/velloso-joao",
    "bio":"Joao Velloso enseigne le droit des peines et des sanctions, la criminologie appliquée au droit pénal, les études sociojuridiques et la méthodologie de la recherche juridique. Il a une formation multidisciplinaire en droit, criminologie, sociologie et anthropologie. Ses recherches empiriques portent sur la judiciarisation des problèmes sociaux et la gouvernance de la sécurité à partir de différents régimes juridiques, plus particulièrement l’utilisation des régimes administratifs superposés à la justice criminelle. Ses recherches antérieures portent sur les réponses juridiques à l'esclavage par dette au Brésil, le contrôle de l’immigration au Canada et la pénalisation des manifestants pendant le Sommet du G20 à Toronto (2010) et pendant la grève étudiante québécoise de 2012. Il coordonne actuellement une recherche sur la sévérité de la peine et l'expulsion au Canada (CRSH, 2018-2022) et il participe à plusieurs projets dans des réseaux de recherches au Canada et en Amerique latine: - Accès au Droit et Accès à la Justice (ADAJ, www.adaj.ca), Partenariat CRSH (2016-2022), plus particulièrement sur l’Accès à la justice en détention et sur les Attentes sociales et conscience du droit; - Institut d’études comparées en administration institutionnelle des conflits (INCT-InEAC, www.ineac.uff.br, 2016-2024), l’un des rares Instituts nationaux de sciences et technologies (INCT) en sciences humaines et sociales au Brésil et le siège social d’un solide réseau de recherche multidisciplinaire réunissant des chercheurs au Brésil, Argentine, Canada, États-Unis, France, Portugal et Afrique du Sud en matière de police, de justice criminelle et d’études des conflits; - Partenariat canadien pour la justice internationale (https:\/\/cpij-pcji.ca\/), Partenariat CRSH (2016-2022); - Observatoire Violence, criminalisation et démocratie en Amerique Latine (http:\/\/ovcd.org\/), CRSH (2018-2023), plus particulièrement sur le Brésil; - Réseau pour la réduction des méfaits d'Ottawa (www.lessharm.ca), 2018-2021), notamment sur la réglementation du cannabis; - Observatoire sur les profilages (https:\/\/profilages.info\/), Partenariat CRSH (2020-2028), notamment en matière carcérale et en immigration. - le Prison Transparency Project (https:\/\/carleton.ca\/prisontransparencyproject\/)",
    "listed_research_areas":null
  }
]