[
  {
    "faculty":"western",
    "name":"Bassem Awad",
    "title":"Assistant Professor",
    "email":"bawad4@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/bassem_awad.html",
    "bio":"Bassem Awad Academic Degrees: PhD (University of Montpellier), LLM (Sorbonne University), LLB (Alexandria University) Email: bawad4@uwo.ca Phone: 519-661-2111 x80089 Office: LB 120C Dr. Bassem Awad is an Assistant Professor and Director of the Area of Concentration in Intellectual Property, Information and Technology at the Faculty of Law. He is also a Head Tutor and Professor at the Academy of the World Intellectual Property Organization (WIPO) in Geneva. Prior to joining Western, Bassem was the Deputy Director of Intellectual Property Law and Innovation at the Centre for International Governance Innovation (CIGI) and served for several years as a Judge and Head of Court at the Appeal Courts of Egypt and Abu Dhabi in the United Arab Emirates. Dr. Awad has remarkable experience in intellectual property law, technology, and innovation policies. He is a member of the inaugural IDRC’s College of Reviewers on Technology and Innovation - Networked Economies program and was recently nominated as a member of the African Union Taskforce on intellectual property rights. His primary research interests are in the area of governance of intellectual property rights in the data-driven economy, with a focus on the impact of disruptive technologies (e.g. artificial intelligence, machine learning and big data) on intellectual property and privacy norms. He also studies the legal frameworks of open and collaborative mechanisms innovation (patent pledges), intellectual property in preferential trade agreements, and the management of intellectual property rights (IP strategy and commercialization). Dr. Awad earned his Ph.D. and LL.M degrees in Law from the University of Montpellier and the Sorbonne University, in France. He conducted his post-doctoral research studies in the Faculty of Law at Western University. He has taught and worked in both common and civil law systems and conducted research projects for international and regional organizations in Africa, Europe and Canada. He is a member of the International Association for the Advancement of Teaching and Research in Intellectual Property (ATRIP) and the Editorial International Committee of Revue “Cahiers de Propriété Intellectuelle.” At Western Law, Bassem teaches courses on Intellectual Property Law, International Intellectual Property, and Law and Disruptive Technologies. Over the past 10 years, he has taught and developed several course curricula for Distance Learning (DL) in the field of Intellectual Property Law. Research Highlights Bassem Awad and Marsha Cadogan, “The future of Geographical Indications Protection under the CETA”, (2017) CIGI Papers Series.“Patent Pledges in Green Technology” in Jorge Contreras et al. (eds.), Patent pledges Global Perspectives on Patent Law’s Private Ordering Frontier (Edward Elgar Publication, 2017) at 82-101. NAFTA 2.0 and Intellectual Property Rights: Insights on Developing Canada’s Knowledge Economy in Bassem Awad (eds), (2017) CIGI Publications. Bassem Awad, “Global Patent Pledges: A collaborative Mechanism for Climate Change Technology”, (2015) CIGI Papers Series 81. Bassem Awad, “Copyright flexibilities in the Arab world”, (2012) WIPO-WTO Publications at 41-55. “Strategy for green energy technologies innovation” in Jeremy de Beer, Chris Armstrong, Chidi Oguamanam & Tobias Schonwetter (eds.), Innovation and intellectual property: collaborative dynamics in Africa (University of Cape Town press, 2013) at 273-288. Bassem is seeking graduate students in the following areas: Law and Technology (e.g. artificial intelligence, data governance), comparative and international intellectual property. Research areas: Law and Technology; Patent Law; Copyright Law; Comparative and International Intellectual Property",
    "listed_research_areas":"Law and Technology; Patent Law; Copyright Law; Comparative and International Intellectual Property"
  },
  {
    "faculty":"western",
    "name":"Andrew Botterell",
    "title":"Associate Professor (On Leave)",
    "email":"andrew.botterell@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/andrew_botterell.html",
    "bio":"Andrew Botterell Academic Degrees: B.A.(Hons.)(McGill), Ph.D.(MIT), J.D.(University of Toronto) Email: abottere@uwo.ca Phone: 519 661-2111 ext. 87864 Office: LB 235 Andrew Botterell joined Western in 2007. A former Supreme Court of Canada clerk, he was named “Professor of the Year” at Western Law in 2013-14, and received the Faculty’s Award for Teaching Excellence in 2017-18. He Chaired Western’s Department of Philosophy from 2016-19 and currently serves as Editor of the Canadian Journal of Law and Jurisprudence. His legal teaching and research interests are primarily in the philosophy of law, criminal law, and private law, and his work has appeared in Legal Theory, Law & Philosophy, Criminal Justice Ethics, the Osgoode Hall Law Journal, and the Alberta Law Review, among other places. In 2019, Andrew became Western Law's Associate Dean (Research & Graduate Studies). Seeking graduate students in the following areas: Philosophy of Law, Criminal Law, Tort\/Property\/Restitution Selected Research Highlights \"Licensing Parents in International Contract Pregnancies\" (with C. McLeod), Journal of Applied Philosophy 33:2 (2016): 178-196. \"Rights, Loss, and Compensation in the Law of Torts,\" 69 Supreme Court Law Review (2d) (2015): 135-164. \"Not For the Faint of Heart: Assessing the Status Quo on Adoption and Parental Licensing\" (with C. McLeod), in F. Baylis and C. McLeod, eds., Family Making: Contemporary Ethical Challenges (Oxford: OUP, 2014): 151-167. \"Understanding the Voluntary Act Principle,\" in F. Tanguay-Renaud and J. Stribopoulos, eds., Rethinking Criminal Law Theory (Oxford: Hart Publishing, 2012): 97-115. \"Contractual Performance, Corrective Justice, and Disgorgement for Breach of Contract,\" Legal Theory 16:3 (2010): 135-160. \"Normativity, Fairness, and the Problem of Factual Uncertainty\" (with C. Essert), Osgoode Hall Law Journal 47:4 (2010): 663-693. \"A Primer on the Distinction between Justification and Excuse,\" Philosophy Compass 4 (2009): 172-196. \"In Defence of Infringement,\" Law and Philosophy 27 (2008): 269-292. \"Why We Ought to be (Reasonable) Subjectivists about Justification,\" Criminal Justice Ethics 26 (2007): 36-58. \"Property, Corrective Justice, and the Nature of the Cause of Action in Unjust Enrichment,\" Canadian Journal of Law & Jurisprudence 20 (2007): 275-296. Research areas: Private Law; Criminal Law; Philosophy of Law",
    "listed_research_areas":"Private Law; Criminal Law; Philosophy of Law"
  },
  {
    "faculty":"western",
    "name":"Colin Campbell",
    "title":"Associate Professor (Limited-Term)",
    "email":"ccampb64@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/colin_campbell.html",
    "bio":"Colin Campbell Academic Degrees: B.A. (University of Toronto) 1966; Ph.D. (University of Toronto) 1975; M.Sc. (London School of Economics and Political Science) 1967; LL.B. (University of Western Ontario) 1980; Called to the Bar of Ontario 1982. Email: ccampb64@uwo.ca Phone: 519 661-2111 ext. 88414 Office: LB 113 Colin Campbell began his teaching career at Mount Allison University in Sackville, New Brunswick as assistant professor of political science before taking his law degree at Western. Following his call to the bar, he practised as a tax partner in the Toronto firm Davies Ward Phillips & Vineberg LLP. His practice included tax planning for both corporations and individuals and representing taxpayers before the Tax Court and the Federal court of Appeal. Between 1999 and 2009 he taught at Western Law as an adjunct professor. In 2011, Colin began teaching at Western on a full-time basis as associate professor. Colin has written extensively on both tax planning and tax administration and has a particular interest in tax history. Since 2016 he has been the chair of the Canada Revenue Agency’s Offshore Compliance Advisory Committee. The first volume of his (co-authored with Robert Raizenne) three volume history of Canadian income tax, A History of Canadian Income Tax. Volume 1: The Income War Tax Act 1917-1948 was published jointly by the Osgoode Society for Canadian Legal History and the Canadian Tax Foundation in 2022. Research Highlights Books (with Robert Raizenne) A History of Canadian Income Tax. Volume I: The Income War Tax Act 1917-1948, Toronto: Osgoode Society for Canadian Legal History and Canadian Tax Foundation, 2022 Administration of Income Tax 2022, Toronto: Thomson Reuters, 2022. Timing and Income Taxation, second edition, with Brian Arnold et al., Toronto: Canadian Tax Foundation, 2015 Taxation of Corporate Reorganizations (with R. Juneja and P. Lamarre), third edition, Toronto: Carswell, 2019 Political Parties and Ideologies in Canada, (with W.E. Christian), Toronto: McGraw-Hill Ryerson (first edition, 1974; second edition, 1982; third edition, 1990). Parties, Leaders and Ideologies in Canada, (with W.E. Christian) Toronto: McGraw-Hill Ryerson, 1996.Canadian Political Facts 1945-76, Toronto: Methuen, 1977. Political Ideologies and the Democratic Ideal, (with T. Ball, R. Dagger & W.E. Christian), third Canadian edition, Toronto: Pearson, 2013. Articles \"Political Parties and Ideologies in Canada\", (with W.E. Christian), in Gagnon and Tanguay (eds.), Canadian Parties in Transition, Nelson, Toronto, 1988 at pp. 45-63. \"The Ideological Tradition in Canadian Politics\", (with W.E. Christian), in Paul Fox and Graham White (eds.) Politics: Canada, 7th edition, Toronto, 1991 at pp. 286-196. \"Populism and the Canadian Ideological Tradition\", (with W.E. Christian), in Paul Fox and Graham White (eds.) Politics: Canada, 8th edition, Toronto, 1995. \"William Jones\", Biographical Dictionary of Modern British Radicals, Vol. 1, Harvester Press, 1978. \"Transfer Pricing Between Members of an International Corporate Group: A Canadian Perspective\" (with D.A. Ward), International Business Law Journal, 1994:2, at pp. 256-259. \"Directors and Officers Liability under the Income Tax Act and Other Taxing Statutes\", paper presented to Canadian Institute Conference, June 1995. \"Back to the Future: Is it Time to Put Revenue Canada Into Commission?\" (with M.Y. Berry), Canadian Tax Journal (1995), 43:6, pp. 1901-1915. \"Concerning the Proposed Federal Court – Tax Court Merger\", Canadian Tax Journal (1998), 46:1, pp. 228-232. \"The Proposed Canada Customs and Revenue Agency\", (with M.Y. Berry), Canadian Tax Journal (1998), 46:3, pp. 575-588. \"The Future of Canadian Economic Nationalism\", British Journal of Canadian Studies 1998 13:1, pp. 97-111. \"Application of the Charter to Civil Penalties in the Income Tax Act\", Canadian Tax Journal 2002, 50:1, pp. 1-27. \"Budget Surplus, Democratic Deficit\", Canadian Tax Journal (2002) 50:6, pp. 2029-2037. \"Catch 22: A Principled Basis for the Settlement of Tax Appeals\" (with D. Sandler), Canadian Tax Journal (2009) 57:4, pp. 762-786. “Liability for The Tax on SIFT Partnerships: A Rejoinder”, Canadian Tax Journal (2011) 59:4, pp. 709-29. “Access to Justice in Tax Appeals”, University of New Brunswick Law Journal (2012), vol. 63, pp. 445-458 “J.L. Ilsley and the Transformation of the Canadian Tax System: 1939-1943”, Canadian Tax Journal (2013), vol. 61:3, pp. 633-670 “Taxation of Non-Residents”, chapter IV in United Nations Department of Social and Economic Affairs, Handbook on Selected Issues in Administration of Double Tax Treaties for Developing Countries, New York: United Nations, 2013, pp. 174-191 “J.L. Ilsley and the transition to the Post-War Tax System: 1943-1946”, Canadian Tax Journal (2015), vol. 63:1, pp. 1-52 “The 1917 Income War Tax Act: Origins and Enactment”, (with Robert Raizenne), presented to Symposium on the Centenary of the Income Tax Act, May, 2016, published in Income Tax at 100 Years, Toronto, Canadian Tax Foundation, 2017, pp. 2:1 to 2:96 Research areas: Income Taxation; International Tax; Corporate Law",
    "listed_research_areas":"Income Taxation; International Tax; Corporate Law"
  },
  {
    "faculty":"western",
    "name":"Chi Carmody",
    "title":"Associate Professor",
    "email":"ccarmody@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/chi_carmody.html",
    "bio":"Chi Carmody Academic Degrees: LL.B. (Ottawa), LL.M. (Michigan), S.J.D. (Georgetown), member of the Bars of Ontario and New York, Associate Professor. Email: ccarmody@uwo.ca Phone: 519 661-2111 ext. 88437 Office: LB 106 Chi Carmody has taught at the University of Western Ontario Faculty of Law since 1999, where he teaches courses in public international law, international trade law and international business transactions. He also serves as Canadian Director of the Canada-United States Law Institute. He has been a visiting professor at Georgetown University Law Center and an Emile Noël Fellow at the Jean Monnet Center for Regional and International Economic Law & Justice, NYU Law School. Chi Charmody is currently on leave. Recent Publications Chios Carmody, “Law and Reform of the International Economic System”, 4:1 Journal of Parliamentary and Political Law 113-120 (2010) Chios Carmody, “The Duty to Settle in WTO Dispute Settlement” 5:2 Asian Journal of WTO & International Health Law & Policy 1-33 (2010) Chios Carmody, “Modes of Reasoning in WTO Law” 11:2 Manchester Journal of International Economic Law 182-200 (2014) Chios Carmody, “Theory and Theoretical Approaches to WTO Law” 13:2 Manchester J. Int’l Econ. Law 152-185 (September 2016) Chios Carmody, “Obligations versus Rights: Substantive Difference between WTO and International Investment Law” 12 Asian J. for WTO & World Health Law 75-104 (March 2017) Chios Carmody, “Small Changes in Big Times: The WTO’s Informal Mechanism on Procedural Innovation” 25:1 International Trade Law & Regulation 26-45 (2019) Chios Carmody, “A Guide to Emissions Trading under the Western Climate Initiative” 43 Canada U.S. Law Journal 146-277 (June 2019) Chios Carmody, Book Review of Gilbert Gagné, The Trade and Culture Debate, International Journal of Cultural Policy (forthcoming 2019) Books Edited Chios Carmody (ed.), Is Our House in Order? Canada’s Implementation of International Law (McGill-Queen’s University Press, 2010) Chios Carmody et al. (eds), Global Justice and International Economic Law: Opportunities and Prospects (Cambridge University Press, 2012) Chapters in Books Chi Carmody, “Introduction” in Chi Carmody (ed.), Is Our House in Order? Canada’s Implementation of International Law 3-24 (McGill-Queen’s University Press 2010) Chi Carmody, “Canada’s Implementation of the WTO Agreement: a retrospect”, in Chi Carmody (ed.), Is Our House in Order? Canada’s Implementation of International Law 140-173 (McGill-Queen’s University Press 2010) Chios Carmody, Frank Garcia & John Linarelli, “Conclusion: an Agenda for Research and Action” in Chios Carmody et al. (eds), Global Justice and International Economic Law: Opportunities and Prospects 287-295 (Cambridge University Press, 2012) Chios Carmody, “Fairness as Appropriateness: Some Reflections on Procedural Fairness in WTO Law” in Armin Savarian & Filippo Fontanelli (eds.), Procedural Fairness in International Courts and Tribunals 277-292 (British Institute for International and Comparative Law, 2015) Chios Carmody, “Interdependence and the WTO Agreement as a ‘Contractual Constitution’” in Julien Chaisse & Tsai-Yu Lin (eds), The Shape of Future International Economic Governance: Essays in Honour of Mitsui Matsushita 462-474 (Cambridge University Press, 2015) Chios Carmody, “Interdependence and WTO Law”, Ch. 8 in Antonio Segura Serrano (ed.), The Reform of International Economic Governance 142-156 (Ashgate, 2015) Chios Carmody, “Legitimate Expectations” and International Economic Law”, Ch. 5 in Gillian Moon & Lisa Toohey (eds), The Future of International Economic Integration: the Embedded Liberalism Compromise Revisited 55-78 (Cambridge University Press, 2018) Chios Carmody, “Procedural Aspects of WTO Law” in Joanna Gomula & Stefan Wittich (eds), Research Handbook on International Law __ (Edward Elgar, forthcoming, 2020) Research areas: Public International Law; International Trade Law; Legal Theory and International Organizations",
    "listed_research_areas":"Public International Law; International Trade Law; Legal Theory and International Organizations"
  },
  {
    "faculty":"western",
    "name":"Erika Chamberlain",
    "title":"Professor, Dean (On Leave)",
    "email":"echambe@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/erika_chamberlain.html",
    "bio":"Erika Chamberlain Academic Degrees: LLB (Dist), University of Western Ontario, 2001;PhD, University of Cambridge, 2009 Email: echambe@uwo.ca Phone: 519 661-2111 x80036 Office: LB 231 Erika Chamberlain was appointed Dean of Law in May 2017, following five years as Associate Dean (Academic). She graduated as gold medalist from Western Law in 2001 and first joined the Faculty in 2005. Prior to her appointment, she served as law clerk to Mr. Justice Major at the Supreme Court of Canada, and was called to the Bar of Ontario in 2002. She obtained her doctorate from the University of Cambridge, where she held a Cambridge Commonwealth Scholarship, SSHRC Doctoral Fellowship, and the WM Tapp Studentship at Gonville and Caius College. Chamberlain has authored numerous articles on tort law, with a particular focus on the tort liability of public authorities. She is the author of Misfeasance in a Public Office (2016), co-author of Fridman’s The Law of Torts in Canada, 4th ed. (2020) and Cases and Materials on the Law of Torts, 10th ed. (2019), and a co-editor of Emerging Issues in Tort Law (2007) and Tort Law: Challenging Orthodoxy (2013). Professor Chamberlain is a founding member of Western’s Tort Law Research Group and was a co-organizer of the Sixth Biennial Conference on the Law of Obligations in 2012. In 2019, she became the General Editor of the Canadian Cases on the Law of Torts. Chamberlain has also published extensively in the field of impaired driving law and alcohol-related civil liability, and has provided research and advocacy to MADD Canada since 1999. Her work in this field has been cited by the Supreme Court of Canada, and has influenced legislative amendments at the federal level and in several Canadian provinces and territories. Chamberlain has twice been named “Professor of the Year” by the Student Legal Society, and has been named to the USC Teaching Honour Roll three times. She is currently the Chair of the Ontario Law Deans group, and is a member of the Ontario Universities Council on Quality Assurance. She has also completed 5 full Ironman races. Seeking graduate students in the following areas: Torts Research Highlights E. Chamberlain & S.G.A. Pitel, General Editors, Fridman’s The Law of Torts in Canada, 4th ed (Toronto: Carswell, 2020) (co-authors: A. Botterell, E. Chamberlain, M. McInnes, J. Neyers, S.G.A. Pitel & Z. Sinel). E. Chamberlain, Misfeasance in a Public Office (Toronto: Carswell, 2016). E. Chamberlain, “Affirmative Duties of Care: A Distinctly Canadian Contribution to the Law of Torts” (2018) 84 Supreme Court Law Review (2d) 101. E. Chamberlain, “Clarifying and Enforcing the Fiduciary Obligations of University Boards of Governors” (2017) 26:2 Education & Law Journal 181. E. Chamberlain, “Snooping: How Should Damages be Assessed for Harmless Breaches of Privacy?” in Barker, Fairweather & Grantham, eds, Private Law in the 21st Century (Oxford: Hart Publishing, 2017). E. Chamberlain, “To Serve and Protect Whom? Proximity in Cases of Police Failure to Protect” (2016) 53:4 Alberta Law Review 977. E. Chamberlain, \"Lord Buckmaster: The Reluctant Villain in Donoghue v Stevenson\" (2013) 3 Juridical Review 245. E. Chamberlain, “Lord Atkin’s Opinion in Donoghue v Stevenson: Perspectives from Biblical Hermeneutics” (2010) 4 Law and Humanities 91. E. Chamberlain, \"Negligent Investigation: A New Remedy for the Wrongly Accused: Hill v. Hamilton-Wentworth Regional Police Services Board\" (2008) 45 Alberta Law Review 1089. E. Chamberlain & R. Solomon, \"Minimizing Impairment-related Youth Traffic Details: The Need for Comprehensive Provincial Action\" (2008) 99 Canadian Journal of Public Health 267. E. Chamberlain & R. Solomon, \"The Tooth Fairy, Santa Claus and the Hard Core Drinking Driver\" (2001) 7 Injury Prevention 272. Research areas: Torts; Trusts; Public Authority Liability; Misfeasance in a Public Office; Impaired Driving Law",
    "listed_research_areas":"Torts; Trusts; Public Authority Liability; Misfeasance in a Public Office; Impaired Driving Law"
  },
  {
    "faculty":"western",
    "name":"Michael Coyle",
    "title":"Associate Professor (On Sabbatical Leave)",
    "email":"mcoyle@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/michael_coyle.html",
    "bio":"Michael Coyle Academic Degrees: LLB (Western University) 1982, LLM (Osgoode) 1998. Member of the Bar of Ontario. Email: mcoyle@uwo.ca Phone: 519 661-2111 ext. 88453 Office: LB 106 Professor Coyle joined the Faculty of Law in 2000. His primary research interests relate to aboriginal rights and dispute resolution theory. In 2004 he was commissioned by the Ipperwash Inquiry to write its background research paper on Aboriginal land claims and treaty rights in Ontario. In the past four years he has been invited twice by the Senate Standing Committee on Aboriginal Peoples to present submissions to the Committee on land claims reform. In 2005, together with a group of academics from across the country, he received a five-year SSHRC grant to investigate the negotiation of Aboriginal governance. He has been the recipient of a UWO international research grant to investigate the role of power relations in indigenous dispute resolution, and in 2008 he was named the first MacCormick Fellow by the University of Edinburgh Law School. In 2011 Michael received a three-year SSHRC research grant to investigate the legal paradigms that might be applied to govern the modern implementation of historical treaties. In 2017 he received another SSHRC grant to synthesise the published literature on the revitalization of Indigenous legal orders in Canada. Professor Coyle has published many articles on the status of treaties and systemic issues relating to the negotiated settlement of Indigenous rights claims. Along with John Borrows, he is the co-editor of The Right Relationship: Reimagining the Implementation of Historical Treaties (U of T Press, 2017). Research Highlights \"E Pluribus Plures: Legal Pluralism and the Recognition of Indigenous Legal Orders”, in Paul Schiff Berman, ed., The Oxford Handbook of Global Legal Pluralism (Oxford: Oxford University Press, 2020). “Shifting the Focus: Viewing Indigenous Consent Not as a Snapshot But as a Feature Film”, (2020) 27 International Journal on Minority and Group Rights 357. “La responsabilité sociale des entreprises, les autochtones, et la voie de la médiation: le chemin de traverse” (Corporate Social Responsibility, Indigenous Peoples and Mediation: The Path Less Followed) in V. Mercier et S. Brunengo-Basso, eds., RSE et Mediation: Regard Croisé - France-Canada, (Aix-en-Provence: PUAM 2018). “Rethinking The Transformative Potential of the Truth and Reconciliation Commission: A Skeptic’s Perspective” (2018) 95 Canadian Bar Review 767-794. “Recognizing Indigenous Legal Orders: Their Content, Embeddedness in Distinct Indigenous Cultures, and Implications for Reconciliation”, SSHRC Knowledge Synthesis Report, September 11, 2017. The Right Relationship: Reimagining the Implementation of Historical Treaties, John Borrows and Michael Coyle, eds. (University of Toronto Press, 2017). This publication, and the collaborative scholarly workshops that produced it, were funded by my SSHRC Standard Research Grant, as described below. “As Long As The Sun Shines… Recognizing That Treaties Were Intended To Last”, and (with J. Borrows) “Introduction – Reconciling Treaty Perspectives: Historical, Relational and Legal”, in The Right Relationship, above. “From Consultation to Consent: Squaring the Circle?” (2016) 67 UNBLJ 235. “Negotiating Indigenous Peoples’ Exit From Colonialism: Are Interest-Based Strategies The Right Approach?” (2014) 27 Canadian Journal of Law and Jurisprudence 283-303 (Special Issue: “Discourse across the Indigenous\/Non-Indigenous Divide”). \"Transcending Colonialism? Power and the Resolution of Indigenous Treaty Claims in Canada and New Zealand\" (2011) 24 (4) New Zealand Univ. Law Rev. 596. “Establishing Indigenous Governance: The Challenge of Confronting Mainstream Cultural Norms”, in G. Otis & M. Papillon (eds), The Relational Dimension of Indigenous Governance and Federalism: Theories and Practices, (Ottawa: Ottawa University Press, 2011). “Les effets du pouvoir dans les négoçiations sur la gouvernance autochtone”, in L. Côté (dir.) La gouvernance: frontières, dispositifs et agents (Québec: Presses de l’Université du Québec, 2011). “The Idols of the Cave: Re-imagining the Protection of Indigenous Knowledge and Expression”, (2010) 26:1 Canadian Intellectual Property Review 3. “Power and the Resolution of Indigenous Land Rights” in K. Basselman, R. Engel and L.Westra, eds., Democracy, Ecological Integrity and International Law (Newcastle: Cambridge Scholars, 2010) 131. Research areas: Alternative Dispute Resolution; Aboriginal Law; Contracts",
    "listed_research_areas":"Alternative Dispute Resolution; Aboriginal Law; Contracts"
  },
  {
    "faculty":"western",
    "name":"Gillian Demeyere",
    "title":"Associate Professor",
    "email":"gdemeyer@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/gillian_demeyere.html",
    "bio":"Gillian Demeyere Academic Degrees: B.A. (Western University), LL.B. (Western University), M.A. (Western University), LL.M. (Toronto), S.J.D. (Toronto) Email: gdemeyer@uwo.ca Phone: 519 661-2111, ext 81242 Office: LB 109 Professor Demeyere teaches in the areas of Contract Law, Labour and Employment Law, Human Rights, Social Justice, and Gender and the Law. Her primary area of research is Human Rights in Employment. She has published articles on workplace sexual harassment, the employer’s duty to accommodate, the contract of employment, and the theoretical structure of the right to equality. Professor Demeyere previously held the Daryl T. Bean Professorship in Law & Women’s Studies and is a current member of the Labour Law Casebook Group. Research Highlights “The Contract of Employment at the Supreme Court of Canada: Employee Protection and the Presumption of Employer Freedom” (2015), 38(1) Dalhousie Law Journal 1. “Human Rights as Contract Rights: Rethinking the Employer’s Duty to Accommodate” (2010), 10(2) Queen’s Law Journal 299. “Discrimination, Freedom, and the Limits of Contract” (2010), 10(4) International Journal of Discrimination and the Law 219. “Discrimination in Employment by Religious Organizations: Exemptions, Defences, and the Lockean Conception of Toleration” (2010), 15(3) Canadian Labour and Employment Law Journal 435. \"Common Law Actions for Sexual Harassment: The Jurisdiction Question Revisited\" (2005), 8 Queen's Law Journal 637. Research areas: Contract Law; Employment Law; Human Rights; Feminist Legal Theory",
    "listed_research_areas":"Contract Law; Employment Law; Human Rights; Feminist Legal Theory"
  },
  {
    "faculty":"western",
    "name":"Francesco Ducci",
    "title":"Assistant Professor",
    "email":"fducci@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/francesco_ducci.html",
    "bio":"Francesco Ducci Academic Degrees: SJD and LLM (Toronto); LLB (Bologna) Email: fducci@uwo.ca Phone: LB 100C Office: 519-661-2111 x88407 Francesco Ducci joined the Faculty of Law in 2021 as an Assistant Professor. His research focuses on competition\/antitrust law and policy, economic and social regulation, international trade law, and law and economics. His recent book Natural Monopolies in Digital Platform Markets (Cambridge University Press, 2020) uses an economic framework to investigate the nature of market power in big tech sectors and the role of competition policy and regulation in digital markets. Francesco's research has also appeared in several leading journals including the Journal of Competition Law and Economics, the Journal of Antitrust Enforcement, the European Journal of Law and Economics and the Canadian Business Law Journal. In 2022, he was awarded the Best Junior Paper Award by ASCOLA (Academic Society for Competition Law) for his work Randomized Access to Digital Bottlenecks. Francesco holds his SJD and LLM from the University of Toronto, where he was a Junior Fellow at Massey College. He also holds a law degree from the University of Bologna, Italy and was a visitor at King’s College London. Prior to Western, he was a Hauser Global Fellow at New York University and a Max Weber Fellow at the European University Institute. He currently serves as an Associated Editor for the Journal of Competition Law and Economics (Oxford University Press). Research Highlights Books Natural Monopolies in Digital Platform Markets (Cambridge University Press, 2020) Peer-Reviewed Papers Out-of-Market Efficiencies, Two-Sided Platforms and Consumer Welfare: A Legal and Economic Analysis (2016) 12(3) Journal of Competition Law and Economics 591. Procedural Implications of Market Definition in Platform Cases (2019) Journal of Antitrust Enforcement. Cartel Criminalization in Europe: Addressing Deterrence and Institutional Challenges (2018) 51:1 Vanderbilt Journal of Transnational Law 1. The Revival of Fairness Discourse in Competition Policy (2019) 64 Antitrust Bulletin 79 (with Michael Trebilcock). The Google Search Case in Europe: Tying and The Fallacy of the Single Monopoly Profit Theorem in Two-Sided Markets (2019) 47(1) European Journal of Law and Economics 15 (with Edward Iacobucci) Competition Law and Policy Issues in the Sharing Economy (2018) in Derek McKee, Finn Makela, and Teresa Scassa, eds. Law and the \"Sharing Economy\": Regulating Online Market Platforms (Ottawa: University of Ottawa Press, 2018). The Evolution of Canadian Competition Policy: A Retrospective (2018) 60:2 Canadian Business Law Journal 171 (with Michael Trebilcock). Regulating Financial Planners and Advisors: In Search of Regulatory Principles (2020) Canadian Business Law Journal (with Michael Trebilcock and Anita Anand). Research areas: Competition \/ Antitrust Law and Policy; Economic and Social Regulation; International Trade Law; and Law and Economics",
    "listed_research_areas":"Competition \/ Antitrust Law and Policy; Economic and Social Regulation; International Trade Law; and Law and Economics"
  },
  {
    "faculty":"western",
    "name":"Jennifer Farrell",
    "title":"Assistant Professor",
    "email":"jfarre9@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/jennifer_farrell.html",
    "bio":"Jennifer Farrell Email: jfarre9@uwo.ca Phone: 519-661-2111 x83337 Office: LB 117 LLB, LLM, PhD (Lond.) called to the Bar of Ontario. Dr. Jennifer Farrell is an Assistant Professor in the Faculty of Law and an Associate Research Fellow at the Tax Administration Research Centre (TARC) at the University of Exeter Business School. In 2017-18, Jennifer was named “Professor of the Year” by the Student Legal Society. Jennifer completed her doctoral research at Queen Mary, University of London, and an LLM in Tax at King's College London. Her doctoral research won the International Fiscal Association’s Mitchell B. Carroll prize presented at the Association’s 65th Congress. Her book The Interface of International Trade Law and Taxation was published by the IBFD (2013). Prior to joining Western, Jennifer held a Marie Skłodowska-Curie Fellowship in International Taxation at the Institute for Austrian and International Tax Law, Vienna University of Economics and Business, and she has previously held research positions at Exeter Business School and the University of London, England. Her research interests look at the intersection of tax laws and cross-border taxation with other fields such as trade laws and technology (e.g., blockchain and cryptocurrencies). She is an active member of the Canadian Tax Foundation and International Fiscal Association. She teaches Income Taxation and International Tax Law. Research Highlights Jennifer E. Farrell, The Interface of International Trade Law and Taxation (2013, IBFD) Research areas: Income Tax; International Tax; International Trade; Cryptocurrencies and Blockchain",
    "listed_research_areas":"Income Tax; International Tax; International Trade; Cryptocurrencies and Blockchain"
  },
  {
    "faculty":"western",
    "name":"Rory Gillis",
    "title":"Assistant Professor (On Leave)",
    "email":"rory.gillis@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/rory_gillis.html",
    "bio":"Rory Gillis Academic Degrees: BA (Yale); JD (Yale); SJD (Toronto) Email: rory.gillis@uwo.ca Phone: 519-661-2111 x86598 Office: LB 23 Rory Gillis joined the Faculty of Law as an Assistant Professor in 2021. His research focuses on tax law, tax policy, and federalism. Prior to joining Western, Rory was a Visiting Assistant Professor at the University of Toronto. He received his SJD from the University of Toronto, and his BA (summa cum laude) and JD from Yale University, where he was a Senior Editor of the Yale Law Journal. Following law school, Rory served as a law clerk to Justice Morris Fish of the Supreme Court of Canada and practiced law in Toronto. Research Highlights Books Canadian Income Tax Law, 7th ed (Toronto: LexisNexis, 2023) (with David Duff, Geoffrey Loomer and Bradley Bryan) Articles “Rethinking the Division of Tax Room and Revenue in Fiscal Federalism” (2023) 73:2 University of Toronto Law Journal (forthcoming) “The Limits of Legal Substance: Tax Avoidance and Equitable Remedies after Collins Family Trust” (2022) 66:3 Canadian Business Law Journal (323-337) “Federalism and Interprovincial Infrastructure Disputes in Canada” (2022) 55:1 UBC Law Review (1-50) \"Carbon Tax Shifts and the Revenue-Neutrality Dilemma\" (2019) 23 Florida Tax Review 293-348 \"Contracting for Tax Room: The Law and Political Economy of Tax-Point Transfers\"> (2019) 67 Canadian Tax Journal 903-945 Research areas: Tax Law; Tax Policy; and Federalism",
    "listed_research_areas":"Tax Law; Tax Policy; and Federalism"
  },
  {
    "faculty":"western",
    "name":"Randal Graham",
    "title":"Professor; Goodmans LLP Faculty Fellow in Legal Ethics",
    "email":"randal@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/randal_graham.html",
    "bio":"Randal Graham Academic Degrees: Goodmans LLP Fellow in Legal Ethics; LL.B. (Osgoode Hall) 1995, PhD (Osgoode Hall) 1999, called to the Bar of Ontario in 1997. Email: randal@uwo.ca Phone: 519 661-2111 ext. 88445 Office: LB 103 Website: randalgraham.com Professor Graham was appointed to the Faculty of Law in 2002. In 2005, Dr. Graham was awarded the title of \"Faculty Scholar\" by the University of Western Ontario in recognition of the widespread international impact of his research. He is the first Western Law professor to earn that title. Professor Graham teaches an extraordinarily broad range of subjects. He has taught courses in Statutory Interpretation, Legal Ethics, Criminal Law, Evidence, Administrative Law, Taxation, Corporate Law, Law & Economics, Legal Rhetoric, Legal Drafting, Advocacy and Graduate Research. He has supervised graduate theses in areas ranging from Interpretive Theory to toll roads in Brazil. As a result of his efforts in the classroom, Professor Graham has won the title “Professor of the Year” (both at Western and at Osgoode Hall Law School), as well as the Edward G Pleva Award for Excellence in teaching, Western University’s highest award for teaching In addition to serving on Western’s Faculty of Law, Dr. Graham has been an Assistant Professor at the University of New Brunswick (2000-2002), an Adjunct Professor at Osgoode Hall Law School (1996-2004), an Affiliated Scholar with Goodmans, LLP (1998-2000); a Commercial Lawyer at Goodmans, LLP (1997-1998); a Law Clerk to Mr. Justice Sopinka of the Supreme Court of Canada (1995-1996); and an Editorial Assistant to Justice Sopinka in connection with \"The Law of Evidence in Canada\" (1996-1997). Dr. Graham continues to act as a litigation strategist and technical consultant in matters dealing with his primary research areas, Statutory Interpretation and Legal Ethics. Dr. Graham is the author of several books and articles on the topics of statutory interpretation and ethics. His most recent research efforts focus on law and literature, and on the use of narrative structures to analyze legal theory and philosophy. He has pursued this project through the publication of a series of fantasy novels, including “Beforelife” (ECW Press, 2017) and “Afterlife Crisis” (ECW Press, 2020). Both of these novels were top ten finalists for the Stephen Leacock Medal for Humour, and Beforelife was awarded the Independent Publisher’s Gold Medal for Fantasy Fiction. The third novel in the series will be released in 2022. Professor Graham’s work has been cited at all levels of court, including the Supreme Court of Canada. Research Highlights Books “Nether Regions” (Toronto: ECW Press, 2022) “Afterlife Crisis” (Toronto: ECW Press, 2020) “Beforelife” (Toronto: ECW Press, 2017) Legal Ethics, 3rd Edition (Toronto: Emond, 2014; 2nd edition 2011; 1st edition 2004) Statutory Interpretation: Cases, Texts and Materials (Toronto: Emond, 2002). Statutory Interpretation: Theory and Practice (Toronto: Emond, 2001). Articles The Myth of Originalism (appearing in Interpretatio Non Cessat, Yvon Blais, 2011). Evolutionary Analysis: The Impact of Interpretive Theory (2010) 34 Man. LJ 1, 143. \"What Judges Want: Judicial Self-Interest and Statutory Interpretation\" (2009) Statute Law Review 30(1) 38 -72, Oxford University Press. Right Theory, Wrong Reasons (2006) 34 SCLR (2d) 1. In Defence of Ethinomics (2005) 8:1 Legal Ethics 160. Morality v. Markets (2005) 8:1 Legal Ethics 87. Research areas: Statutory interpretation; Legislation; Legal Ethics; Legal Theory",
    "listed_research_areas":"Statutory interpretation; Legislation; Legal Ethics; Legal Theory"
  },
  {
    "faculty":"western",
    "name":"Claire Houston",
    "title":"Assistant Professor",
    "email":"claire.houston@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/claire_houston.html",
    "bio":"Claire Houston Academic Degrees: B.A. (Hons.) (Trent University)LL.B. (Queen’s University)LL.M. (Harvard Law School) (waived)S.J.D. (Harvard Law School) Email: claire.houston@uwo.ca Phone: 519 661-2111 ext. 88405 Office: LB 22 Claire Houston joined Western Law in 2018. Her primary research interests include family law, children’s law, feminist legal theory, and criminal law, with a particular focus on state regulation of the family. Claire is currently leading a study looking at the impact of the Covid 19 pandemic on the family justice system in Ontario, which is being funded by the Law Foundation of Ontario. She is also the 2021 recipient of the Dean’s Research Fellowship for her project on spousal support for men. In 2019, Claire was awarded a Social Sciences and Humanities Research Council (SSHRC) Explore Grant for her project, “Respecting and Protecting Trans and Gender Non-Conforming Children in Canada’s Family Courts.” Claire’s work has appeared in the Canadian Journal of Family Law, the Michigan Journal of Gender and Law, and the Family Court Review. She is co-editor (with Mary-Jo Maur and Nicholas Bala) of the casebook Family Law: Text, Cases, Materials & Notes, 10th Edition. Claire’s awards and distinctions include the SSHRC Doctoral Fellowship, the Byse Teaching Fellowship (Harvard Law School), the Julius B. Richmond Fellowship (Center on the Developing Child, Harvard University) and the Harvard University Certificate of Distinction in Teaching. Claire articled at the Ontario Office of the Children’s Lawyer before clerking for justices of the Ontario Court of Appeal. She was called to the Bar of Ontario in 2008. Research Highlights Claire Houston, “Social Parenthood in Canada” in Clare Huntington, Courtney Joslin and Christiane von Bary, Social Parenthood in Comparative Perspective (NYU Press, forthcoming). Claire Houston, Rachel Birnbaum & Nicholas Bala, “Moving Towards a Post-Pandemic ’New Normal’: Perspectives of Ontario Family Justice Professionals and Self-Represented Litigants” (2022) 41 CFLQ 1. Claire Houston, “Case Annotation: A v A” (2022) 81 CCLT (4th) 130. Claire Houston, Rachel Birnbaum, Nicholas Bala & Kate Deveau, “Ontario Family Justice in ‘Lockdown’: Early Pandemic Cases and Professional Experience” (2022) 60:2 Fam. Ct. Rev. 241. Claire Houston, “Respecting and Protecting Transgender and Gender-Nonconforming Children in Family Courts” (2020) 33:1 Can. J. Fam. L. 103. Claire Houston, “Case Comment: Undermining Children’s Rights in A.M. v. C.H.” (2020) 39 C.F.L.Q. 99. Claire Houston, “Case Comment: M (Children), Re” (2018) 7 R.F.L. (8th) 95. Claire Houston, “The Trouble with Feminist Advocacy Around Child Victims of Domestic Violence” (2018) 39 Women’s Rts. L. Rep. 85. Claire Houston, “Whatever Happened to the Child Maltreatment Revolution?” (2017) 19 Geo. J. Gender & L. 1. Claire Houston, Nicholas Bala & Michael Saini, “Crossover Cases of High-Conflict Families Involving Child Protection Services: Ontario Research Findings and Suggestions for Good Practices” (2017) 55 Fam. Ct. Rev. 362. Claire Houston & Nicholas Bala, Article 12 of the Convention on the Rights of the Child and Children’s Participatory Rights in Canada (Department of Justice, 2015). Claire Houston, “How Feminist Theory Became (Criminal) Law: Tracing the Path to Mandatory Criminal Interventions in Domestic Violence Cases” (2014) 21 Mich. J. Gender & L. 217 (excerpted in Nancy K.D. Lemon, Domestic Violence Law, 5th ed., 2018). Claire Houston, “Case Comment: Manitoba (Director of Child & Family Services) v C. (A.)” (2009) 65 R.F.L. 397. Research areas: Family Law; Children's Law; and Feminist Legal Theory",
    "listed_research_areas":"Family Law; Children's Law; and Feminist Legal Theory"
  },
  {
    "faculty":"western",
    "name":"Shimelis Kene",
    "title":"Assistant Professor (Limited-Term)",
    "email":"skene@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/shimelis_kene.html",
    "bio":"Shimelis Kene Academic Degrees: LL.B (Addis Ababa University), LL.M (Hons.) (Northwestern University), Doctor of Civil Law (DCL) (McGill University) Email: skene@uwo.ca Phone: 519 661-2111 ext. 88598 Office: LB 100B Shimelis Kene holds a Doctor of Civil Law (DCL) from McGill University, where he studied as an O’Brien Fellow; an LL.M from Northwestern University, where he was a recipient of Fellowship for International Legal Studies awarded by Northwestern Center for International Human Rights, and an LL.B from Addis Ababa University (Ethiopia). Prior to joining Western, Shimelis was a Visiting Fellow at the McGill Centre for Human Rights and Legal Pluralism. Shimelis regularly speaks at local and international conferences on topics related to his areas of research. More recently, he spoke at a conference jointly organized by Northwestern University Buffett Institute for Global Affairs, Harvard University Center for Human Rights, and Addis Ababa University that explored a potentially viable future social contract for Ethiopia. His ongoing research uses a sociolegal approach to examine the role of international law in the North-South encounter. His areas of research interests include, public international law, international human rights, international criminal law, Third World Approaches to International Law (TWAIL), law and society, and postcolonial theory. Previously, Shimelis worked for, among others, the United Nations Development Program (UNDP), the Human Rights Office of the United Nations Mission in Ethiopia and Eritrea (UNMEE), the United Nations Children’s Fund (UNICEF), the Ethiopian Federal First Instance Court, and the Organization for Social Justice in Ethiopia. Research Highlights Monograph: Shimelis is currently working on a monograph tentatively titled Third World Agency in Postcolonial Conditions: Africa’s War on Terror in International Law. This monograph employs a socio-legal approach to examine the role that international law played in constituting the post 9\/11 international security agenda while arguing for a more nuanced approach to international legal theorization that adequately captures the nuances involved in the North-South encounter. Articles: “Self-Alienation: Ethiopia’s Identity in Postcoloniality and its Implication for a Future Ethiopian Social Contract” (Northwestern University, forthcoming) “A “South Positive” TWAIL Approach: Agency and Instrumentalization in the Adaptation to International Law” (with Frédéric Mégret) “Towards a Theory of an Agency Model of International Law” “Third World State Agency in Postcolonial Conditions: Ethiopia and its Transformation of the War on Terror into a Project of Domination” Commentary: “Ethiopia’s War of Narratives” (Africa is a Country) https:\/\/africasacountry.com\/2020\/11\/ethiopias-war-of-narratives “The Pitfalls of Ethiopian Elites’ War of Narratives” (Addis Standard) https:\/\/addisstandard.com\/commentary-the-pitfalls-of-ethiopian-elites-war-of-narratives\/ Research areas: Public International law; International Human Rights Law; International Criminal Law; Third World Approaches to International Law (TWAIL); Law and society; Postcolonial Theory",
    "listed_research_areas":"Public International law; International Human Rights Law; International Criminal Law; Third World Approaches to International Law (TWAIL); Law and society; Postcolonial Theory"
  },
  {
    "faculty":"western",
    "name":"Rande Kostal",
    "title":"Professor",
    "email":"rwk@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/rande_kostal.html",
    "bio":"Rande Kostal Academic Degrees: LL.B. (Western University) 1981, M.A. (McMaster) 1983, Ph.D. (Oxford) 1989, called to the Bar of Ontario in 1984. Email: rwk@uwo.ca Phone: 519 661-2111 ext. 88415 Office: LB 18 A faculty member at Western since 1988, Professor Kostal teaches Legal History and Torts. Professor Kostal's research interests are focused in the field of modern Anglo-American legal history. He is the author of Law and English Railway Capitalism 1825-1875 (Oxford University Press, 1994), A Jurisprudence of Power: Victorian Empire and the Rule of Law (Oxford University Press, 2005), and a number of published writings in Legal History and Tort Law. In 2019, Harvard University Press published Professor Kostal's monograph book, Laying Down the Law: The American Legal Revolutions in Occupied Germany and Japan, awarded the 2020 Phillip Reid Prize of the American Society for Legal History. Research Highlights Historical Monographs Laying Down the Law: The American Legal Revolutions in Occupied Germany and Japan, Harvard University Press, 2019. (480 pp). {Winner, 2022 Phillip Reid Prize} A Jurisprudence of Power: Victorian Empire and the Rule of Law, Revised Paperback Edition, Oxford University Press (Clarendon), 2008. (529 pp.). A Jurisprudence of Power: Victorian Empire and the Rule of Law, Oxford University Press (Clarendon), 2005. {Honourable Mention, Wallace K. Ferguson Prize}. Law and English Railway Capitalism, 1825-1875, Revised Paperback Edition, Oxford University Press (Clarendon), 1997. (420 pp.) Law and English Railway Capitalism, 1825-1875, Oxford University Press (Clarendon), 1994. (420 pp.) {Winner of the Wallace K. Ferguson Prize} Historical Publications: Refereed Articles with Erika Chamberlain, “The Reinvention of Canadian Tort Law, 1945-1995: Jordan House as Case Study,” University of Toronto Law Journal, forthcoming, 2023. “The Alchemy of Occupation: Karl Loewenstein and the Legal Reconstruction of Nazi Germany,” Law and History Review 29:1 (2011) 1-52. “A Jurisprudence of Power: Martial Law and the Ceylon Controversy of 1848-51”, Journal of Commonwealth and Imperial Studies 28:1 (2000) 1-34. Research areas: Legal History; Torts",
    "listed_research_areas":"Legal History; Torts"
  },
  {
    "faculty":"western",
    "name":"Nadia Lambek",
    "title":"Assistant Professor",
    "email":"nlambek@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/nadia_lambek.html",
    "bio":"Nadia Lambek Academic Degrees: BA (Brown University); JD (Yale Law School) Email: nlambek@uwo.ca Phone: 519-661-2111 x87543 Office: LB 110 Nadia Lambek joined the Faculty of Law in 2021 as an Assistant Professor. Her research explores law’s constitutive role in shaping our food systems, the engagement of social movements in law making, and property law. She is also interested in critical theory, law and anthropology, and the law of work. In addition to her research, Nadia is actively engaged in developing the field of food law and policy in Canada and is a founding member and current co-chair of the Canadian Association for Food Law and Policy. She also regularly collaborates with civil society organizations on issues of food system governance, including working with the Civil Society and Indigenous Peoples’ Mechanism to the UN Committee on World Food Security. Prior to her appointment at Western Law, Nadia was a fellow at the Institute for Global Law and Policy at Harvard Law School, where she is now an Affiliate Scholar. She practiced law focusing on the promotion and protection of workers’ rights, union-side labour law, and human rights. She also served as an advisor to two United Nations Special Rapporteurs on the right to food and as an adjunct professor at Vermont Law School. Nadia is a former clerk of the Ontario Court of Appeal and co-Editor-and-Chief of the Yale Human Rights and Development Law Journal. She has a BA from Brown University, a JD from Yale Law School and is completing her SJD at the University of Toronto, where she was a SSHRC Canada Graduate Doctoral Scholar to Honour Nelson Mandela, a John Peters Humphrey Fellow, a Chancellor Jackman Graduate Fellow and a finalist for the SSHRC Impact Talent Award. Research Highlights BooksRethinking Food Systems: Structural Challenges, New Strategies and the Law (Nadia Lambek, Priscilla Claeys, Adrienna Wong & Lea Brilmayer, eds., Springer 2014) Articles Nadia Lambek, “The UN Committee on World Food Security’s Break from the Productivity Trap”, 9(3-4) Transnational Legal Theory Journal 415 (2019) Sarah Berger Richardson and Nadia Lambek, “Federalism and Fragmentation: Addressing the Possibilities of a Food Policy for Canada”, 5(3) Canadian Journal of Food Studies 28 (2018) Nadia Lambek, “A Transformational Potential: The Right to Food’s Contribution to Addressing Malnutrition”, 43 UN Standing Committee on Nutrition News 75 (2018) Nadia Lambek and Priscilla Claeys, “Institutionalizing a Fully Realized Right to Food: Progress, Limitations and Lessons Learned from Emerging Alternative Policy Models”, 40(4) Vermont Law Review 743 (2016)Stephen Moreau and Nadia Lambek, “The Record on Judicial Review: Federal Court”, 29(1) Canadian Journal of Administrative Law and Practice 71 (2016)Shaun O’Brien, Nadia Lambek and Amanda Dale, “Accounting for Deprivation: The Intersection of Sections 7 and 15 of the Charter in the Context of Marginalized Groups”, 35 National Journal of Constitutional Law 153 (2016)Nadia Lambek, “The Right to Food: Reflecting on the Past and Future Possibilities”, 2(2) Canadian Journal of Food Studies 68 (2015) Freya Kristjanson and Nadia Lambek, “Applying the Charter in Everyday Administrative Decision-Making”, 26(3) Canadian Journal of Administrative Law and Practice 195 (2013)Nadia Lambek, “Imposing IP Compliance: Trends in the USTR Special 301 Reports for India and China from 2000-2008”, 2 The Indian Journal of Intellectual Property Law 129 (2009)Book ChaptersJessica Duncan, Nadia Lambek and Priscilla Claeys, “The Committee on World Food Security: Politics Under Threat”, in Un Monde Sans Faim? Gouverner la Sécurité Alimentaire au 21e Siècle (Delphine Thivet and Antoine de Raymond, eds., 2021)Nadia Lambek, “Social Justice and the Food System”, in Canadian Food Law and Policy (McLeod-Kilmurray, H., et. al., eds., Thomson Reuters, 2019)Claire Debucquois and Nadia Lambek, “Extraterritorial Obligations of States and the Right to Food”, in Justice Beyond Borders: The Extraterritorial Reach of African Human Rights Instruments (L. Chenwi & T. Bulto, eds., Intersentia, 2018)Nadia Lambek and Claire Debucquois, “National Courts and the Right to Food”, in Encyclopedia of Food and Agricultural Ethics (Thompson, P.B., et. al., eds., Springer, 2014)Nadia Lambek, “Respecting and Protecting the Right to Food: When States Must Get Out of the Kitchen”, in Rethinking Food Systems: Structural Challenges, New Strategies and the Law, (N. Lambek, et al., eds., Springer 2014)Priscilla Claeys and Nadia Lambek, “In Search of Better Options: Food Sovereignty, the Right to Food and Legal Tools for Transforming Food Systems”, in Rethinking Food Systems: Structural Challenges, New Strategies and the Law, (N. Lambek, et al., eds., Springer 2014)Reports and Submissions Nadia Lambek, “Civil Society Report on the Use and Implementation of the Right to Food Guidelines”, for the Global Network on the Right to Food and Nutrition and the Civil Society Mechanism to the Committee on World Food Security (presented at the 45th meeting of the UN Committee on World Food Security) (2018) Nadia Lambek, “Meeting Canada’s Human Rights Obligations: Integrating the Right to Food into the National Food Policy”, submitted to Agriculture and Agro-Food Canada as part of the consultation process for the first national food policy (2017) Nadia Lambek, “National Food Policy Briefing Note: Legal Obligations on the Right to Food” (2017) Nadia Lambek and Food Secure Canada, “Briefing Note: Realize the Human Right to Food” (2017) Nadia Lambek, “Farm Workers in Ontario: How the Law Creates Insecurity for Agricultural Workers and the Importance of Building Democracy through the Food System”, in Ecological Farm Internship Report: Models, Experience & Justice (Michael Ekers & Charles Levkoe, eds., 2017) Nadia Lambek, “10 Years of the Right to Adequate Food Guidelines: Progress, Obstacles and the Way Ahead”, for the Global Network on the Right to Food and Nutrition and the Civil Society Mechanism to the Committee on World Food Security (presented at the 41st meeting of the FAO, Committee on World Food Security) (2014) Research areas: Food Law and Policy; International Law; Human Rights; Labour and Employment Law; and Legal Theory",
    "listed_research_areas":"Food Law and Policy; International Law; Human Rights; Labour and Employment Law; and Legal Theory"
  },
  {
    "faculty":"western",
    "name":"Joanna Langille",
    "title":"Assistant Professor",
    "email":"joanna.langille@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/joanna_langille.html",
    "bio":"Joanna Langille Academic Degrees: Hons BA (Toronto); MPhil (Oxford); JD (NYU); SJD (Toronto) Email: joanna.langille@uwo.ca Phone: 519-661-2111, ext. 87870 Office: LB 27 Joanna Langille joined the Faculty of Law as an Assistant Professor in 2018. Joanna’s research focuses on private international law, international trade law, private law, and legal theory. Originally from Nova Scotia, Joanna has an undergraduate degree in philosophy and political science from the University of Toronto. As a Commonwealth Scholar, she obtained an MPhil in international relations at Balliol College, University of Oxford. She received her JD from NYU Law, where she studied as a Furman Scholar and an Institute for International Law and Justice Scholar. She completed her SJD at the University of Toronto Faculty of Law as a Trudeau Scholar and a SSHRC Bombardier Scholar. Prior to her appointment at Western, Joanna was a Furman Fellow and an Institute for International Law and Justice Fellow at NYU School of Law. She has held visiting researcher positions at Yale Law School, the University of Groningen’s philosophy department, and the University of Toronto’s Munk School for Global Affairs. She has consulted for parties and authored amicus briefs in a variety of World Trade Organization and North American Free Trade Agreement disputes, and has worked with the World Trade Organization and the International Centre for Trade and Sustainable Development. Joanna clerked for the judges of the Court of Appeal for Ontario, and is licensed to practice law in New York and Ontario. Research Highlights Articles “Frontiers of Legality: Understanding the Public Policy Exception in Choice of Law” UTLJ (forthcoming 2023). “The Trade\/Labour Relationship in Light of the WTO Appellate Body’s Embrace of Pluralism” (2020) 159:4 Int’l Labour Rev 569. “Spheres of Commerce: The WTO Legal System and Regional Trading Blocs,” Symposium on International Trade Law (2018) 46 Ga J Int’l & Comp L 649 (with Robert Howse). “Pluralism in Practice: Moral Legislation and the Law of the WTO After Seals Products” (2015) 48 GW Int’l L Rev 81 (with Robert Howse and Katie Sykes). “Permitting Pluralism: The Seal Products Dispute and Why the WTO Should Permit Trade Restrictions Justified by Non-Instrumental Moral Values” (2012) 37 Yale J Int’l L 367 (with Robert Howse). “Neither Constitution nor Contract: Understanding the WTO by Examining the Legal Limits on Contracting out through Regional Trade Agreements” (2011) 86 NYU L Rev 1482. Book Chapters “Public Policy and the Rule of Law” in Ralf Michaels, Michael Green, and Roxana Banu (eds.), Philosophical Foundations of Private International Law (Oxford University Press, forthcoming 2022). “Whales and Seals and Bears, Oh My! The Evolution of Global Animal Law and Canada’s Ambiguous Stance” in Peter Sankoff, Vaughan Black, & Katie Sykes, eds., Canadian Perspectives on Animals and the Law (Toronto, ON: Irwin Law, 2015) (with Robert Howse and Katie Sykes). Research areas: Private International Law; International Trade Law; Private Law and Legal Theory",
    "listed_research_areas":"Private International Law; International Trade Law; Private Law and Legal Theory"
  },
  {
    "faculty":"western",
    "name":"Ryan Liss",
    "title":"Assistant Professor",
    "email":"rliss@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/ryan_liss.html",
    "bio":"Ryan Liss Academic Degrees: Hons. B.A. (Toronto), J.D. (Toronto), LL.M. (Yale), J.S.D. (Yale) Email: rliss@uwo.ca Phone: 519-661-2111, ext. 88434 Office: LB 13 Ryan Liss is an Assistant Professor and the Co-Director of the Public and Private International Law Research Group at Western Law. His research focuses on public international law (including international human rights law, international criminal law, and international humanitarian law) and criminal law, examining the ways in which human rights construct and constrain state power in both areas. Ryan’s work has appeared in the American Journal of International Law, the Canadian Yearbook of International Law, Michigan Journal of International Law, and NYU Journal of International Law and Politics, among other journals. His first monograph, which is currently in progress, is under contract with Oxford University Press. Ryan holds an undergraduate degree and a J.D. from the University of Toronto, and an LL.M. from Yale Law School. He received his J.S.D from Yale, where he studied as a Trudeau Scholar and a SSHRC Doctoral Fellow. Prior to joining Western, he served as an Associate-in-Law at Columbia Law School, and as a visiting fellow at the Schell Centre for International Human Rights at Yale Law School and the Centre for Ethics at the University of Toronto. He clerked for Chief Justice Warren Winkler and the justices of the Court of Appeal for Ontario, and has worked with the International Criminal Court, the International Criminal Tribunal for Rwanda, and the Coalition for the ICC. SSRN Author Page Academia.edu Profile Research Highlights Articles: “Criminal Law in a World of States” (2022) 43:2 Michigan Journal of International Law 263. \"Whose Right is It Anyway? Adjudicating Charter Rights in the Context of Multiple Rights Holders\" (2020) 94 Supreme Court Law Review (2d) 271. “Crimes Against the Sovereign Order: Rethinking International Criminal Justice” (2019) 113:4 American Journal of International Law 727. “A Right to Belong: Legal Protection of Sociological Membership in the Application of Article 12(4) of the ICCPR” (2014) 46 NYU Journal of International Law & Politics 1097. “Consent-Based Humanitarian Intervention: Giving Sovereign Responsibility Back to the Sovereign” (with Oona Hathaway et al.) (2013) 46 Cornell International Law Journal 499. “The Abuse of Ambiguity: The Uncertain Status of Omar Khadr under International Law” (2012) 50 Canadian Yearbook of International Law 95. “Responsibility Determined: Assessing the Relationship between the Doctrine of the Responsibility to Protect and the Right of Self-Determination” (2011) 4 University College London Human Rights Review 52. Book Chapters: “The Evolution of Persecution as a Crime Against Humanity” (with Helen Brady) in Morten Bergsmo et al. (eds.), Historical Origins of International Criminal Law, vol. 3, 429 (Brussels: TOAEP, 2015). Research areas: Public International Law; Criminal Law; International Criminal Law; International Human Rights Law; International Humanitarian Law",
    "listed_research_areas":"Public International Law; Criminal Law; International Criminal Law; International Human Rights Law; International Humanitarian Law"
  },
  {
    "faculty":"western",
    "name":"Carl MacArthur",
    "title":"Assistant Professor",
    "email":"cmacart3@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/carl_macarthur.html",
    "bio":"Carl MacArthur Academic Degrees: B.A. (Hons) (York University) 1996; LL.B. (Osgoode Hall) 2000; M.B.A. (Schulich School of Business) 2000; LL.M. (Osgoode Hall) 2008; called to the Bar of Ontario 2002. Email: cmacart3@uwo.ca Phone: 519 661 2111 x89288 Office: Room 114 Carl MacArthur was appointed an Assistant Professor at Western Law in July 2013. He was on faculty at the University of New Brunswick from July 2008 to 2013 where he taught Business Organizations, Corporate Finance, Personal Taxation and Corporate Taxation.Professor MacArthur is a former tax partner with the Toronto firm Davies Ward Phillips & Vineberg LLP. Selected Research Highlights Articles “Trustee Liability Under Subsection 116(5)” in Current Cases, Canadian Tax Journal, Vol. 65 No. 2, 2017, pp. 444-453. “Country by Country Reporting and Commercial Confidentiality” (co-authored with Arthur Cockfield), Canadian Tax Journal, Vol. 63, no. 3, 2015, pp. 627-660. “Is the Sale of Depreciable Property Capital or Income in Canada?”, Vol. 66, No. 7, Tax Notes International, May 14, 2012, p. 621. “CAE Inc.: Depreciable Property or Inventory?”, Canadian Tax Highlights, Volume 20, Number 3, March 2012, p. 6. “A Comment on Subsection 51(1) and the Application of Subsection 116(5)”, Vol. 15 No. 3, Taxation Law (Ontario Bar Association) 19-22 (May 2005). “Dividends — Cash or Accrual? A comment on the decision in Banner Pharmacaps NRO Ltd. v. The Queen”, Vol. 14 No. 1, Taxation Law (Ontario Bar Association) 29-33 (August 2003). Book Chapters “Legal Advice Privilege for Accountants’ Tax Advice”, in C. Hunt (ed.), Perspectives on Evidentiary Privileges (forthcoming, 2019 Thomson Reuters). Taxation of Corporate Reorganizations (Carswell, 2019) (Contributing Author, Vol. 2 – Capital Transactions). T.W. Edgar et al., Materials on Canadian Income Tax, 15th ed. (Toronto: Carswell, 2015). Contributor (with Colin Campbell), Chapter 10, “Dispute Resolution, Statutory interpretation and Tax Avoidance”, pp. 745-814. “Assessing the Fairness of Tax Avoidance: The Need to Consider Economic Substance”, in Kim Brooks, The Quest for Tax Reform Continues: The Royal Commission on Taxation Fifty Years Later (Carswell, 2013), pp. 329-51. Brown, Karen B. (Ed.), A Comparative Look at Regulation of Corporate Tax Avoidance”, (Springer, 2012), Chapter 3, “Canada”, pp. 65-105. T.W. Edgar et al., Materials on Canadian Income Tax, 14th ed. (Toronto: Carswell, 2010). Contributor (with Arthur Cockfield), Chapter 6, “Computation of Profit and Timing Principles for the Recognition of Revenue and Expense”, pp. 427-529. Research areas: Income Tax Law; Contract Law; Corporate Law and Estate Planning",
    "listed_research_areas":"Income Tax Law; Contract Law; Corporate Law and Estate Planning"
  },
  {
    "faculty":"western",
    "name":"Margaret Martin",
    "title":"Associate Professor",
    "email":"mmart2@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/margaret_martin.html",
    "bio":"Margaret Martin Academic Degrees: B.A. (Hons) (McMaster ), M.A (McMaster) , M.S.L. (University of Toronto), Ph.D (University of Cambridge) Email: mmart2@uwo.ca Phone: 519-661-2111 ext. 81568 Office: LB 20 Margaret Martin is Associate Professor at the Faculty of Law at Western University. She holds a PhD from the University of Cambridge, a MSL from the University of Toronto. She also holds a BA (Hons) in Philosophy and English Literature and MA in Philosophy, both from McMaster University. Professor Martin has held fellowships at the University of Toronto and at Corpus Christie College at the University of Cambridge. She has been an invited speaker at leading universities in the Brazil, Canada, Denmark, Italy, the United Kingdom and the United States. Professor Martin is on the editorial board for Jurisprudence, the American Journal of Jurisprudence and the Canadian Journal of Law and Jurisprudence. Her monograph, Judging Positivism, was published by Hart Publishing in 2014. She has also published in the area of criminal theory, the theory of international criminal law, and political philosophy. She teaches constitutional law, jurisprudence, and criminal theory. Margaret Martin is currently on sabbatical leave. Selected Publications “Method Matters: Non-Normative Jurisprudence and the Re-Mystification of the Law.” In Elucidating the Concept of Law: Contemporary Disputes, edited by Jorge Luis Fabra-Zamora and Gonzalo Villa. Forthcoming. Springer, 2021 (in press). “Re-visiting Raz: a Reply to my Critics.” Forthcoming. Isonomía, 2021 (in press) “Postema on Hart: the Illusion of Value-Neutrality.” In Reflections on the Work of Gerald Postema, edited by Thomas Bustamante and Thiago Decat, 193-211. Hart Publishing, 2020. “Persuade or Obey: Crito and the Preconditions for Justice.” In Contemporary Perspectives on Legal Obligations, edited by Stefano Bertea, 153-172. Rutledge, 2020. Renáta Uitz (Professor at Central European University), interview by Margaret Martin, Rafael Mafei Rabelo Queiroz, and Thomas Bustamante, November 2019, transcript [in Portuguese] available online at: https:\/\/www.quatrocincoum.com.br\/br\/noticias\/l\/a-constituicao-contra-a-ameaca-autoritaria?fbclid=IwAR09LBCTQ8cpFBc0c8EGgs3WcNw9bYs0JqvaloqJaUDa528iCvIouA3CRr8 “The International Criminal Court: The New Leviathan?” In Legal Authority Beyond the State, edited by Patrick Capps and Henrik Palmer Olsen, 237-267. Cambridge: Cambridge University Press, 2018. “Reflections on Punishment from a Global Perspective: An Exploration of Chehtman’s The Philosophical Foundations of Extraterritorial Punishment.” Criminal Law and Philosophy 8:3 (2014): 693-712. Martin, Margaret, Judging Positivism (Hart Publishing, 2014) Martin, Margaret, Raz's Morality of Freedom: Two Models of Authority, Jurisprudence 1:1, June 2010 Martin, Margaret, \"International Criminal Law: Between Utopian Dreams and Political Realities\", Rethinking Criminal Law Theory: New Canadian Perspectives in the Philosophy of Domestic (forthcoming, Hart Publishing, 2011) Research areas: Philosophy of Law; Constitutional Law; International Criminal Law and Criminal Theory",
    "listed_research_areas":"Philosophy of Law; Constitutional Law; International Criminal Law and Criminal Theory"
  },
  {
    "faculty":"western",
    "name":"Alan Miller",
    "title":"Associate Professor and Canada Research Chair, Law and Economics",
    "email":"alan.miller@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/alan_miller.html",
    "bio":"Alan Miller Academic Degrees: B.A. 1998, University of California, Berkeley. J.D. 2001, Northwestern University. M.S. 2006, California Institute of Technology. Ph.D. 2009, California Institute of Technology. Email: alan.miller@uwo.ca Phone: 519 661-2111 ext. 81567 Office: LB 29 Alan Miller recently joined Western as an Associate Professor of Law and Canada Research Chair in Law and Economics. His primary teaching interests are in corporate law and law and economics; his research has spanned several additional fields, including contract, tort, property, antitrust, patent, and election law. His work has appeared in journals in law, economics, and political science, including the New York University Law Review, the Iowa Law Review, Theoretical Economics, and the Journal of Economic Theory. In 2018, he was co-awarded the Jerry S. Cohen Award for Antitrust Scholarship for his work with Michal Gal. Currently, he serves as an associate editor of the interdisciplinary journal Mathematical Social Sciences. Seeking graduate students in the following areas: Law and Economics, Corporate Law. Curriculum vitae Personal Website: alandmiller.com Research Highlights Group Identification Group Identification, 63 GAMES AND ECONOMIC BEHAVIOR 188 (2008). A Measure of Bizarreness (with Christopher P. Chambers), 5 Quarterly Journal of Political Science 27 (2010). The Reasonable Person (with Ronen Perry), 87 New York University Law Review 323 (2012). The Tradeoff of the Commons (with R. Preston McAfee), 96 Journal of Public Economics 349 (2012). Good Faith Performance (with Ronen Perry), 98 Iowa Law Review 689 (2013). Inefficiency Measurement (with Christopher P. Chambers), 6 American Economic Journal: Microeconomics 79 (2014). Community Standards, 148 Journal of Economic Theory 2696 (2013). Scholarly Influence (with Christopher P. Chambers), 151 Journal of Economic Theory 571 (2014). Patent Challenge Clauses: A New Antitrust Offense? (with Michal Gal), 102 Iowa Law Review 1477 (2017). Benchmarking (with Christopher P. Chambers), 13 Theoretical Economics 485 (2018). Research areas: Law and Economics; Corporate Law",
    "listed_research_areas":"Law and Economics; Corporate Law"
  },
  {
    "faculty":"western",
    "name":"Jason Neyers",
    "title":"Professor (On Sabbatical Leave)",
    "email":"jneyers@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/jason_neyers.html",
    "bio":"Jason Neyers Academic Degrees: B.A. (Hon.) (Western), LL.B. (Great Distinction) (McGill), M.St (Distinction) (Oxford) Email: jneyers@uwo.ca Phone: 519-661-2111, x88435 Office: LB 26 Jason Neyers is a Professor of Law at Western University. He has published in leading law journals in Canada, the United Kingdom, Australia and Singapore and is the co-editor\/author of ten books. His work has been cited by the Supreme Courts of Canada, the United Kingdom, and New Zealand, the High Court of Australia, and numerous appellate and first instance courts across the Commonwealth. Professor Neyers has been a visiting scholar at Melbourne Law School, Sydney Law School and the Auckland University of Technology. He is the moderator of the Obligations Discussion Group (ODG), which is an international mailing list devoted to all aspects of the law of obligations and is a founding member of Western University’s Tort Law Research Group. In 2019, he was named the Jay McLeod Professor of the Year by Western’s Student Legal Society and has been selected to the USC Teaching Honour Roll in previous years. Professor Neyers was named Western Law’s Faculty Scholar in 2015 (given to honour outstanding scholarly achievements) and has been the Cassels Brock LLP Faculty Fellow in Contract Law. Prior to taking up his academic appointment he was a law clerk at the Court of Appeal for Ontario. Seeking graduate students in the following areas: Professor Neyers is happy to supervise graduate students in all areas of the private law. Research Highlights “Vicarious Liability in the Common Law World: The Revolution in Canada” in P Giliker, ed, Vicarious Liability in the Common Law World (Hart, 2022) (with J Kiss). Fridman’s The Law of Torts in Canada, 4th ed (Toronto: Thomson Reuters, 2020) (with A Botterell, E Chamberlain, M McInnes, JW Neyers, SGA Pitel & Zoë Sinel). Introduction to the Canadian Law of Torts, 4th ed (Toronto: LexisNexis, 2020) with A Botterell, E Chamberlain, M McInnes, JW Neyers, SGA Pitel & Zoë Sinel). “Form and Substance in the Tort of Deceit” in A Robertson and J Goudkamp, eds, Form and Substance in the Law of Obligations (Oxford: Hart, 2019)Cases and Materials on Contracts, 6th ed (Toronto: Emond Montgomery, 2018). “Reconceptualising the Tort of Public Nuisance” [2017] Cambridge Law Journal 87. “Tate & Lyle, Pure Economic Loss and The Modern Tort of Public Nuisance” (2016) 53 Alberta Law Review 1031 (with A Botterell). “Loss of Custom and Public Nuisance: The Authority of Ricket” (2016) Lloyd’s Maritime and Commercial Law Quarterly 135 (with E Andrews). “Causing Loss by Unlawful Means: Should the High Court of Australia follow OBG Ltd v Allan?” in S Degeling, J Edelman & J Goudkamp eds, Torts in Commercial Law (Sydney, Thomson Reuters, 2012). “What (is) a Nuisance?” (2011) 90 Canadian Bar Review 215. “The Economic Torts as Corrective Justice” (2009) 17 Torts Law Journal 162. “Rights-Based Justifications for the Tort of Unlawful Interference with Economic Relations” (2008) 28 Legal Studies 215. The Law of Torts in Canada, 3d ed (Toronto: Carswell, 2010) Ch. 11. “Explaining the Principled Exception to Privity of Contract” (2007) 52 McGill Law Journal 757. Research areas: Tort Law; Contract Law; Unjust Enrichment; Private Law Theory",
    "listed_research_areas":"Tort Law; Contract Law; Unjust Enrichment; Private Law Theory"
  },
  {
    "faculty":"western",
    "name":"Christopher C. Nicholls",
    "title":"Professor, Acting Dean; W. Geoff Beattie Chair in Corporate Law",
    "email":"cnichol8@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/christopher_nicholls.html",
    "bio":"Christopher Nicholls Academic Degrees: B.A. (Hons.), University of Ottawa\/Université d’Ottawa; LL.B. (Osgoode); LL.M. (Osgoode); M.P.A. (Harvard) Email: cnichol8@uwo.ca Phone: 519 661-2111 ext. 80301 Office: LB 108 Christopher C. Nicholls holds the W. Geoff Beattie Chair in Corporate Law and is Director of Business Law at Western Law as well as Co-Director of Western University's Interdisciplinary Centre for Financial Innovation and Risk Management (CFIRM). In 2013 he was named a Western University Faculty Scholar, and in 2016 received a Canada-U.S. Fulbright Scholar award. Professor Nicholls has acted as a consultant to private law firms and government and regulatory agencies and as an expert witness and has lectured to academic and professional audiences in Canada, the United States, the United Kingdom, Australia, South America and Japan. He has been a frequent speaker on topics relating to corporate law and mergers and acquisitions in judicial education programs organized for Canadian judges by the National Judicial Institute. He has been a Visiting Professor of Law at the Harvard Law School, a Herbert Smith Visitor at the University of Cambridge, a Senior Visiting Research Scholar at the Yale Law School, a Visiting Scholar at the University of Melbourne, a Visiting Research Scholar at the University of Tokyo and the Falconbridge Visiting Professor of Commercial Law at Osgoode Hall Law School. He has also been a visiting professor at the law faculties of the University of Toronto and Queen’s University. He is currently a member of the Editorial Advisory Board for the Canadian Business Law Journal and has previously served as a member (Commissioner) of the Nova Scotia Securities Commission, as Associate Editor and Corporate Finance Specialist Editor of the Canadian Business Law Journal, as a member of the editorial board of the Canadian Journal of Law and Technology, as a Research Fellow with the Filene Research Institute, Madison, Wisconsin, as Head of Research and Policy, Capital Markets Institute, Rotman School of Management, University of Toronto, and in 2015 was a member of the Business Law Agenda Expert Panel appointed by the Government of Ontario’s Ministry of Government and Consumer Services to provide recommendations for reform of Ontario’s corporate and commercial legislation. From 2016-2022, he was the Chair of the Board of Directors of the Mutual Fund Dealers Association of Canada, the national self-regulatory organization for the distribution side of the Canadian mutual fund industry. Prior to joining Western Law, he was the inaugural holder of the Purdy Crawford Chair in Business Law at Dalhousie Law School (now the Schulich School of Law at Dalhousie University) where he twice received the Dalhousie Law School Excellence in Teaching Law Award. Before beginning his academic career, he practised corporate and securities law with two of Toronto’s largest corporate law firms, then as a corporate finance and securities attorney in Bermuda. He is the author or co-author of seven books and numerous academic articles on topics relating to corporate law and finance, financial institutions and capital market regulation, and his work has been cited by Canadian securities commissions and many Canadian courts including the Supreme Court of Canada. Research Highlights Books Mergers, Acquisitions and Other Changes of Corporate Control, 3rd edition (Irwin, 2020) Securities Law 2d ed. (Irwin, 2018) Back from the Brink: Lessons from the Canadian Asset-Backed Commercial Paper Crisis (with Paul Halpern, Caroline Cakebread and Poonam Puri (University of Toronto Press, 2016)) Corporate Finance and Canadian Law, 2d ed. (Carswell, 2013) Mergers, Acquisitions and Other Changes of Corporate Control, 2d ed. (Irwin, 2012) Financial Institutions: The Regulatory Framework (LexisNexis, 2008) Corporate Law (Emond-Montgomery, 2005) Articles\/Chapters: “Canadian M & A: A Comparative Perspective” in C. Hill & S.D. Solomon, eds., Research Handbook on Mergers and Acquisitions (Edward Elgar Publishing, 2016) “Quantifying the Personal Income Tax Benefits of Backdating: A Canada-US Comparison” (co-author with R. Compton, D. Sandler & L. M. Tedds) (2012) 3 Columbia Journal of Tax Law 144 “Civil Enforcement in Canadian Securities Law” (2009) 9 Journal of Corporate Law Studies 367 Research Studies: Credit Unions as Cooperatives: How Charter Choice Drives Social Enterprise (Filene Research Institute, 2015) “The Characteristics of Canada’s Capital Markets and the Illustrative Case of Canada’s Legislative and Regulatory Response to Sarbanes Oxley”. A research study completed for The Investment Dealers Association of Canada Task Force to Modernize Securities Legislation in Canada, published as part of the Task Force’s Final Report, Canada Steps Up (October 2006). Also available online at: http:\/\/www.tfmsl.ca “Public and Private Uses of Credit Ratings” (Toronto: Capital Markets Institute, 2005) Recent Testimony Before the Senate Standing Committee on Banking, Trade and Commerce (February 2019) on “Open Banking” Research areas: Corporate Law; Securities Regulation; Corporate Finance; Law and Economics",
    "listed_research_areas":"Corporate Law; Securities Regulation; Corporate Finance; Law and Economics"
  },
  {
    "faculty":"western",
    "name":"Alfonso Nocilla",
    "title":"Assistant Professor",
    "email":"anocilla@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/alfonso_nocilla.html",
    "bio":"Alfonso Nocilla Academic Degrees: B.A. (Philosophy and History), Toronto, 2007; J.D., Queen’s, 2010; LL.M., Western, 2011; Ph.D. (Law), UCL, 2019; Called to the Bar of Ontario, 2012. Email: anocilla@uwo.ca Phone: 519-661-2111, ext. 84002 Office: LB 116 Alfonso has broad interests in commercial law, with emphasis on insolvency and restructuring. His research in these areas is methodologically diverse, incorporating comparative and empirical approaches, and has been cited favourably by courts across Canada, including the Supreme Court of Canada. Alfonso is a member of the Editorial Advisory Board of the Canadian Business Law Journal, a Co-Editor of the Journal of the Insolvency Institute of Canada, an Academic Member of the Insolvency Institute of Canada, and an Affiliated Researcher of the Desautels Centre for Private Enterprise and the Law. He has consulted on commercial and\/or insolvency law matters for the Canadian government, professional associations, and private parties. He has been interviewed by The Globe and Mail, CTV News and CBC Radio One, among other media, regarding significant insolvency cases. Alfonso joined Western Law as a tenure-track Assistant Professor in 2018. Previously, he was a Visiting Professor and Catalyst Capital Fellow in Insolvency Law at Western, as well as a Research Fellow at the University of Florence for the E.U.-funded project “Contractualised Distress Resolution in the Shadow of the Law”, which informed the new European Restructuring Directive. He completed his Ph.D. in corporate insolvency law at UCL, supported by a SSHRC Doctoral Fellowship. Seeking graduate students in the following areas: Bankruptcy and Insolvency Law, Commercial Law Research Highlights Books\/Edited Collections with Thomas Telfer and Anthony Duggan, eds., 64 Canadian Business Law Journal (2020-2021) [Special Volume: “100 Years of Canadian Bankruptcy and Insolvency Law”]. Peer-Reviewed Articles “Pre-packaged Administration and the Destruction of Value: The View from the U.K.” (2021) 64:3 Canadian Business Law Journal 342-378. with Vern DaRe, “Bestriding the Narrow World: The Evolution of the CCAA Monitor”, in Jill Corraini and Hon. Blair Nixon, eds., Annual Review of Insolvency Law 2020 (Thomson Reuters, 2021 and 2020 CanLIIDocs 3595) 224-253. “Reorganizations, Sales, and the Changing Face of Restructuring in Canada: Quantitative Outcomes of 2012 and 2013 CCAA Proceedings” (2019) 42:2 Dalhousie Law Journal 371-396 [Special Issue: Emerging Business Law Scholars]. with Vern DaRe, “The Trouble with Pre-Packs”, in Janis P. Sarra et al., eds., Annual Review of Insolvency Law 2018 (Toronto: Thomson Reuters, 2019) 621-640. “Asset Sales and Secured Creditor Control in Restructuring: A Comparison of the UK, US and Canadian Models” (2017) 26:1 International Insolvency Review 60-81 [2015 Ian Strang Founders’ Award from INSOL International for best paper by an early career researcher]. “The History of the Companies’ Creditors Arrangement Act and the Future of Restructuring Law in Canada” (2014) 56:1 Canadian Business Law Journal 73-103. “Is ‘Corporate Rescue’ Working in Canada?” (2013) 53:3 Canadian Business Law Journal 382-406. “Asset Sales Under the Companies’ Creditors Arrangement Act and the Failure of Section 36” (2012) 52:2 Canadian Business Law Journal 226-247. Book Chapters “Canada”, forthcoming in Jason Chuah and Eugenio Vaccari, eds., Treatment of Executory Contracts in Insolvency Law: A Global Guide (2nd Edition, Cheltenham: Edward Elgar, 2022). “Bankruptcy: Commencement and Consequences” in Stephanie Ben-Ishai & Thomas G.W. Telfer, eds., Bankruptcy and Insolvency Law in Canada: Cases, Materials, and Problems (Toronto: Irwin Law, 2019). “Property” in Stephanie Ben-Ishai & Thomas G.W. Telfer, eds., Bankruptcy and Insolvency Law in Canada: Cases, Materials, and Problems (Toronto: Irwin Law, 2019). “Priorities and Distribution” in Stephanie Ben-Ishai & Thomas G.W. Telfer, eds., Bankruptcy and Insolvency Law in Canada: Cases, Materials, and Problems (Toronto: Irwin Law, 2019). “Canada” in Jason Chuah and Eugenio Vaccari, eds., Treatment of Executory Contracts in Insolvency Law: A Global Guide (Cheltenham: Edward Elgar, 2019). Commissioned Reports with Rizwaan Mokal and Nigel Balmer, Contractualised Distress Resolution in the Shadow of the Law: United Kingdom National Findings (European Commission, 2018). Case Comments “Shaver-Kudell Manufacturing Inc. v. Knight Manufacturing Inc., 2021 ONCA 925”, forthcoming in inaugural volume of Desautels Review of Private Enterprise & Law. “Freedom of Contract, Fairness, and the Anti-Deprivation Rule” (2022) 65:3 Canadian Business Law Journal 374-386. with Vern DaRe, “The Inconvenient Act: Letters of Credit and Landlord Rights in Bankruptcy” (2021) 36:2 Banking and Finance Law Review 303-322. “Ipso Facto Clauses and the Limits of Freedom of Contract in Insolvency: Capital Steel v Chandos Construction” (2019) 62:3 Canadian Business Law Journal 337-350. Book Reviews Louise Gullifer and Orkun Akseli, eds., Secured Transactions Law Reform: Principles, Policies and Practice (Oxford: Hart Publishing, 2016), (2018) 33:3 Banking and Finance Law Review 421-424. Research areas: Corporate Insolvency; Contracts; and Commercial Law",
    "listed_research_areas":"Corporate Insolvency; Contracts; and Commercial Law"
  },
  {
    "faculty":"western",
    "name":"Valerie Oosterveld",
    "title":"Professor",
    "email":"vooster@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/valerie_oosterveld.html",
    "bio":"Valerie Oosterveld Academic Degrees: B.Soc.Sc. (Ottawa), LL.B. (Toronto), LL.M. and J.S.D. (Columbia) Email: vooster@uwo.ca Phone: 661-2111 x80037 Office: LB 112 Valerie Oosterveld is a Professor at Western Law. Her research and writing focus on gender issues within international criminal justice and she has published widely in this field, including on the concept of gender in international criminal law and the interpretation of sexual and gender-based crimes by international criminal courts and tribunals. She also researches outer space law, particularly international environmental space law, space mining, state responsibility in space, armed conflict in space, a feminist analysis of space law, and Canadian space law. She is a faculty member of Western’s Institute for Earth and Space Exploration. Professor Oosterveld was awarded the Royal Society of Canada Ursula Franklin Award in Gender Studies in 2022. Previously, she was a member of the Royal Society of Canada’s College of New Scholars, Artists and Scientists from 2014-2021 and was awarded Western University’s Faculty Scholar designation from 2017-2019. Professor Oosterveld is the Acting Director of Western University’s Centre for Transitional Justice and Post-Conflict Reconstruction. She is also a member of the Canadian Partnership for International Justice, funded by the Social Sciences and Humanities Research Council of Canada. She served as an Associate Dean at Western Law from 2014-2018. Before joining the Faculty of Law in 2005, Valerie served in the Legal Affairs Bureau of Canada’s Department of Foreign Affairs and International Trade. In this role, she provided legal advice on international criminal accountability for genocide, crimes against humanity and war crimes, especially with respect to the International Criminal Court (ICC), the International Criminal Tribunals for the Former Yugoslavia and Rwanda and the Special Court for Sierra Leone. She served on the Canadian delegation to various ICC-related negotiations, including the Assembly of States Parties. In 1998, she was a member of the Canadian delegation to UN Diplomatic Conference of Plenipotentiaries on the Establishment of an ICC. In this role, she negotiated various gender provisions, as Canada played a leading role in pressing for a gender-sensitive Rome Statute. In 2010, she served on the Canadian delegation to the Review Conference of the Rome Statute of the International Criminal Court in Kampala, Uganda. Research Highlights Books: Indira Rosenthal, Valerie Oosterveld, and Susana SáCouto (eds.) Gender in International Criminal Law (Oxford University Press, 2022) 496 pp. John Currie, Craig Forcese, Joanna Harrington, and Valerie Oosterveld, International Law: Doctrine, Practice and Theory, 3rd ed. (Irwin Law, 2022) 936 pp. Margaret M. deGuzman and Valerie Oosterveld (eds.), The Elgar Companion to the International Criminal Court (Edward Elgar Publishing, 2020) 421 pp. Articles and Book Chapters: Valerie Oosterveld, “Forced Marriage: Terminological Coherence and Dissonance in International Criminal Law” (2019) 27(4) William & Mary Bill of Rights Journal 1263-1282. Valerie Oosterveld, “The Construction of Gender in Child Soldiering in the Special Court for Sierra Leone” in Mark A. Drumbl and Jastine C. Barrett, Research Handbook on Child Soldiers (Elgar Publishers, 2019) 74-94. Valerie Oosterveld, “Gender, Enslavement and War Economies: A Case Study from the Special Court for Sierra Leone” in Solange Mouthaan and Olga Jurasz (eds) Gender and War: International and Transitional Justice Perspectives (Intersentia, 2019) 147-168. Valerie Oosterveld, “Crimes of Sexual and Gender-Based Violence and the Legacy of the Tribunals” in Michael Scharf and Milena Sterio (eds.), The Legacy of the Ad Hoc Tribunals in International Criminal Law (Cambridge University Press, 2019) 197-220. Valerie Oosterveld, “The ICC Policy Paper on Sexual and Gender-Based Crimes: A Crucial Step for International Criminal Law” (2018) 24(3) William & Mary Journal of Women and the Law 1-15. Valerie Oosterveld, “Canada and the Development of International Criminal Law: What Role for the Future?” in Oonagh Fitzgerald, Mark Jewett, Valerie Hughes and Basil Ugochukwu (eds), Canada in International Law @150: Past, Present and Future (McGill Queen’s University Press: 2018) 425-442. Valerie Oosterveld, “Forced Marriage”, in Naomi Cahn, Dina Haynes, Fionnuala Ní Aoláin and Nahla Valji (eds.), Gender and Conflict Handbook (Oxford University Press, 2017) 240-252. Valerie Oosterveld, “Women and Girls Fleeing Conflict: Gender and the Interpretation and Application of the 1951 Refugee Convention”, in Volker Türk, Alice Edwards and Cornelius Wouters (eds.), In Flight from Conflict and Violence: UNHCR's Consultations on Refugee Status and Other Forms of International Protection (Cambridge University Press, 2016) 183-214. Valerie Oosterveld, “Crimes Against Humanity”, in Anne-Marie de Brouwer and Alette Smeulers (eds.), The Elgar Companion to the International Criminal Tribunal for Rwanda (Elgar Publishers, 2016) 110-139. Valerie Oosterveld and Patricia Viseur-Sellers, “Issues of Sexual and Gender-Based Violence at the ECCC”, in Simon Meisenberg and Ignaz Stegmiller (eds.), The Hybrid Contributions of the Extraordinary Chambers in the Courts of Cambodia to International Criminal Law (TMC Asser\/Springer, 2016) 321-351. Valerie Oosterveld, “Constructive Ambiguity and the Meaning of ‘Gender’ for the International Criminal Court” (2014) 16(4) International Feminist Journal of Politics 563-580. Valerie Oosterveld, “Sexual Violence Directed Against Men and Boys in Armed Conflict and Mass Atrocity: Addressing a Gendered Harm in International Criminal Tribunals” (2014) 10(1) Journal of International Law and International Relations 107-128. Valerie Oosterveld, “The Influence of Domestic Legal Traditions on the Gender Jurisprudence of International Criminal Tribunals”, (2013) 2(4) Cambridge Journal of International and Comparative Law 825-849. Valerie Oosterveld, “Gender and the Charles Taylor Case at the Special Court for Sierra Leone” (2012) 19(1) William & Mary Journal of Women and the Law 7-34. Valerie Oosterveld, “Forced Marriage and the Special Court for Sierra Leone: Legal Advances and Conceptual Difficulties” (2011) 2(2) Journal of International Humanitarian Legal Studies 127-158. Research areas: International criminal law (including sexual and gender-based crimes); transitional justice; outer space law",
    "listed_research_areas":"International criminal law (including sexual and gender-based crimes); transitional justice; outer space law"
  },
  {
    "faculty":"western",
    "name":"Manish Oza",
    "title":"Assistant Professor",
    "email":"moza@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/manish_oza.html",
    "bio":"Manish Oza Academic Degrees: BA (hons) (Oxford); JD (Toronto), PhD (Toronto) Email: moza@uwo.ca Phone: LB 101 Office: 519-661-2111 x84370 Manish Oza is an assistant professor at Western Law. His research focuses on legal theory, philosophy of logic, property and contract. His current project is about the authority of nonstate groups, such as clubs, churches, unions and social and political organizations, and how it intersects with the authority of the state. He is also interested in collective forms of ownership, legal pluralism, legal reasoning and the relation between legal theory and law. Manish completed a JD and a PhD in philosophy at the University of Toronto, and clerked at the Supreme Court of Canada and the Court of Appeal for Ontario. Website: www.manishoza.ca Research Highlights \"Tort claims against public authorities\" (forthcoming) Alberta Law Review (with Malcolm Rowe) \"Fictions in legal reasoning\" (forthcoming) Dialogue \"Hegel and formal idealism\" (2022) Hegel Bulletin \"Nonsense: a user's guide\" (2022) Inquiry \"The value of thinking and the normativity of logic\" (2020) Philosophers' Imprint 20(27), pp. 1–23 \"Review of Irit Samet, Equity: Conscience Comes To Market\" (2020) University of Toronto Law Journal 70(2), pp. 216–222 Research areas: Property; Contract; and Philosophy of Law",
    "listed_research_areas":"Property; Contract; and Philosophy of Law"
  },
  {
    "faculty":"western",
    "name":"Martin Petrin",
    "title":"Associate Professor, Dancap Private Equity Chair in Corporate Governance",
    "email":"mpetrin@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/martin_petrin.html",
    "bio":"Martin Petrin Academic Degrees: S.J.D., University of California, Los AngelesPh.D., University of St. GallenLL.M., Columbia UniversityJ.D., University of St. Gallen Email: mpetrin@uwo.ca Phone: 519-661-2111 x81115 Office: LB 25 Martin Petrin joined Western as the inaugural Dancap Private Equity Chair in Corporate Governance, jointly appointed to the DAN Department of Management and Organizational Studies and the Faculty of Law. Martin’s research interests are in corporate, corporate governance, and business law, often from a comparative perspective. Most recently, his research has focused on corporate regulation, corporate theory and the impact of new technologies, and approaches to corporate and managerial liability. Martin has published widely in his areas of expertise, including as the author and editor of several books, and is a regular speaker at international conferences. Martin has practiced law with a leading international business law firm and has been admitted to the Bar in New York and Switzerland. He is also a Distinguished Fellow and Visiting Professor at the Notre Dame London Law Program and has served as a Visiting Professor at NYU London, the Richard H. McLaren Visiting Professor in Business Law at Western University, and a Visiting Scholar at both the University of Cambridge Faculty of Law and the Max Planck Institute for Comparative and Private Law. In addition to his academic work, Martin acts as a consultant, with recent work in this field including a government-commissioned project on corporate law reform and consultancy work with various organizations and private parties. Research Highlights The EU’s Ethics Guidelines For Trustworthy Artificial Intelligence from a Company Law Perspective, 22 EUROPEAN BUSINESS ORGANIZATION LAW REVIEW 593 (2021) Corporate Duties to the Public (Cambridge University Press, 2019) Corporate Governance: Law, Regulation and Theory (Palgrave Macmillan, 2017) Corporate Management in the Age of AI, 2019 Columbia Business Law Review 965 (2019) Group Company Liability, 19 European Business Organization Law Review 771 (2018) Regulatory Analysis in Corporate Law, 79 Modern Law Review 537 (2016) From Nature to Function: Reconceptualizing the Theory of the Firm, 118 Penn State Law Review 1 (2013) Assumption of Responsibility in Corporate Groups: Chandler v Cape plc, 76 Modern Law Review 603 (2013) Circumscribing the “Prosecutor’s Ticket to Tag the Elite” – A Critique of the Responsible Corporate Officer Doctrine, 84 Temple Law Review 283 (2012) Assessing Delaware’s Oversight Jurisprudence: A Policy and Theory Perspective, 5 Virginia Law & Business Review 433 (2011) The Curious Case of Directors’ and Officers’ Liability for Supervision and Management: Exploring the Intersection of Corporate and Tort Law, 59 American University Law Review 1661 (2010)",
    "listed_research_areas":null
  },
  {
    "faculty":"western",
    "name":"Stephen Pitel",
    "title":"Professor",
    "email":"spitel@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/stephen_pitel.html",
    "bio":"Stephen Pitel Academic Degrees: BA (Carleton) 1989, LLB (Dalhousie) 1992, LLM (Cambridge) 1995, PhD (Cambridge) 2002, called to the Bar of Ontario 1994 Email: spitel@uwo.ca Phone: 519 661-2111 ext. 88433 Office: LB 30 Professor Pitel is one of Canada’s leading scholars of the conflict of laws, the field of law dealing with the taking of jurisdiction, the identification of the applicable law and the recognition and enforcement of foreign judgments in civil and commercial litigation. He is also well known in the fields of tort law and legal ethics. His work has been cited by Canadian courts in several decisions. He is a member of Western's Board of Governors and the President of the Canadian Association for Legal Ethics. He joined the Faculty of Law in 2000 after practicing corporate and commercial litigation in Toronto and completing graduate studies at the University of Cambridge. He was promoted to Professor in 2013. He has taught intensive courses as an adjunct professor at the University of Toronto and the University of Sherbrooke. He is the co-author of Conflict of Laws, 2d ed. (2016), Private International Law in Common Law Canada: Cases, Text and Materials, 4th ed. (2016) and Statutory Jurisdiction: An Analysis of the Court Jurisdiction and Proceedings Transfer Act (2012). He is also the editor of Litigating Conspiracy: An Analysis of Competition Class Actions (2006), co-editor of Tort Law: Challenging Orthodoxy (2013), Exploring Contract Law (2009), Emerging Issues in Tort Law (2007), Understanding Unjust Enrichment (2004) and The Joy of Torts (2003), co-author of Cases and Materials on the Law of Torts, 10th ed. (2019) and The Law of Restitution in Canada: Cases, Notes and Materials (2004) and co-general editor and co-author of Fridman's The Law of Torts in Canada, 4th ed. (2020) and Introduction to the Canadian Law of Torts, 4th ed. (2020). His articles on private international law have been published in the Canadian Bar Review, Canadian Business Law Journal, Journal of Private International Law and Advocates’ Quarterly. He was awarded the Ontario Confederation of University Faculty Associations Teaching Award in 2013, the Edward G. Pleva Award for Excellence in Teaching in 2012, the Bank of Nova Scotia, University of Western Ontario Alumni Association and University Students’ Council Award of Excellence in Undergraduate Teaching in 2008 and Western Law’s Student Legal Society Professor of the Year in 2004 and 2008. He has served as a member of the Chief Justice of Ontario’s Advisory Committee on Professionalism and as co-director of the Tort Law Research Group. From 2010 to 2014 he was a Goodmans LLP Faculty Fellow in Legal Ethics. He is a former President of the University of Western Ontario Faculty Association and won the Allan Heinicke Memorial Service Award in 2021. The Dalhousie Law Alumni Association granted him membership in the Bertha Wilson Honour Society in 2021 for “exceptional service to the legal profession and community”. He frustrates himself playing golf and tennis and supporting sports teams from Philadelphia. He is a fan of musical theatre and classic rock, some genres of reality television and the London Knights. Seeking graduate students in the following areas: Conflict of Laws \/ Private International Law; Tort Law Full publications list Research Highlights E. Chamberlain & S.G.A. Pitel, eds., Fridman’s The Law of Torts in Canada, 4th ed. (Toronto: Thomson Reuters, 2020) R. Solomon, M. McInnes, E. Chamberlain & S.G.A. Pitel, Cases and Materials on the Law of Torts, 10th ed. (Toronto: Carswell, 2019) S.G.A. Pitel & N. Rafferty, Conflict of Laws, 2d ed. (Toronto: Irwin Law, 2016) S.G.A Pitel, J. Blom, E. Edinger, G. Saumier, J. Walker & C. Walsh, Private International Law in Common Law Canada Cases, Text and Materials, 4th ed. (Toronto: Emond Publishing, 2016) S.G.A. Pitel & Y.S. Gadsden-Chung, \"Reconsidering a Lawyer's Obligation to Raise Adverse Authority\" (2016) 49 U.B.C.L. Rev. 521 (to 561) V. Black & S.G.A. Pitel, \"Forum-Selection Clauses: Beyond the Contracting Parties\" (2016) 12 J. Priv. Int'l L. 26 S.G.A. Pitel & J. McKie, “Solicitor-Client Privilege for Ethics Counsel: Lessons for Canada from the United States” (2013) 91 Can. Bar Rev. 313 (to 362) S.G.A. Pitel & W. Bortolin, \"Revising Canada's Ethical Rules for Judges Returning to Practice\" (2012) 34 Dal. L.J. 483 (to 528) V. Black, S.G.A. Pitel & M. Sobkin, Statutory Jurisdiction: An Analysis of the Court Jurisdiction and Proceedings Transfer Act (Toronto: Carswell 2012) S.G.A. Pitel & A. Valentine, “The Evolution of the Extra-territorial Mareva Injunction in Canada: Three Issues” (2006) 2 J.P.I.L. 339 (to 396) Research areas: Civil Litigation; Courts; Judges; Legal Ethics; Tort; International Commercial Litigation; Conflicts",
    "listed_research_areas":"Civil Litigation; Courts; Judges; Legal Ethics; Tort; International Commercial Litigation; Conflicts"
  },
  {
    "faculty":"western",
    "name":"Akis Psygkas",
    "title":"Associate Professor",
    "email":"apsygkas@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/akis_psygkas.html",
    "bio":"Athanasios (Akis) Psygkas Academic Degrees: J.S.D. (Yale), LL.M. (Yale), LL.M. (Aristotle University of Thessaloniki), LL.B. (Aristotle University of Thessaloniki) Email: apsygkas@uwo.ca Phone: 519 661-2111 ext. 80038 Office: LB 28 Athanasios (Akis) Psygkas is an Associate Professor at Western Law, where he has been a member of the faculty since 2021. His research and teaching interests include comparative public law, law of democracy, regulation and governance. His latest book, entitled From the ‘Democratic Deficit’ to a ‘Democratic Surplus’: Constructing Administrative Democracy in Europe (Oxford University Press, 2017), examines the impact of European Union law on the adoption of participatory regulatory processes at the member-state level. The book was the runner-up for the 2019 SLSA Theory and History Book Prize. Akis received his J.S.D. degree from Yale Law School. He also holds an LL.B. and an LL.M. in Public Law and Political Science from the Aristotle University of Thessaloniki, as well as an LL.M. from Yale Law School where he was a Fulbright scholar. Prior to his appointment at Western University, Akis was a faculty member at the University of Bristol in the United Kingdom. He has held visiting positions at the University of Toronto (2017-2018), the European University Institute in Florence (Max Weber Fellowship, 2013-2014) and the Institut d’études politiques (Sciences Po) in Paris (Fox International Fellowship, 2010-2011). From January to July 2009, he was the Oscar M. Ruebhausen visiting research fellow at Yale Law School and was involved in the Comparative Administrative Law Initiative, where he has been managing the Comparative Administrative Law Blog since 2009. Akis has published in the areas of comparative public law, policy and governance. He has advised international NGOs on these issues, and been invited to give talks in Canada, Europe, and the United States. He has received a University Research Fellowship and a British Academy Rising Star Engagement Award. He is a Fellow of the UK Higher Education Academy and sits on the editorial board of the German Law Journal. Seeking graduate students in the following areas: (Canadian and Comparative) Public Law, Law of Democracy Research Highlights ‘The United Kingdom’s Statutory Constitution,’ 40 Oxford Journal of Legal Studies 449–481 (2020). ‘Accountability,’ in Peter Cane, Herwig Hofmann, Eric Ip & Peter Lindseth (eds.), The Oxford Handbook of Comparative Administrative Law (Oxford University Press, 2020) 443-466. ‘Accommodating legal pluralism and “pluralizing” the constitution: The example of the United Kingdom,’ in Guillaume Tusseau (ed.), Debating legal pluralism and constitutionalism: New trajectories for legal theory in the global age (Springer, 2020) 305-331. ‘The Hydraulics of Constitutional Claims: Multiplicity of Actors in Constitutional Interpretation,’ 69 University of Toronto Law Journal 211-247 (2019). From the ‘Democratic Deficit’ to a ‘Democratic Surplus’: Constructing Administrative Democracy in Europe (Oxford University Press, 2017) 376pp. ‘The “Double Helix” of Process and Substance Review Before the UK Competition Appeal Tribunal: A Model Case or a Cautionary Tale for Specialist Courts?’ in Susan Rose-Ackerman, Peter Lindseth and Blake Emerson (eds.), Comparative Administrative Law, 2nd ed (Edward Elgar, 2017) 462-477. Research areas: (Canadian and Comparative) Public Law; Law of Democracy",
    "listed_research_areas":"(Canadian and Comparative) Public Law; Law of Democracy"
  },
  {
    "faculty":"western",
    "name":"Melanie Randall",
    "title":"Associate Professor (On Sabbatical Leave)",
    "email":"randallm@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/melanie_randall.html",
    "bio":"Melanie RandallB.A. (University of Toronto), M.A., University of Toronto, Ph.D. (York), LL.B. (University of Toronto) Professor Randall is appointed with the Faculty of Law. She held the Scotiabank Professorship with the Centre for Research on Violence Against Women and Children, at the University of Western Ontario from 1999-2004. Her current teaching and research interests are in the areas of sex discrimination and legal theory. Her publications include articles on the issue of women's autonomy rights, and on sexual violence in women's lives, including state accountability for responding to and remedying this violence, particularly through law. Email: randallm@uwo.ca Phone: 519 661-2111 ext. 88450 Office: LB 14 Research Highlights “The Impact of Trauma on Adult Sexual Assault Victims,” co-authored with Dr. Lori Haskell, Justice Canada, Ottawa, Ontario, 2019, https:\/\/www.justice.gc.ca\/eng\/rp-pr\/jr\/trauma\/trauma_eng.pdf.https:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract_id=3417763 “Normative and International Human Rights Law Imperatives for Criminalizing Intimate Partner Sexual Violence: The Marital Rape Impunity in Comparative and Historical Perspective,” Vasanthi Venkatesh and Melanie Randall, In The Right to Say No: Marital Rape and Law Reform in Canada, Ghana, Kenya and Malawi, co-edited with Jennifer Koshan and Patricia Mande Nyaundi. Hart Publishing, Oxford, UK, 2017.https:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract_id=3201074 \"Criminalizing Sexual Violence Against Women in Intimate Relationships: Why Sexual Assault in Intimate Relationships Must Be Criminalized as Required by International Human Rights Law: A Response to the Symposium Comments,\" co-authored with Vasanthi Venkatesh, 109 American Journal of International Law Unbound 342 (May 17, 2016). https:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract_id=2787987 “Criminalizing Sexual Violence against Women in Intimate Relationships: State Obligations Under Human Rights Law,” (with Vasanthi Venkatesh) 109 American Journal of International Law Unbound, 189 January 7, 2016.https:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract_id=2712838 “Particularized Social Groups and Categorical Imperatives in Refugee Law: State Responsibility and the Legal Reception of Gender Persecution Claims in Canada, the U.S. and the U.K.,” American University Journal of Gender, Social Policy & the Law, Fall, 2015.https:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract_id=2683962 Randall, Melanie and Venkatesh, Vasanthi, “The Right to No: The Crime of Marital Rape, Women’s Human Rights, and International Law” Brooklyn Journal of International Law, Dec 2015.https:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract_id=2704099 “Equality Rights and the Charter: Reconceptualizing State Accountability For Ending Domestic Violence” in F. Faraday, et al., eds., Making Equality Rights Real: Securing Substantive Equality under the Charter. Toronto: Irwin, 2006.https:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract_id=1473163 “Restorative Justice and Gendered Violence? From Vaguely Hostile Skeptic to Cautious Convert: Why Feminists Should Critically Engage with Restorative Approaches to Law,” (2013) 36 Dal Law J, 461- 499.https:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract_id=2424596 Co-authored with Lori Haskell, “Trauma-informed Approaches to Law: Why Restorative Justice Must Understand Trauma and Psychological Coping” (2013) 36 Dal Law J, 500-533.https:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract_id=2424597 “The Judicial Treatment of Consent in Canadian Sexual Assault Law: Legal and Social Challenges in Criminal Processing of Marital Rape Cases,” (article manuscript, for The Equality Effect) online at: http: \/\/theequalityeffect. org\/pdfs\/ConsentPaperCanadaMR. pdf.theequalityeffect.org\/wp-content\/uploads\/2013\/04\/consent-paper-Canada-MR.pdf \"Sexual Assault Law, Credibility, and ‘Ideal Victims’: Consent, Resistance and Victim Blaming,\" (2010) 22 Canadian Journal of Women and the Law, 397.https:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract_id=1742077 “Disrupted Attachments: A Social Context Complex Trauma Framework and the Lives of Aboriginal Peoples in Canada,” (co-authored with Lori Haskell), Journal of Aboriginal Health, Vol. 5, No. 3, pp. 48-99, November 2009.https:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract_id=1569034 “Private law, the State and the Duty to Protect: Tort Actions for Police Failures in Gendered Violence Cases” In Supreme Court Reports, Volume 44, 2009, and Critical Torts, Sanda Rodgers, Rakhi Ruparelia, Louise Bélanger-Hardy eds., Toronto: Butterworths, 2009.https:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract_id=1473151 “Honest But Mistaken Judicial Beliefs About Sexual Assault in Spousal Relationships, Consent and the Law: When No Doesn’t Mean No” University of Manitoba Law Journal32(1), 2008.https:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract_id=1473153 “Compensating the Harms of Sexual and Domestic Violence: Tort Law, Insurance and the Role of the State” (With Craig Brown) (Fall, 2004) 30 Queen’s Law Journal 311-347.https:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract_id=1459037 “Domestic Violence and the Construction of “Ideal Victims:” Assaulted Women’s “Image Problems” in Law” (2004) XXIII St. Louis University Public Law Review 107-154.https:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract_id=1473143 “Sex Discrimination, Accountability of Public Authorities, and the Public\/Private Divide in Tort Law: An Analysis of Doe v. Metropolitan Toronto (Municipality) Commissioners of Police” (2001) 26 Queen’s Law Journal, 451-495.https:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract_id=1173042 Research areas: Human Rights; Sex Discrimination; Gendered Violence",
    "listed_research_areas":"Human Rights; Sex Discrimination; Gendered Violence"
  },
  {
    "faculty":"western",
    "name":"David Sandomierski",
    "title":"Assistant Professor",
    "email":"david.sandomierski@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/david_sandomierski .html",
    "bio":"David Sandomierski Academic Degrees: B.A.Sc. (Hon.) (McMaster), M.A. (Toronto), B.C.L. (McGill), LL.B. (McGill), S.J.D. (Toronto) Email: david.sandomierski@uwo.ca Phone: 519-661-2111, ext. 81445 Office: LB 115 David Sandomierski joined Western Law in 2018. He strives to enhance the capacity of legal education to cultivate versatile professionals and critical, engaged citizens. In pursuit of this mission, David integrates diverse scholarly interests in Contracts, comparative legal thought, legal history, and the empirical study of legal education and the legal profession. David earned his SJD from the University of Toronto, where his doctoral dissertation received the Governor General’s Academic Gold Medal. David has received the Peter Oliver Prize from the Osgoode Society for Canadian Legal History and has twice been awarded the Canadian Association of Law Teachers’ Prize for the Scholarship of Teaching and Learning. David studied common and civil law at McGill University, where he was Editor-in-Chief of the McGill Law Journal. In 2008-09, David served as law clerk to Chief Justice Beverley McLachlin at the Supreme Court of Canada. He was called to the Bar of Ontario in 2009. David is a former Vanier Scholar, Loran Scholar, and Parliamentary Intern. Effective July 1, 2022, David is a Teaching Fellow with Western’s Centre for Teaching and Learning. Within the Faculty of Law, he directs the Legal Education Seminar Series. Seeking graduate students in the following areas: Scholarship of Legal Education and the Legal Profession; Legal History; Legal Thought. Research Highlights Books American Legal Education Abroad: Critical Histories (NYU Press, 2021) (edited collection with Susan Bartie) Aspiration and Reality in Legal Education (University of Toronto Press, 2020) Special Issue Law and Learning in a Time of Pandemic – A Collage \/\/ Collage sur le droit et le savoir au temps de la pandémie (2020) 25 Lex Electronica (edited collection with Shauna Van Praagh) Articles “Learning Without Grade Anxiety: Lessons from the Pass\/Fail Grading Experiment in North American JD Programs” (2022) 48 Ohio Northern University Law Review 555 (with John Bliss) “Modular Legal Learning: Revitalizing the Law Classroom” (2022) 45:2 Dalhousie Law Journal (with Stephanie Ben-Ishai) “Catalytic Agents? Lon Fuller, James Milner, and the Lawyer as Social Architect, 1950-1969” (2021) 71 University of Toronto Law Journal 91 “Tension and Reconciliation in Canadian Contract Law Casebooks” (2017) 54:4 Osgoode Hall Law Journal 1181 [2018 Peter Oliver Prize, Osgoode Society for Canadian Legal History] “Legal Inquiry: A Liberal Arts Experiment in Demystifying Law” (2014) 29:3 Canadian Journal of Law and Society 311 [2017 Scholarship of Teaching and Learning Award, Canadian Association of Law Teachers] “Training Lawyers, Cultivating Citizens, and Re-Enchanting the Legal Professional” (2014) 51:4 Alberta Law Review 739 “Against Nomopolies” (2006) 57:4 Northern Ireland Legal Quarterly 610 (with Roderick A Macdonald) Chapters in Edited Collections “Selective Deference and the Judicial Role: Chief Justice McLachlin’s Legacy for Law and Legal Education” in Vanessa MacDonnell, Graham Mayeda & Owen Rees, eds, Controversies in the Common Law: Tracing the Contributions of Chief Justice McLachlin (Toronto: University of Toronto Press, 2022) 123 “The Limits of Adjudication in the First-Year Curriculum: The Recurring History of Legal Process at the University of Toronto Faculty of Law” in Ian Pilarczyk, Angela Fernandez and Brian Young, eds, Law, Life, and the Teaching of Legal History: Essays in Honour of G. Blaine Baker (Montreal & Kingston: McGill-Queen’s Press, 2022) 415 “Theory and Practice, Together At Last: A Heretical, Empirical Account of Canadian Legal Education” in Meera Deo, Mindie Lazarus-Black & Elizabeth Mertz, eds, Power, Legal Education, and Law School Cultures (London: Routledge) 1 [Honourable Mention, 2017 Roderick A Macdonald Graduate Student Essay Prize, Canadian Law and Society Association] “Pursuing Virtue: Human Potential, Citizenship, and a Research Agenda for Legal Education” in Richard Janda, Rosalie Jukier & Daniel Jutras, eds, The Unbounded Level of the Mind: Rod Macdonald’s Legal Imagination (Montreal & Kingston: McGill-Queen’s Press, 2015) 206 Other “Law and Living”, Book Review of Connecting the Dots: The Life of an Academic Lawyer by Harry W Arthurs (2021) 58:2 Osgoode Hall Law Journal 467 “From Law Grad to Better Citizen” Policy Options (2015) Jan-Feb: 51-2 “Beside the Supreme Court Bench” The Advocates’ Journal (2010) Summer: 19-20, reprinted in Stephen Grant, ed, Advocates and Advocacy: The Best of the Advocates’ Journal, 2005-2018 (Toronto: Irwin Law, 2018) Research areas: Contracts; Legal History; and Legal Education",
    "listed_research_areas":"Contracts; Legal History; and Legal Education"
  },
  {
    "faculty":"western",
    "name":"Jacob Shelley",
    "title":"Associate Professor",
    "email":"jacob.shelley@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/jacob_shelley.html",
    "bio":"Jacob Shelley Academic Degrees: SJD (University of Toronto), LLM (University of Alberta), LLB (University of Alberta), MTS (Conrad Grebel University College) Email: jshelle6@uwo.ca Phone: 519-661-2111, ext. 80043 Office: LB 21 Jacob joined Western Law in 2015. He holds a joint appointment with the Faculty of Law and the School of Health Studies in the Faculty of Health Sciences, has a cross appointment to the Schulich Interfaculty Program in Public Health, and is Associate Faculty with the Rotman Institute of Philosophy. Dr. Shelley is a co-director of the Health Ethics, Law & Policy (HELP) Lab at Western. He has a doctorate in law (SJD) from the University of Toronto, where he was a Vanier Fellow with the Canadian Institutes of Health Research. His doctoral thesis, under the supervision of Trudo Lemmens, examined the use of private law in obesity prevention, specifically looking at the use of product liability law to require food manufacturers to warn consumers about the dangers inherent in their food products. Dr. Shelley obtained his LLB (2007) and LLM (2009) from the University of Alberta, and he has a MTS from Conrad Grebel University College (2006). His primary area of interest is the proper limits and role of law in promoting public health and preventing chronic disease. In addition, he is generally interested in issues that arise at the interface of law, health science, and ethics. Jacob Shelley is currently on sabbatical leave. Research Highlights JJ Shelley, M Clark & T Caulfield, “The Face of Chiropractic: Evidence Based?” (2015) 20(1) Focus on Alternative and Complimentary Therapies 13-22.JJ Shelley, “Addressing the Policy Cacophony does not Require More Evidence: An Argument for Reframing Obesity as Caloric Overconsumption” (2012) 12 BMC Public Health 1042. JJ Shelley & LM Minaker, Comparative Study on the Regulation of Public Health Systems that Guarantee Universal Coverage: The Case of Canada, report for the Pan American Health Organization (2011).JJ Shelley, “The Crown’s Right of Recovery Act” (2010) 18:3 Health Law Review 15-23.T Caulfield, V Alfonso & JJ Shelley, “Deterministic?: Newspaper Representations of Obesity and Genetics” (2009) 1 The Open Obesity Journal 38-40.T Caulfield, JJ Shelley, T Bubela & L Minaker, “Framing Nutrigenomics for Individual and Public Health: Public Representations of an Emerging Field” in D Castle & N Ries, eds, Nutrition and Genomics: Issues of Ethics, Law, Regulation & Communication (New York: Elsevier, 2009) 223-244.T Caulfield, JJ Shelley, V Alfonso & T Bubela, “Nutrigenomics and the Promise of Prevention: Representations and Realities” (2008) Special Edition Health Law Journal 41-65. JJ Shelley, “Assessing the Science of Genetically Modified Crops: The New Frontier of Public Health Policy” (2007) 15:3 Health Law Review 19-23.NM Ries & JJ Shelley, eds, Food, Health and Biotechnology: Consumer and Social Issues in Canada’s New Food and Health Product Industries A Report from the Advanced Foods and Materials Network (Guelph, ON: Advanced Foods and Materials Network, 2007).JJ Shelley, “Deference in the Public Health Context” (2006) 15:1 Health Law Review 33-36. Research areas: Public Health Law; Policy & Ethics; Health Law; Policy & Ethics",
    "listed_research_areas":"Public Health Law; Policy & Ethics; Health Law; Policy & Ethics"
  },
  {
    "faculty":"western",
    "name":"Christopher Sherrin",
    "title":"Associate Professor & Associate Dean (Academic)",
    "email":"csherrin@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/christopher_sherrin.html",
    "bio":"Christopher Sherrin Academic Degrees: Doctor of Philosophy (Osgoode), Master of Laws (Osgoode), Bachelor of Laws (McGill), Honours Bachelor of Arts (University of Toronto) Email: csherrin@uwo.ca Phone: 519 661-2111 ext. 80421 Office: LB 237 Dr. Christopher Sherrin joined the faculty in 2006. His primary areas of interest are criminal law and procedure, evidence, and the Charter. He has a particular interest in the study of wrongful convictions and reliability in the criminal justice process. Previously, he practiced as defense counsel with the Toronto firm of Cooper, Sandler & West. He has acted as part-time Assistant Crown Attorney, consultant to and researcher for various commissions of inquiry, Director of the Innocence Project at Osgoode Hall Law School of York University, member of the local Legal Aid Ontario Area Committee, and editor of the Annotated Youth Criminal Justice Act Service and the Wrongful Conviction Law Review. He has also been active in judicial and continuing legal education. He was appointed Associate Dean (Academic) in June 2017. Research Highlights “Police Investigative Technique Privilege” in Perspectives on Evidentiary Privileges (Thompson Reuters, 2019) [forthcoming] “R. v. Cody: What Does Cody Add to Jordan?” (2017) 37 C.R. (7th) 289 “Understanding and Applying the New Approach to Charter Claims of Unreasonable Delay” (2017) 22 Can Crim L. Rev. 1 “R. v. Smith and Judicially Reviewing the Scope of Criminal Law under the Charter” (2016) 76 S.C.L.R. (2d) 291 “Reconsidering the Charter Remedy for Unreasonable Delay in Criminal Cases” (2016) 20 Can. Crim. L. Rev. 263 “Earwitness Evidence: The Reliability of Voice Identifications” (2016) 52 Osgoode Hall L.J. 819 “Cross-Examining the Accused on Partial Pre-Trial Silence” (2015) 23 C.R. (7th) 253 “Mufuta, Reasonable Inferences, and Proof Beyond a Reasonable Doubt: Food for Thought” (2015) 17 C.R. (7th) 154 “R v Whyte: Protecting the Innocent (and the Guilty)” (2014) 10 C.R. (7th) 102 “Wilful Blindness: A Confused and Unnecessary Basis for Criminal Liability?” (2014) 47 U.B.C. L. Rev. 709 Research areas: Criminal Law; Criminal Procedure; Evidence; Sentencing; and Miscarriages of Justice",
    "listed_research_areas":"Criminal Law; Criminal Procedure; Evidence; Sentencing; and Miscarriages of Justice"
  },
  {
    "faculty":"western",
    "name":"Zoë Sinel",
    "title":"Associate Professor & Associate Dean (Research and Graduate Studies)",
    "email":"zsinel@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/zoe_sinel.html",
    "bio":"Zoë Sinel Academic Degrees: SJD (University of Toronto), MPhil (Oxford), BCL (Oxford), JD (Toronto), BA (University of British Columbia) Email: zsinel@uwo.ca Phone: 519 661 2111 x83832 Office: Rm 15 Zoë Sinel is an Associate Professor at Western Law. She researches and teaches in private law and legal theory, with a particular focus on the law of torts and its remedies. She has published doctrinal and theoretical work in leading domestic and international law journals, including the University of Toronto Law Journal, the Oxford Journal of Legal Studies, the Torts Law Journal, and the Restitution Law Review. Her current research projects include two SSHRC-funded projects in private law and legal theory: a monograph on tort law’s treatment of emotions, entitled Just Feelings: A Tort Law Theory of Emotion; and the Tort Law and Social Equality Project, a website devoted to the creation of a network of tort law scholars to engage with the social contexts in which tort law develops and the marginalized groups it affects. She was awarded Western University’s Faculty Scholar designation from 2020-2022 and is currently Western Law’s Associate Dean (Research & Graduate Studies). She is editor, alongside Margaret Martin, of the Canadian Journal of Law and Jurisprudence. She is also an affiliate faculty member of the Department of Gender, Sexuality, and Women’s Studies. Prior to her appointment in 2013, Professor Sinel was a Visiting Researcher at Harvard Law School. She completed her doctorate in law (SJD) at the University of Toronto under the supervision of Ernest Weinrib. Research Highlights “The Substance of Remedies: Review of Stephen A. Smith, Rights, Wrongs, and Injustices: The Structure of Remedial Law” (2022) 72:1 University of Toronto Law Journal 125-147. “Consortium as a ‘Right’ in the Law of Torts” (2019) 93 Supreme Court Law Review (2d) 229-246. “What’s Your Damage? The Elimination of the Expert-Recognized Psychiatric Illness Requirement in the Canadian Law of Negligence: Saadati v Moorhead, [2017] 1 SCR 543 (2017)” 24 Torts Law Journal 205-217. “Allan Beever’s One-Dimensional Tort Universe: A Review Article of Allan Beever, A Theory of Tort Liability” (2017) 27:3 New Zealand Universities Law Review 807-834. “De-Ciphering Self-Help” (2017) 67:1 University of Toronto Law Journal 31-67. “Matter over Mind: Tort Law’s Treatment of Emotional Injury,” in Kit Barker, Karen Fairweather, and Ross Grantham, eds, Private Law in the 21st Century (Oxford: Hart Publishing, 2017) (co-author: Anne Schuurman) 439-461. “The Methods and Madness of Unjust Enrichment,” in Andrew Robertson and Michael Tilbury, eds, Divergences in Private Law (Oxford: Hart Publishing, 2016) 179-200. “Is Personal Injury Law Personal?” (2013) 6(1-2) Journal of Tort Law 145–172; (Online) 1932-9148, ISSN (Print) 2194-6515, DOI: 10.1515\/jtl-2015-0001, January 2015. Published Online: 2015-01-31. “Concerns about Corrective Justice” (2013) 26:1 Canadian Journal of Law and Jurisprudence 137-156. “Through Thick and Thin: The Place of Corrective Justice in Unjust Enrichment” (2011) 31:3 Oxford Journal of Legal Studies 551-564. “Initial Private Law Liability and Potential Defences: An Unnecessary Confusion (Perpetual Trustees v. Heperu)” [2010] Lloyd’s Maritime and Commercial Law Quarterly 13-19. “Causes of Action and Self-Help Remedies (BMP Global Distribution v. Bank of Nova Scotia)” [2009] 17 Restitution Law Review 122-132. Research areas: Private Law; Torts; Unjust Enrichment; Remedies; Legal Theory",
    "listed_research_areas":"Private Law; Torts; Unjust Enrichment; Remedies; Legal Theory"
  },
  {
    "faculty":"western",
    "name":"Elizabeth Steyn",
    "title":"Assistant Professor; Cassels Brock Fellow in Mining and Finance Law",
    "email":"esteyn2@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/elizabeth_steyn.html",
    "bio":"Elizabeth Steyn Academic Degrees: LL.D. (Université de Montréal), LL.M. (University of South Africa), BA\/LL.B. (University of Johannesburg) Email: esteyn2@uwo.ca Phone: 519-661-2111, ext. 81363 Office: LB 31 Elizabeth Steyn has been appointed the Cassels Brock Fellow in Mining and Finance Law, beginning May 1, 2018. Her appointment runs through until June 2020. Steyn will lead Western Law’s interdisciplinary sustainable development curriculum, including the Global Sustainability Certification and the Graduate Diploma in Mining Law, Finance, and Sustainability. “Elizabeth is a terrific addition to our mining law and sustainability program,” said Dean Erika Chamberlain. “She’s a talented academic who also brings a breadth of practical experience to her work. We are delighted that she will be joining us.” Steyn obtained her Doctorate in Law (LL.D.) at the Université de Montréal, where her research focussed on addressing conflicts that arise at the intersection of Indigenous sacred sites and natural resource development projects in Canada, the United States, Australia and New Zealand (2018: Dean’s Honour List and Mention of Excellence). Her research is a synthesis of comparative law, legal anthropology, Indigenous theory, and international law. Fluent in five languages, she is the author\/co-author of 12 articles\/book chapters in peer-reviewed publications. In 2016, Steyn spent four months as a Visiting Fellow at the Max Planck Institute for Social Anthropology, Department of Law and Anthropology in Halle (Saale), Germany, at the invitation of its Director, Professor Marie-Claire Foblets. She returned there for conference participation purposes in 2017, as well as in 2018. At present she is collaborating with Professor Foblets on two forthcoming books, one of which is the Oxford Handbook on Law and Anthropology. Originally from South Africa, she received her LL.M. cum laude (Council’s Award) from the University of South Africa, and graduated with a BA\/LL.B. cum laude from the University of Johannesburg, where she served on the Faculty of Law from 1994 to 2003. Steyn was admitted as an Advocate to the High Court of South Africa in 1994 and practiced in the natural resources and energy law, corporate law, corporate governance law, commercial law, and international trade law fields.",
    "listed_research_areas":null
  },
  {
    "faculty":"western",
    "name":"Thomas Telfer",
    "title":"Professor",
    "email":"ttelfer@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/thomas_telfer.html",
    "bio":"Thomas Telfer Academic Degrees: BA (Hons) (Western) 1985; JD (With Distinction) (Western) 1988; LLM (Duke) 1992; SJD (Toronto) 1999; Member of Law Society of Ontario (1990) Email: ttelfer@uwo.ca Phone: 519 661-2111 ext. 88379 Office: LB 16 Thomas Telfer is a Professor of Law at Western University in London, Ontario, Canada. He joined Western in 2002 from the University of Auckland where he taught for eight years. Professor Telfer’s research and teaching interests include bankruptcy law, mindfulness, commercial law, contracts and legal history. He has been a visiting professor at the University of Toronto, Osgoode Hall Law School, University of Melbourne, Case Western Reserve University, Victoria University of Wellington, University of Adelaide and the University of Auckland. Professor Telfer has published widely in the areas of insolvency law and legal history. He has a major interest in the intersection of history and bankruptcy law and is the author of Ruin and Redemption: A Struggle for Canadian Bankruptcy Law, 1867-1919 (Toronto: University of Toronto Press, Osgoode Society for Canadian Legal History, 2014). He is also the co-author (with Virginia Torrie) of: Debt and Federalism: Landmark Cases in Canadian Bankruptcy and Insolvency Law, 1894-1937 (UBC Press, 2022). He is the co-editor of the Canadian Business Law Journal and the Insolvency Institute of Canada Journal. He is a member of the Editorial Advisory Board for the Annual Review of Insolvency Law and the New Zealand Law Review. From 2018-2022 he held the position of Teaching Fellow from the Centre for Teaching and Learning. The purpose of the Fellowship was to develop mindfulness and mental health initiatives. In 2017, he introduced mindfulness as an optional first year course and in 2018 received a Leadership in Wellness Award of Recognition from Western for mindfulness education. From 2019-2022 he offered an upper year credit course: Mindfulness and the Legal Profession. Professor Telfer is currently working on a project that examines the legal history of bankruptcy law in Canada. Seeking graduate students in the following areas: Bankruptcy and insolvency, legal history, mindfulness and the legal profession. Research Highlights Books Thomas Telfer & Virginia Torrie, Debt and Federalism: Landmark Cases in Canadian Bankruptcy and Insolvency Law, 1894-1937 (UBC Press, 2021). Ruin and Redemption: A Struggle for Canadian Bankruptcy Law, 1867-1919 (Toronto: University of Toronto Press, Osgoode Society for Canadian Legal History, 2014). Stephanie Ben-Ishai & Thomas GW Telfer eds, Bankruptcy and Insolvency Law in Canada: Cases, Materials, and Problems (Toronto: Irwin Law, 2019). David Brown and Thomas Telfer, Personal and Corporate Insolvency Legislation: Guide and Commentary to the 2006 Amendments, 2nd ed. (Wellington: LexisNexis Butterworths New Zealand, 2013) (commentary 150 pp). Charles E.F. Rickett & Thomas G.W. Telfer eds., International Perspectives on Consumers’ Access to Justice (Cambridge University Press, 2003) (440 pp). Articles Jassmine Girgis and Thomas GW Telfer, The Fraudulent Misrepresentation and False Pretences Exception to the Bankruptcy Discharge: Balancing the Debtor’s Fresh Start with Confidence in the Credit System, [2022] Annual Review of Insolvency Law, 2022 CanLIIDocs 4295 Virginia Torrie & Thomas GW Telfer, \"Bankruptcy and Insolvency as an Expanding Field: A Historical Analysis of Reference Re Debt Adjustment Act, 1937 (Alta.)\" (2022) 59:4 Alberta Law Review 807-832. “Equitable Subordination Redux? Section 183 of the Bankruptcy and Insolvency Act and Respecting the ‘Legislative Will’ of Parliament” (2021) 64:3 Canadian Business Law Journal 316-341. “The New Bankruptcy ‘Detective Agency’? The Origins of the Superintendent of Bankruptcy in Great Depression Canada” (2020) 64:1 Canadian Business Law Journal 22-45. “Rediscovering the Bankruptcy and Insolvency Power: Political and Constitutional Challenges to the Bankruptcy Act, 1919-1929” (2017) 80:1 Saskatchewan Law Review 37-70. “Repeat Bankruptcies and the Integrity of the Canadian Bankruptcy Process” (2014) 55 Canadian Business Law Journal 231-262. “Ideas, Interests and Institutions and the History of Canadian Bankruptcy Law 1867-1880” (2010) 60 University of Toronto Law Journal 603-621. Thomas Telfer & Bruce Welling, “The Winding-Up and Restructuring Act: Realigning Insolvency Law’s Orphan to the Modern Insolvency Law Process” (2008) 24 Banking & Finance Law Review 235-270. “Transplanting Equitable Subordination: The New ‘Free-Wheeling’ Equitable Discretion in Canadian Insolvency Law?” (2001) 36 Canadian Business Law Journal 36-88. “Risk and Insolvent Trading” in C. Rickett and R. Grantham (eds.) Corporate Personality in the 20th Century (Oxford: Hart Publishing, 1998) pp 127-148. Book Reviews Review of Barry E.C. Boothman, Corporate Cataclysm: Abitibi Power & Paper and the Collapse of the Newsprint Industry, 1912-1946 (Toronto: University of Toronto Press, 2020) (2022) 39:4 Law and History Review 877-879. Review of Wounded Feelings: Litigating Emotions in Quebec, 1870-1950 (University of Toronto Press, 2019) (2021) 90:3 University of Toronto Quarterly 448-450. Research areas: Insolvency Law; Commercial Law; Contracts; Legal History; Mindfulness Education and Mental Health",
    "listed_research_areas":"Insolvency Law; Commercial Law; Contracts; Legal History; Mindfulness Education and Mental Health"
  },
  {
    "faculty":"western",
    "name":"Samuel Trosow",
    "title":"Associate Professor (On Sabbatical Leave)",
    "email":"strosow@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/sam_trosow.html",
    "bio":"Sam Trosow Academic Degrees: BA (Pennsylvania State University) 1974, JD (Southwestern University) 1978, MPA (California State University, Hayward) 1988, LLM (Golden Gate University) 1993, MLS (San Jose State University) 1994, PhD (UCLA) 2002. Email: strosow@uwo.ca Phone: 519 661-2111 ext. 82282 Office: LB 102 Professor Trosow joins the Faculty of Law in Fall 2001 and holds a joint appointment in the Faculty of Information and Media Studies. He previously taught part-time at the Golden Gate University School of Law, in the School of Library and Information Science at San Jose State University, in the School of Information Resources and Library Science at the University of Arizona, and at the People's College of Law in Los Angeles. He is a member of the California and United States Supreme Court Bars, and was previously engaged as a sole-practitioner in Los Angeles and Berkeley, California, in general civil litigation with an emphasis on tenants' rights law. He served as a Staff Attorney\/Clinical Instructor in the housing unit at the Berkeley Community Law Centre. From 1995 until joining the faculty, Professor Trosow was a librarian at the Boalt Hall School of Law (University of California, Berkeley). His doctoral work in the Department of Information Studies at UCLA focused on information policy issues. Research Highlights Trosow, S. \"Copyright Protection for Federally Funded Research: Necessary Incentive or Double Subsidy?\"(accepted for publication, Cardozo Arts & Entertainment Law Journal) Trosow, S. “Databases and the Fields of Law: Are There New Divisions of Labor?” (in press, Law Library Journal) Trosow, S. 2003. “Fast-Track Trade Authority and the Free Trade Agreements: Implications for Copyright Law,” Canadian Journal of Law & Technology 2(2): (July 2003). Trosow, S. 2003. \"The Illusive Search for Justificatory Theories: Copyright, Commodification and Capital,\" Canadian Journal of Law & Jurisprudence XVI(2): 217-41 (July 2003). Trosow, S. 2002. The Future of Fair-Use in the Electronic Environment. In Sigrun Klara Hannesdottir [Ed.], Global Issues in 21st Century Research Librarianship. Helsinki: NORDINFO 463-483 Trosow, S. 2001. Standpoint Epistemology as an Alternative Methodology for Library and Information Science, Library Quarterly 71 (3): 360-382, (July 2001) Trosow, S. 2001. Jurisdictional Disputes and the Unauthorized Practice Of Law: New Challenges for Law Librarianship, Legal Reference Services Quarterly 20(4): 1-18 Trosow, S. 2001. When is a Use a Fair Use? University Liability for Educational Copying, portal: Libraries and the Academy, 1.1: 47-57. Trosow, S. 2000. Organizational Theory in Library and Information Science Education, Journal of Education for Library and Information Science 41(2): 129-142(Spring 2000). Trosow, S. 2000. Review [Daniel Bell, The Coming of Post-Industrial Society: A Venture in Social Forecasting, reissued ed] Library Quarterly 70(3): 397-400. Trosow, S. 2000. 1999 Legislative Review: The Battle of the Database Bills,” Legal Information Alert 19(1): 1-4. (January 2000). Trosow, S. 1999. The Political Economy of Legal Information: The New Landscape. (editor of collection of articles simultaneously released as Legal References Services Quarterly 17 (1 & 2) Haworth Press, 1999. Articles: “Introduction: The Political Economy of Information: The New Landscape,” (pp 1-5) and “Economic Analysis and Copyright Law: Are New Models Needed in the Digital Age?” (pp 161-194).] Trosow, S. 1999. Copyright and the 105th Congress: A Review of its Legislation,Legal Information Alert 18 (1): 1-4. (January 1999). Research areas: Copyright Law; Media Law; Privacy; Municipal Law",
    "listed_research_areas":"Copyright Law; Media Law; Privacy; Municipal Law"
  },
  {
    "faculty":"western",
    "name":"Jeffrey Warnock",
    "title":"Assistant Professor",
    "email":"jwarnoc@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/jeffrey_warnock.html",
    "bio":"Jeffrey Warnock Academic Degrees: Hons. B.A. (University of Waterloo) 2009, J.D. (Western University) 2012, LL.M (Western University) 2021. Email: jwarnoc@uwo.ca Phone: 519-661-2111 x82258 Office: LB 120D Jeffrey (Jeff) Warnock joined the Faculty of Law in 2021 as a Visting Professor and was appointed an Assistant Professor in 2022. Jeff's research focuses on aboriginal law, constitutional law, Indigenous legal traditions, and public international law (specifically as it pertains to Indigenous peoples). Jeff is the instructor for the Indigenous law course as well as the coach for Western’s Kawaskimhon Talking Circle moot team. Jeff holds an undergraduate degree in Political Science from the University of Waterloo, a J.D. from Western, and an LL.M from Western. Jeff's LL.M examined the UN Declaration on the Rights of Indigenous Peoples and the interpretation of the principle of Free, Prior, and Informed Consent (FPIC), with a particular focus on the relationship between FPIC and Indigenous legal traditions. Jeff is a citizen of the Métis Nation of Ontario and prior to joining Western worked as a litigator, a public policy advisor, and on student programs and diversity outreach initiatives for a large national law firm. Research Highlights",
    "listed_research_areas":null
  },
  {
    "faculty":"western",
    "name":"Wade Wright",
    "title":"Associate Professor (On Sabbatical Leave)",
    "email":"wwright8@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/wade_wright.html",
    "bio":"Wade Wright Academic Degrees: Hons. B. Mus. (WLU), M.A. (Western), LL.B. (Osgoode), LL.M. (Cambridge), J.S.D. (Columbia) Email: wwright8@uwo.ca Phone: 519-661-2111, ext. 81560 Office: LB 111 Professor Wade Wright joined Western Law in July 2016. His primary areas of research interest are Canadian and comparative constitutional law, with a focus on federalism and extrajudicial constitutionalism. He also has active research interests in administrative law, Crown liability and law and sexuality. Wade’s research has been published widely in edited collections and peer-reviewed journals, and presented at major conferences and workshops in both Canada and abroad. He is a co-author, with Peter W. Hogg and Patrick Monahan, of Liability of the Crown, 4th ed. (Toronto: Carswell, 2011), the leading treatise on the topic in Canada. His work has been cited often by courts across Canada, including various times by the Supreme Court of Canada. In 2019, he was awarded the Western Law Dean’s Research Fellowship, to support his research project “Democracy and Dissent in Canada’s Federal System: Lessons from the Interprovincial Pipeline Debate.” In 2021, he won Western Law’s teaching award, the Award for Teaching Excellence. In 2020, Wade agreed to assume the authorship of Peter Hogg’s seminal Constitutional Law of Canada treatise, which is the most cited book in the decisions of the Supreme Court of Canada. In this role, Wade is responsible for preparing the yearly updates to the treatise, which is published as both a two-volume, loose-leaf book (comprising 60 chapters) and as an abridged annual student edition. His first update to the treatise was published in August 2021. Wade earned his doctorate in law (JSD) at Columbia Law School, with the support of a SSHRC Doctoral Fellowship and a Viscount Bennett Fellowship; his masters in law (LLM) at the University of Cambridge, with the support of a Rt. Hon. Paul Martin Sr. Scholarship; and his law degree (LLB) at Osgoode Hall Law School of York University, where he was awarded the Gold Medal (for attaining the highest standing in his graduating class) and a variety of other awards. Prior to joining Western Law, Wade served as a law clerk for Chief Justice Beverley McLachlin at the Supreme Court of Canada, taught courses at Columbia Law School (as an Associate in Law) and Osgoode Hall Law School, and was a SSHRC Postdoctoral Fellow at the University of Toronto. He was called to the Bar of Ontario in 2004, and before pursuing an academic career, practiced civil and public law litigation at Blake, Cassels & Graydon LLP in Toronto, where he worked on cases before all levels of court, including the Supreme Court of Canada. Wade is the Co-director of Western Law’s Public Law Research Group, and also co-organizes the annual Coxford Lecture, which is devoted to exploring the rule of law. Learn more about the work of the Public Law Research Group and the Coxford Lecture Series. Seeking graduate students in the following areas: Constitutional law, particularly federalism and extrajudicial constitutionalism; administrative law; Crown liability; and law and sexuality. Selected Research Highlights Peter W. Hogg & Wade K. Wright, Constitutional Law of Canada, 5th ed. (Toronto: Thomson Reuters\/Carswell, 2007+, loose-leaf version) (single author of the 2022 update). Peter W. Hogg & Wade K. Wright, Constitutional Law of Canada, 2022 Student Edition (Toronto: Thomson Reuters, 2022). Peter W. Hogg and Wade K. Wright, Constitutional Law of Canada, 5th ed. (Toronto: Thomson Reuters\/Carswell, 2007+, loose-leaf version) (single author of the 2021 update). Peter W. Hogg and Wade K. Wright, Constitutional Law of Canada, 2021 Student Edition (Toronto: Thomson Reuters, 2021). Wade K. Wright, “Against Privileging the Charter: The Case of Federal Pre-enactment Constitutional Review” (2020-2021) 25 Rev Const Stud 49-78. Wade K. Wright, “Canadian Federalism’s Underlying Question: What It Is and Why It Matters” (2020) 53(2) UBC Law Rev 531. Wade K. Wright, “Provincial Non-enforcement of Constitutionally Suspect Federal Criminal Laws,” in Richard Albert, Paul Daly & Vanessa MacDonnell, eds., The Canadian Constitution in Transition (Toronto: University of Toronto Press, 2019). Wade K. Wright, “Federalism(s) in the Supreme Court of Canada During the McLachlin Years,” Daniel Jutras & Marcus Moore, eds. (2018) 86 SCLR (2d) 207. (Reprinted in Daniel Jutras & Marcus Moore, eds., Canada’s Chief Justice: Beverley McLachlin’s Legacy of Law and Leadership (Markham: LexisNexis, 2018).) Wade K. Wright, “The Political Safeguards of Canadian Federalism” (2016) 36 NJCL 1-72. Wade K. Wright, “Courts as Facilitators of Intergovernmental Dialogue: Cooperative Federalism and Judicial Review” (2016) 72 SCLR (2d) 365-454. Wade K. Wright, “Of Banks, Federalism and Clear Statements: Comment on Bank of Montreal v. Marcotte”, Benjamin Berger & Sonia Lawrence, eds., (2015) 71 SCLR (2d) 185-225. Peter W. Hogg, Patrick J. Monahan & Wade K. Wright, Liability of the Crown, 4th ed. (Toronto: Carswell, 2011). Wade K. Wright, “Facilitating Intergovernmental Dialogue: Judicial Review of the Division of Powers in the Supreme Court of Canada”, Jamie Cameron & Bruce Ryder, eds., (2010) 51 SCLR (2d) 625-693. Peter W. Hogg, Allison A. Bushell Thornton & Wade K. Wright, “Charter Dialogue Revisited – Or Much Ado About Metaphors” (2007) 45(1) Osgoode Hall LJ 1-65. Peter W. Hogg, Allison A. Bushell Thornton & Wade K. Wright, “Reply to Charter Dialogue Revisited” (2007) 45(1) Osgoode Hall LJ 193-202. Wade K. Wright, “The Tide in Favour of Equality: Same-Sex Marriage in Canada and England and Wales” (2006) 20 Inter J Law Pol’y and the Family 249-285. Peter W. Hogg & Wade K. Wright, “Canadian Federalism, the Privy Council and the Supreme Court: Reflections on the Debate About Canadian Federalism” (2005) 38(2) UBC Law Rev 329-352. Research areas: Constitutional Law; Federalism; Administrative Law; Crown Liability; Law and Sexuality",
    "listed_research_areas":"Constitutional Law; Federalism; Administrative Law; Crown Liability; Law and Sexuality"
  },
  {
    "faculty":"western",
    "name":"Andy Yu",
    "title":"Assistant Professor",
    "email":"andy.yu@uwo.ca",
    "href":"https:\/\/law.uwo.ca\/about_us\/faculty\/andy_yu.html",
    "bio":"Andy Yu Academic Degrees: BA (McGill), BPhil (Oxford), DPhil (Oxford), JD (Toronto) Email: andy.yu@uwo.ca Phone: 519 661-2111 x89006 Office: LB 100D Andy Yu is an assistant professor at Western Law. His background in philosophical logic and the philosophy of language informs his interests in jurisprudence, as well as constitutional law, administrative law and property law. He is particularly interested in popular sovereignty, big tech and legal interpretation. Before joining Western Law in 2022, he worked on a wide range of civil and criminal matters while clerking at the Court of Appeal for Ontario and the Supreme Court of Canada and while summering and articling at Paliare Roland LLP. He completed his law degree at the University of Toronto and his doctorate at the University of Oxford. Website: https:\/\/andydfyu.com\/ Research Highlights “Torts and Contracts: Civil Liability for AI Causing Harms” (with Ren Bucholz), Litigating Artificial Intelligence (Emond, 2021), chapter 9 “Delegated Legislation and the Charter” (2020) 33:1 Canadian Journal of Administrative Law & Practice 49 “Equity and Homelessness” (2020) 33:1 Canadian Journal of Law & Jurisprudence 245 “Direct Discrimination and Indirect Discrimination: A Distinction with a Difference” (2019) 9:2 Western Journal of Legal Studies 1 Research areas: Jurisprudence; Constitutional Law; Administrative Law; Property Law; Intellectual Property; Privacy Law",
    "listed_research_areas":"Jurisprudence; Constitutional Law; Administrative Law; Property Law; Intellectual Property; Privacy Law"
  }
]