[
  {
    "faculty":"windsor",
    "name":"Paul Ocheje",
    "title":"Associate Dean (Research and Graduate Studies)",
    "email":"pocheje@uwindsor.ca",
    "href":"http:\/\/www.uwindsor.ca\/law\/pocheje\/",
    "bio":"Professor Paul D. Ocheje joined the Faculty in July 2000. Prior to joining the Faculty, he taught at the University of Benin Law School, Nigeria. He was also State Counsel, Ministry of Justice, Kano State, Nigeria.  Dr. Ocheje’s research interests include public and private international law, international criminal law, human rights, law and development, global governance, consumer protection, and property law. He teaches or has taught the following courses: property law, access to justice, insurance law, and law and development.  Key Works  Neoliberal Economic Reforms and the Realization of Social and Economic Rights in Africa (forthcoming), African Yearbook of International Law (2008). “In the Public Interest”: Forced Evictions, Land Rights, and Human Development in Africa, Journal of African Law, Vol.51(2), 173-214 (2007). Refocusing International Law on the Quest for Accountability in Africa: The Case Against the “Other” Impunity, 15 Leiden Journal of International Law 749-779 (2002). Law and Social Change: A Socio-Legal Analysis of Nigeria’s Corrupt Practices and Other Related Offences Act, 2000, Journal of African Law, Vol.45(2), 173-195 (2001).   In The News    Teacher Lives Dream in City Dr. Paul Ocheje Delivers Inaugural Sonny Iwedike Odogwu Memorial Lecture Ocheje to speak at international conference on peace and security Battle against corruption is truly global  Prof. Ocheje to Deliver Paper on Social and Economic Rights in Africa Research areas: International Development Law; Public International Law; Global Governance; International Human Rights; Socio-Legal Theory\/Law And Social Change; Property Law",
    "listed_research_areas":"International Development Law; Public International Law; Global Governance; International Human Rights; Socio-Legal Theory\/Law And Social Change; Property Law"
  },
  {
    "faculty":"windsor",
    "name":"Chris Fredette",
    "title":"Associate Dean (Academic)",
    "email":"fredette@uwindsor.ca",
    "href":"https:\/\/www.uwindsor.ca\/business\/430\/chris-fredette-bio",
    "bio":"Chris Fredette, Ph.D. Associate Dean Academic, Faculty of Law Professor, Strategy & Entrepreneurship fredette@uwindsor.ca 519-253-3000 ext. 3072 Office: OB 449 Education    Ph.D.  Schulich School of Business, York University, Toronto Canada, 2009. M.B.A.  Odette School of Business, University of Windsor, Windsor, ON, 2004. B.A.  University of Windsor, Windsor, ON, Commerce, 2003.  Professional Memberships\/Affiliations (Active)    Canadian Association of University Teachers - Board Member, 2018-2021 Ontario Confederation of University Faculty Associations, 2018-2020  Research    Diversity and inclusion Governance Non-profit Organizational capabilities and routines Social capital and social networks  Selected Publications     Fredette, C. & Bernstein, R. (2021).  Governance effectiveness: The interaction of ethno-racial diversity and social capital. Nonprofit and Voluntary Sector Quarterly, http:\/\/doi.org\/10.1177\/0899764020977698. [January] Fredette, C., & Bernstein, R. (2019).  Ethno-racial diversity on nonprofit boards: A critical mass perspective.   Nonprofit and Voluntary Sector Quarterly, http:\/\/doi.org\/10.1177\/0899764019839778. Fredette, C., Bradshaw, P., & Krause, H. (2015).  From diversity to lnclusion: A multi-method study of diverse governing groups.   Nonprofit and Voluntary Sector Quarterly, 45 (IS), 28S-51S, http:\/\/doi.org\/10.1177\/0899764015599456.  Complete Curriculum Vitae",
    "listed_research_areas":null
  },
  {
    "faculty":"windsor",
    "name":"Wissam Aoun",
    "title":"Assistant Professor",
    "email":"waoun@uwindsor.ca",
    "href":"https:\/\/www.uwindsor.ca\/law\/Wissam-Aoun",
    "bio":"Wissam Aoun joined the Faculty of Law in July 2019 as an Assistant Professor. In April 2021, he began a three-month term as Acting Associate Dean (Academic). His main areas of research interest include intellectual property law, with a focus on patent law, as well as professional regulation and governance. Wissam has previously taught in all areas of intellectual property, including copyright law, trademark law and patent law. He has also taught in the area of corporate law, including experiential courses covering corporate practice and contract drafting, and teaches administrative law. Wissam is a highly-accomplished intellectual property clinician, with over ten years of international intellectual property clinical experience. He was the founding Director of the International Intellectual Property Clinical Program, a USPTO Certified Patent and Trademark Clinic and the world’s first international intellectual property clinic, operated jointly between Canada and the U.S. Prior to joining Windsor Law, he was Associate Professor of Law at Detroit Mercy Law, and IP clinical director of the CEL and LTEC Clinics at Windsor Law. Wissam has won numerous teaching and scholarly awards. He was twice awarded the Hon. Justice Robert Abbey Award for Outstanding Special Lecturer at Windsor Law. In 2018, he was awarded the University of Detroit Mercy University Faculty Achievement Award in recognition of his achievements with the International Intellectual Property Clinical Program. He has been awarded the Social Sciences and Humanities Research Council of Canada (SSHRC) Joseph Armand Bombardier Canada Graduate Scholarship and recently received funding from Innovation, Science and Economic Development Canada (ISED) IP Strategy grant in support of his forthcoming intellectual property clinical text. He has collaborated on research, education and training projects with IP institutions around the world, including the USPTO, the European Patent Office (EPO), the World Intellectual Property Organization (WIPO) and the Canadian Intellectual Property Office (CIPO). In addition, he has been a visiting researcher at Oxford University Faculty of Law and the Max Planck Institute for Innovation and Competition as well as a guest clinical lecturer at Queen Mary, University of London.  Wissam holds a JD and LLM from Windsor Law, and is currently completing his PhD at Osgoode Hall Law School under the supervision of Professor David Vaver. Research areas: Intellectual Property Law; Patent Law ; Professional Regulation",
    "listed_research_areas":"Intellectual Property Law; Patent Law ; Professional Regulation"
  },
  {
    "faculty":"windsor",
    "name":"Jeff Berryman",
    "title":"Distinguished University Professor",
    "email":"jberrym@uwindsor.ca",
    "href":"http:\/\/www.uwindsor.ca\/law\/berryman\/",
    "bio":"Jeff Berryman is a Distinguished University Professor and Professor of Law, former Associate Vice-President Academic and former Dean of the Faculty of Law, University of Windsor, Canada, where he has been for the past 35 years. In addition, he holds an Honourary Professorship of Law, Faculty of Law, University of Auckland, N.Z. A specialist in remedies, he also teaches contract law, trusts and restitution. He is the author of “The Law of Equitable Remedies” (Irwin Publishing – Essentials of Canadian Law series), now in its second edition, and is the co-ordinating editor and contributing author of Berryman et al, “Remedies: Cases and Materials” now in its 8th ed., published by Emond Montgomery. His published articles have appeared in journals in Canada, Australia, New Zealand, The United States, and England. He has advised the New Zealand Ministry of Justice, Ontario Law Reform Commission, and the Federal Court of Canada. He is a recipient of the Law Society Medal, member of the Law Society of Ontario, and a barrister and solicitor of the High Court of New Zealand.   Scholarships and Fellowships   2012 (August), Visiting Scholarship, Faculty of Law, University of Tasmania, Tasmania, Australia. 2012 (March-June), Visiting Fellow, Clare Hall, Cambridge University, UK. 2011 (September-October), Erskine Visiting Fellowship, College of Business and Economics, Canterbury University, Christchurch, New Zealand. 2008, Erskine Visiting Fellowship, College of Business and Economics, Canterbury University, Christchurch, N.Z. 1980, Dalhousie Graduate Fellowship. 1980, Spencer Mason Traveling Scholarship in Law",
    "listed_research_areas":null
  },
  {
    "faculty":"windsor",
    "name":"Irina Ceric",
    "title":"Assistant Professor",
    "email":"Irina.Ceric@uwindsor.ca",
    "href":"https:\/\/www.uwindsor.ca\/law\/3049\/irina-ceric-assistant-professor",
    "bio":"Irina Ceric (she\/her) joined the Faculty of Law as an Assistant Professor in July of 2022. Prof. Ceric holds a PhD from Osgoode Hall Law School and comes to Windsor Law with a wealth of teaching, practice, and community experience. She is called to the Bars of British Columbia, Ontario, and New York.  Prof. Ceric’s core research interests lie in the intersection of law and social movements, with a particular focus on the regulation and criminalization of dissent by movements for social and environmental justice and Indigenous sovereignty. She has written extensively about the use of injunctions and contempt of court, a research interest that arose out of her work as a lawyer and legal support organizer. Prof. Ceric is currently at work on a book, based on her doctoral research, tracing the history and politics of the movement defence in Canada and the US since the late 1990s. Her research employs activist-scholar methodologies and draws on scholarly literature from both law scholarship and related disciplines, including law and society, social movement studies, clinical legal education, and abolitionism.   Prof. Ceric teaches Property Law and Access to Justice and her publications are available at academia.edu. Research areas: Law And Social Movements; Access To Justice; Movement Lawyering; Law And Society; Aboriginal Law; Property Law; Protest Policing",
    "listed_research_areas":"Law And Social Movements; Access To Justice; Movement Lawyering; Law And Society; Aboriginal Law; Property Law; Protest Policing"
  },
  {
    "faculty":"windsor",
    "name":"Pascale Chapdelaine",
    "title":"Associate Professor",
    "email":"chapdel@uwindsor.ca",
    "href":"http:\/\/www.uwindsor.ca\/law\/chapdel\/",
    "bio":"Pascale Chapdelaine is Associate Professor at the Faculty of Law, University of Windsor. She holds an LL.B. and B.C.L. from Mc Gill University, an LL.M from the K.U. Leuven (Belgium), and a Ph.D. from Osgoode Hall Law School (York University). Prior to joining the Faculty of Law in 2014, she practised law for over fourteen years in corporate, commercial, and intellectual property law as Vice-President and legal counsel at one of Canada’s largest telecommunication companies, and prior to that, as Associate at a major Montréal-based law firm. Her broad research interests in law, technology, and society span various subjects at the intersection of copyright, contracts, property, privacy law, e-commerce, from the perspective of consumers and citizens. Her book Copyright User Rights, Contracts and the Erosion of Property (Oxford University Press, 2017) defines the rights of consumers and other users to works protected by copyright (e.g. books, software, music, films) in ever changing technological environments. Some of her more recent research looks at algorithmic business practices and extraction of personal data, and how this leads to price and other forms of personalisation or discrimination in e-commerce, media content, and social media. Her articles have appeared in leading national and international law journals. She is the lead editor of a recent interdisciplinary special issue on the application of media and communication theory to the regulation of the networked information society. Professor Chapdelaine frequently takes part in various law reform consultations related to her research and expertise. Professor Chapdelaine teaches contracts, copyright law, privacy law, and consumer law, courses in which she integrates both her academic research and years of law practice experience. She invites students to think critically about law from various theoretical frameworks and perspectives. She has held several teaching and fellowship appointments at international institutions, including the K.U. Leuven Faculty of Law (Belgium), the University of Oxford, Faculty of Law (OIPRC, St-Peter’s College), the Faculty of Law at the University of Toronto, the Faculty of Law at the University of Otago (New Zealand), and the Weizenbaum Institute for the Networked Society (Germany). Pascale Chapdelaine is Co-Founder of Windsor Law LTEC Lab (www.lteclab.com). As former Chair, she organized several symposia and workshops that brought together scholars of various disciplines, law practitioners, policy makers and students to discuss pressing regulatory issues around technological developments from an access to justice \/ law and society perspective. She is a Research Affiliate of IP Osgoode and is a member of the International Association for the Advancement of Teaching and Research in Intellectual Property (ATRIP). She is called to the Bar of Ontario and le Barreau du Québec. Sa langue maternelle est le français et elle parle aussi couramment le néerlandais (Dutch). Research areas: Contracts; Intellectual Property; Consumer Law",
    "listed_research_areas":"Contracts; Intellectual Property; Consumer Law"
  },
  {
    "faculty":"windsor",
    "name":"Patricia Galvão Ferreira",
    "title":"Assistant Professor",
    "email":"Patricia.Galvao@uwindsor.ca",
    "href":"https:\/\/www.uwindsor.ca\/law\/Patr%C3%ADcia-Galv%C3%A3o-Ferreira",
    "bio":"Patrícia Galvão Ferreira joined the Faculty of Law as an Assistant Professor in transnational law in July 2018, after one year as the Law Foundation of Ontario Scholar. She is the Director of the Transnational Environmental Law and Policy Clinic at Windsor Law and a member of the Transnational Law and Justice Network. Galvao Ferreira holds an SJD from the University of Toronto Faculty of Law, an LLM from Notre Dame University Faculty of Law and a BA from Federal University of Bahia in Brazil. Professor Galvão Ferreira broad research interests include international law, transnational law, environmental law (and policy), global governance, law and development, rule of law, natural resources law, human rights law, food and drug law (and policy), climate change law (and policy) and sustainability studies. Her most recent publications are in the topics of international environmental law and climate justice, climate finance law, climate litigation, global governance and natural resources law, and the intersection between international environmental law and indigenous rights. She co-edited the 4th Edition of the Canadian Environmental Law and Policy coursebook published by Emond in 2020. Currently, Professor Galvão Ferreira is collaborating with Windsor Law Professor Anneke Smith on the Cities and Climate Forum, which received the support of a federal grant in 2020. Research areas: Law And Society; Transnational Climate Law; Climate Justice; Climate Finance Law; Climate Technology Law; Transnational Environmental Law; Environmental Law And Policy; Natural Resources Law; Law And Development; Rule Of Law; Global Governance; Human Rights Law",
    "listed_research_areas":"Law And Society; Transnational Climate Law; Climate Justice; Climate Finance Law; Climate Technology Law; Transnational Environmental Law; Environmental Law And Policy; Natural Resources Law; Law And Development; Rule Of Law; Global Governance; Human Rights Law"
  },
  {
    "faculty":"windsor",
    "name":"Beverly Jacobs",
    "title":"Currently on secondment to President's Office",
    "email":"beverly.jacobs@uwindsor.ca",
    "href":"https:\/\/www.uwindsor.ca\/law\/Beverly-Jacobs",
    "bio":"Dr. Beverly Jacobs is the Senior Advisor to the President on Indigenous Relations and Outreach at the University of Windsor and an Associate Professor in the Faculty of Law. She held Associate Dean (Academic) and Acting Dean appointments in the Faculty of Law. She practices law part-time at her home community of Six Nations of the Grand River Territory. Her research focuses on Indigenous Legal Orders, Indigenous Wholistic Health, Indigenous Research Methodologies, and Decolonization of Eurocentric Law. Beverly has obtained a Bachelor of Law Degree from the University of Windsor in 1994, a Master of Law Degree from the University of Saskatchewan in 2000 and a PhD from the University of Calgary in 2018.  Beverly is also a consultant\/researcher\/writer\/public speaker.  Her work centres around ending gendered colonial violence against Indigenous people and restoring Indigenous laws, beliefs, values, and traditions. A prolific scholar, her published work has earned her numerous awards; her research combined with her advocacy has translated into national and international recognition.  Dr. Jacobs is a former President of the Native Women’s Association of Canada (elected 2004 to 2009). She is nationally known for her work and commitment to Indigenous politics in Canada, is universally respected in this regard, and is understood to be a tireless and formidable advocate. She is a leading voice and an expert with respect to a multitude of issues facing Indigenous people in her community, in Ontario, across Canada and on an international scale. Dr. Jacobs received the Laura Legge Award from the Law Society of Ontario in 2021 and she was inducted as a Member of the Order of Canada in 2018. She received two awards from Mohawk College in 2018: Alumni of Distinction Award and Distinguished Fellow – Adjunct Professor. In her first year of teaching at the Faculty of Law, University of Windsor in 2017, she received an Office of Human Rights, Equity & Accessibility, Human Rights and Social Justice Award. In 2016, she received a Franco-German Prize for Human Rights and the Rule of Law from the Governments of France and Germany for her human rights fight for the issues relating to missing and murdered Indigenous women and girls in Canada. In 2008, she also received a Governor General’s Award in Commemoration of the Person’s Case, an Esquao Award from the Institute for the Advancement of Aboriginal Women and a Canadian Voice of Women of Peace Award from the Canadian Department of Peace Initiative and Civilian Peace Service Canada. File Attachments:  Attachment   jacobs_cv.pdf Research areas: Indigenous Legal Orders; Indigenous Wholistic Health; Indigenous Research Methodologies; Decolonization Of Eurocentric Law",
    "listed_research_areas":"Indigenous Legal Orders; Indigenous Wholistic Health; Indigenous Research Methodologies; Decolonization Of Eurocentric Law"
  },
  {
    "faculty":"windsor",
    "name":"Laverne Jacobs",
    "title":"Professor",
    "email":"ljacobs@uwindsor.ca",
    "href":"http:\/\/www.uwindsor.ca\/law\/ljacobs\/",
    "bio":"Laverne Jacobs, PhD Full Professor  Laverne Jacobs is a full Professor at the University of Windsor, Faculty of Law and a former Associate Dean (Research & Graduate Studies). She teaches, researches and writes in the areas of disability rights law, administrative law, human rights law, and administrative justice. Her work is characterized by an interest in the everyday work of the administrative justice system and in the lived experiences of the people who use it. Dr. Jacobs has held public appointments on boards, committees and tribunals.  She has published and presented widely in her fields, both in Canada and internationally. Dr. Jacobs is the recipient of a number of awards including the CBA Touchstone Award (2021) and the Canadian Association of Law Teachers (CALT) Academic Excellence Award (2022). Dr. Jacobs founded and directs The Law, Disability & Social Change Project,  a research and public advocacy centre at Windsor Law that works to foster and develop inclusive communities. She also currently serves as Co-Director of the Disability Rights Working Group at Berkeley Law’s Center for Comparative Equality & Anti-Discrimination Law. She has served on the Board of Directors of the Income Security Advocacy Centre and the Canadian Institute for the Administration of Justice. In June 2022, Professor Jacobs was elected to the United Nations Committee on the Rights of Persons with Disabilities. The Committee monitors the implementation of the Convention on the Rights of Persons with Disabilities by countries that have ratified it. UN CRPD Committee members are independent experts selected from countries around the globe. Dr. Jacobs is the first-ever Canadian to be elected to serve on the United Nations CRPD Committee, and her election is historic for that reason. Select Publications Laverne Jacobs, “Access to Post-secondary Education in Canada for Students with Disabilities” (2023) International Journal of Discrimination and the Law (forthcoming). Laverne Jacobs and Sule Tomkinson, \"Examining the Social Security Tribunal’s Navigator Service: Access to Administrative Justice for Marginalized Communities\" (Research Report, 2022). Laverne Jacobs, \"Ward: A Missed Opportunity for the Supreme Court of Canada to Denounce Bullying of Children with Disabilities and to Promote Substantive Equality\", (Oxford Human Rights Hub Blog, Nov. 26, 2021).   Books Laverne Jacobs, Ruby Dhand, David Ireland, Richard Jochelson, Freya Kodar and Odelia Bay, Law and Disability in Canada: Cases and Materials (Lexis-Nexis, 2021). Laverne Jacobs, Martin Anderson, Rachel Rohr, Tom Perry, The Annotated Accessible Canada Act (2021) - published open access on CanLII and on the Law, Disability & Social Change Project website. Laverne Jacobs & Sasha Baglay, eds., The Nature of Inquisitorial Processes in Administrative Regimes: Global Perspectives (Surrey, UK: Ashgate, 2013) 416pp. Laverne A. Jacobs & Justice Anne L. Mactavish., eds., Dialogue Between Courts and Tribunals – Essays in Administrative Law and Justice (2001-2007) (Montreal: Les Éditions Thémis, 2008) 398pp. (Full-text available here)   Articles and Book Chapters Laverne Jacobs, \"The Universality of the Human Condition: Theorizing Transportation Inequality Claims by Persons with Disabilities in Canada 1976-2016\" (2018) 7 Canadian Journal of Human Rights pp. 35-66. Laverne Jacobs, \"The Dynamics of Independence, Impartiality, and Bias in the Canadian Administrative State​\" in Administrative Law in Context, 3d edition, Colleen M. Flood & Lorne Sossin eds. (Toronto: Emond Montgomery, 2018). Laverne Jacobs, \"‘Humanizing’ Disability Law:  Citizen Participation in the Development of Accessibility Regulations in Canada\" (2016) Revue Internationale des Gouvernements Ouverts, pp. 93-120. Laverne Jacobs,  \"The Accessibility for Manitobans Act: Ambitions and Achievements in Antidiscrimination and Citizen Participation,\" (2016) Canadian Journal of Disability Studies, Vol 5, No 4 , pp. 1-24 (with Britney DeCosta and ​Victoria Cino)​. Laverne Jacobs, \"From Rawls to Habermas: Toward A Theory of Grounded Impartiality  in Canadian Administrative Law\" (2014) 51(2) Osgoode Hall Law Journal 543-594. Research areas: Administrative Law; Disability Rights; Socio-Legal Theory; Empirical Research; Freedom Of Information; Human Rights; Comparative Administrative Law ; Government Accountability; Government Transparency",
    "listed_research_areas":"Administrative Law; Disability Rights; Socio-Legal Theory; Empirical Research; Freedom Of Information; Human Rights; Comparative Administrative Law ; Government Accountability; Government Transparency"
  },
  {
    "faculty":"windsor",
    "name":"Danardo Jones",
    "title":"Assistant Professor",
    "email":"Danardo.Jones@uwindsor.ca",
    "href":"https:\/\/www.uwindsor.ca\/law\/Danardo-Jones",
    "bio":"Danardo Jones joined the Faculty of Law as an Assistant Professor in January 2021. Professor Jones comes to the Faculty with years of criminal law experience, having worked as a staff lawyer at various Legal Aid organizations across Eastern Canada (Newfoundland and Labrador and Nova Scotia) and Ontario. He was also the Director of Legal Services for the African Canadian Legal Clinic. In that role, he intervened in precedent-setting cases before the Supreme Court of Canada (Tran v. Canada (Public Safety and Emergency Preparedness), 2017 SCC 50; British Columbia Human Rights Tribunal v. Schrenk, 2017 SCC 62). Professor Jones's research interests include criminal law, criminal procedure, criminal sentencing, and race and the law. His research draws on scholarly literature from law and cognate disciplines, including penology and criminology, law and geography, philosophy of law, critical race theory, and prison abolitionist and restorative justice literature. Research areas: Criminal Law; Criminal Procedure; Criminal Sentencing; Race And The Law",
    "listed_research_areas":"Criminal Law; Criminal Procedure; Criminal Sentencing; Race And The Law"
  },
  {
    "faculty":"windsor",
    "name":"Jasminka Kalajdzic",
    "title":"Associate Professor",
    "email":"kalajj@uwindsor.ca",
    "href":"http:\/\/www.uwindsor.ca\/law\/kalajj\/",
    "bio":"Biography Jasminka Kalajdzic is an Associate Professor and Founding Director of the Class Action Clinic at Windsor Law. She joined the Faculty of Law in 2009 after twelve years in private practice as a civil litigator. Professor Kalajdzic teaches Evidence, Class Actions and the Class Action Clinic seminar. Her current research focuses on access to justice and class actions. She has published two books and dozens of peer-reviewed articles, book chapters and reports on all aspects of class action litigation, among other topics. Professor Kalajdzic regularly makes presentations to the bench and the bar, both in Canada and abroad. In 2015, she published the Law of Class Actions in Canada (Carswell), a text co-authored with the Honourable Warren K. Winkler, Justice Paul Perell, and Alison Warner. In 2016, she prepared significant updates to the National Judicial Institute's Bench Book on Class Actions and in 2018, she published \"Class Actions in Canada: The Promise and Reality of Access to Justice\" (UBC Press). Professor Kalajdzic served three years as the Articles Editor for the Windsor Yearbook of Access to Justice, the faculty's refereed law journal, and six years as a member of the Law Foundation of Ontario's Class Proceedings Committee. She was co-principal researcher and co-author of the Law Commission of Ontario's Class Action Report, published in 2019. She also served on the Academic Expert Panel for the Australia Law Reform Commission's 2018 Report on Class Actions and Litigation Funding. Professor Kalajdzic was appointed Associate Dean in 2016-17. In 2021, she was awarded the inaugural OBA Excellence in Class Actions Award, and the University of Windsor's Alumni Association Award for Distinguished Contributions to University Teaching. In 2023, she was honoured by the Ontario Bar Association for her \"significant contributions to access to justice.\" Research areas: Access To Justice; Class Actions; Evidence; On Sabbatical Leave January - June 2023",
    "listed_research_areas":"Access To Justice; Class Actions; Evidence; On Sabbatical Leave January - June 2023"
  },
  {
    "faculty":"windsor",
    "name":"Muharem Kianieff",
    "title":"Associate Professor",
    "email":"kianieff@uwindsor.ca",
    "href":"https:\/\/www.uwindsor.ca\/law\/Muharem-Kianieff",
    "bio":"Muharem Kianieff has been a member of the University of Windsor Faculty of Law since August 2008.  Professor Kianieff teaches and writes in the area of corporate and commercial law and is a member of Windsor Law's Law and Technology (LTEC) Lab.  His research looks at the role that regulation plays as it applies to innovations in payment mechanisms and financial technology. By using economic and historical analyses, Professor Kianieff seeks to make proposals for reform that make products safer for consumers and increases access to justice.  Professor Kianieff’s current work focusses on Fintech, Blockchain technologies, cryptocurrencies, payment mechanisms, consumer protection, privacy and financial reform.  He is the author of the recent Informa Law book, “Blockchain Technology and the Law: Opportunities and Risks.” He is also the author of a number of articles that have been published by leading Canadian Law Reviews and has co-authored a piece (with Professor Benjamin Geva) for the International Monetary Fund.  Professor Kianieff has previously attended Trent University where he completed a double major BA (Hons.) degree in political science\/economics and graduated with the J.J. Robinette Prize.  He then received his legal education from The Osgoode Hall Law School of York University.  Professor Kianieff returned to Osgoode to complete his PhD writing his dissertation on Consumer Retail Electronic payments that were emerging in the early dot com era. While on sabbatical in 2018, Professor Kianieff served as a Grotius Research Scholar at the University of Michigan Law School. This is a competitive program that allows individuals to conduct research at the law school. It is open to scholars from around the world that are selected on the basis of their career accomplishments and proposed areas of study. Professor Kianieff explored the depths of blockchain technology and he conducted cutting-edge research for his new monograph (from Routledge) on the legal implications of blockchain technology: a technology originally devised to support the digital currency of Bitcoin. In Winter 2020, Professor Kianieff will be teaching a new course that he has developed in Blockchain Technologies and Commercial Law.  The course, one of the first of its kind, will expose students to many of the legal and consumer protection issues that surround the development of distributed ledgers and their commercial applications.  View Muharem Kianieff's CV. Research areas: Blockchain\/Distributed Ledger Technology; Financial Technology And Payment Mechanisms; Financial Reform; Consumer Protection; Privacy",
    "listed_research_areas":"Blockchain\/Distributed Ledger Technology; Financial Technology And Payment Mechanisms; Financial Reform; Consumer Protection; Privacy"
  },
  {
    "faculty":"windsor",
    "name":"Ruth Kuras",
    "title":"Assistant Professor",
    "email":"rkuras@uwindsor.ca",
    "href":null,
    "bio":null,
    "listed_research_areas":null
  },
  {
    "faculty":"windsor",
    "name":"Margaret Liddle",
    "title":"Assistant Professor",
    "email":"maggie@uwindsor.ca",
    "href":null,
    "bio":null,
    "listed_research_areas":null
  },
  {
    "faculty":"windsor",
    "name":"Sylvia Mcadam",
    "title":"Assistant Professor",
    "email":"Sylvia.Mcadam@uwindsor.ca",
    "href":null,
    "bio":null,
    "listed_research_areas":null
  },
  {
    "faculty":"windsor",
    "name":"Richard Moon",
    "title":"Distinguished University Professor",
    "email":"rmoon@uwindsor.ca",
    "href":"http:\/\/www.uwindsor.ca\/law\/rmoon\/",
    "bio":"Richard Moon is Distinguished University Professor and Professor of Law at the University of Windsor. His research focuses on freedom of expression and freedom of conscience and religion. He is the author of The Life and Death of Freedom of Expression (U of T Press, forthcoming), Putting Faith in Hate: When Religion is the Source or Target of Hate Speech (Cambridge Univ. Press, 2018), Freedom of Conscience and Religion (Irwin Law, 2014), The Constitutional Protection of Freedom of Expression (U of T Press, 2000), and Report to the Canadian Human Rights Commission Concerning Section 13 of the Canadian Human Rights Act and the Regulation of Hate Speech on the Internet (CHRC, 2008), editor of Law and Religious Pluralism in Canada (UBC Press, 2008), co-editor of Religion and the Exercise of Public Authority (Hart\/Bloomsbury, 2016), Indigenous Spirituality and Religious Freedom (U of T Press, in press), The Surprising Constitution (UBC Press, in press), contributing editor to Canadian Constitutional Law (3rd, 4th, 5th, 6th editions) (Emond-Montgomery, 2006, 2010, 2016, 2022). He has been the recipient of both the law school and university-wide teaching awards as well as the Mary Lou Dietz Award for contributions to the advancement of equity in the university and community. He has held a number of academic positions including President of the Canadian Law and Society Assn. He is currently editor-in-chief of the Windsor Yearbook of Access to Justice.  Many of his publications can be found at his SSRN author's page:  http:\/\/papers.ssrn.com\/sol3\/cf_dev\/AbsByAuth.cfm?per_id=390771   Recent Publications​   The Surprising Constitution (UBC Press, in press 2023) (co-edited with Howard Kislowicz and Kerri Froc).   \"Limits on Rights: The Myth of Balancing\" in Kislowicz et al eds, The Surprising Constitution (UBC Press, in press 2023).   \"R v Big M Drug Mart and the Importance of Religion\" in R. Barker, P. Babie, and N, Foster (eds), Law and Religion Landmark Cases (Hart\/Bloomsbury, 2022).   \"Comment on Fraser v. Canada (AG):  The More Things Change\", Constitutional Forum (March, 2021).   \"The Protocols of the Elder Trudeau: A Canadian Conspiracy Theory\",  Literary Review of  Canada (Sept. 2020).   Indigenous Spirituality and Religious Freedom (UTP, in press 2023) (co-edited with Jeffery Hewitt)   \"Ktunaxa v. BC and the Shape of Religious Freedom\" in J. Hewitt and R. Moon, eds., Indigenous Spirituality and Religious Freedom (UTP, in press 2023)   “The Conscientious Objection of Medical Practitioners to the CPSO’s Effective Referral Requirement”, 29(1) Constitutional Forum (May 2020). https:\/\/journals.library.ualberta.ca\/constitutional_forum\/index.php\/constitutional_forum\/article\/view\/29403   “Conscientious Objection and the Politics of Cake-Baking”,  9 Oxford J. of Law and Religion (2020).      \"Pierre Trudeau and the Separation of Law and Religion\" in N. Karazivan and J. Leclair, The Legacy of Pierre Trudeau (Lexis\/Nexis, 2020)   \"Does Freedom of Expression have a Future?\" in E. Macfarlane ed., Dilemmas of Free Expression (U of T Press, 2021).   Oped in Policy Options, \"Charter arguments will not help Vaccine Mandate Opponents\" Sept 29, 2021,       https:\/\/policyoptions.irpp.org\/magazines\/septembe-2021\/charter-arguments-will-not-likely-help-vaccine-mandate-opponents\/   Op-ed in Toronto Star, “Harper’s Magazine Letter Exposes the Crisis in Our Public Discourse”, Toronto Star, July 13, 2020,  https:\/\/www.thestar.com\/opinion\/contributors\/2020\/07\/13\/harpers-magazine-letter-exposes-the-crisis-in-our-public-discourse.html   \"Trinity Western Univ. v. LSBC: Complicated Answers to a Simple Question\"  94 Supreme Court Law Review 335 (2019).   “Free Speech Controversies on Campus\", Academic Matters (Fall, 2018)  https:\/\/academicmatters.ca\/understanding-the-right-to-freedom-of-expression-and-its-place-on-campus\/?fbclid=IwAR2iXP6QS5cL0HtnBJGGsCzVvlQcK8lZJKA4_x2CSj8LOMDW3_aFozIPyG4   “The Demise of Free Speech”,  28 Constitutional Forum 1 (2019) https:\/\/journals.library.ualberta.ca\/constitutional_forum\/index.php\/constitutional_forum\/article\/view\/29373\/21372   “Dolphin Delivery and the Court’s Loss of Confidence”, 39 National Journal of Constitutional Law 123 (2019).   “Conscience in the Image of Religion” in John Adenitire (ed.), Religious Beliefs and Conscientious Exemptions in a Liberal State (Hart\/Bloomsbury, 2019).         File Attachments:  Attachment   rmoon_cv_feb_2020.pdf Research areas: Freedom Of Religion; Freedom Of Expression; The Charter Of Rights And Freedom",
    "listed_research_areas":"Freedom Of Religion; Freedom Of Expression; The Charter Of Rights And Freedom"
  },
  {
    "faculty":"windsor",
    "name":"Claire Mummé",
    "title":"Associate Professor",
    "email":"cmumme@uwindsor.ca",
    "href":"http:\/\/www.uwindsor.ca\/law\/cmumme\/",
    "bio":"Claire Mummé joined the University of Windsor Faculty of Law as an Assistant Professor in 2013. She holds an LL.B. from Osgoode Hall Law School, an M.A in history from the University of Toronto, an LL.M. from New York University, a PhD from Osgoode Hall Law School, and is called to the Bar of Ontario. She is a former SSHRC Joseph-Armand Bombardier CGS Doctoral Scholar, and a former McMurtry Fellow of the Osgoode Legal History Society. Her research focuses on law’s distributional effects and its role in structuring institutions of the market, as examined through the legal regulation of waged-employment. She writes regularly on employment law, labour law, human rights law, and is currently pursuing research on the legal regulation of supply chains and their effects on labour organizing, and on the common law’s responses to changing forms of work in the post-Fordist era. Professor Mummé teaches contracts, labour law and employment law. Her publications are available at ssrn and academia.edu. Research areas: Access To Justice; Contract Law; Law Of Work And The Labour Market; Employment And Human Rights Law; Legal History Of Employment Regulation",
    "listed_research_areas":"Access To Justice; Contract Law; Law Of Work And The Labour Market; Employment And Human Rights Law; Legal History Of Employment Regulation"
  },
  {
    "faculty":"windsor",
    "name":"Joanna Noronha",
    "title":"Assistant Professor",
    "email":"Joanna.vnoronha@uwindsor.ca",
    "href":null,
    "bio":null,
    "listed_research_areas":null
  },
  {
    "faculty":"windsor",
    "name":"Jillian Rogin",
    "title":"Assistant Professor",
    "email":"Jillian.Rogin@uwindsor.ca",
    "href":"https:\/\/www.uwindsor.ca\/law\/1630\/jillian-rogin",
    "bio":"Biography Jillian Rogin joined the Faculty of Law in July of 2017 as the Assistant (Clinic) Professor. Her research focuses on judicial interim release, evidentiary issues in sexual assault law, legal clinic scholarship including legal ethics, and feminist\/critical race\/post-colonial theory. She is currently the Clinic Professor and runs the clinic academic credit program at Community Legal Aid and Legal Assistance of Windsor Professor Rogin holds an LLM (Osgoode Hall, York University), an MES (Faculty of Environmental Studies, York University), an LLB (University of Windsor), and a BA Hons (Indigenous Studies and Philosophy, Trent University). She is a member of the Law Society of Ontario (called in 2009) and is a practicing criminal defence lawyer. Prior to her appointment, she was a duty counsel lawyer (criminal law) and a research lawyer with Legal Aid Ontario, and worked as Review Counsel at Community Legal Aid. She clerked for the Superior Court of Justice (Toronto) in fulfillment of her articles. Professor Rogin sits on a number of boards and is heavily involved in her community. Publications “Gladue and Bail: The Pre-trial Sentencing of Aboriginal People in Canada” (2017) 95-2 Canadian Bar Review 325 Sylvia McAdam (Saysewahum), Jillian Rogin, Reem Bahdi, “Law professor put on trial for ‘trespassing’ on family’s ancestral lands” (March 25, 2019, The Conversation) Contributing and Contributed Author, (2009 – Present) Hill, Tanovich, Strezos, McWilliams Canadian Criminal Evidence The Honourable Mr. Justice S. Casey Hill, David M. Tanovich, Louis P. Strezos and Scott G.Hutchison, McWilliam’s Canadian Criminal Evidence (Canada Law Book: Canada, 2011), Chapter 16 “Prior Sexual History”, Chapter 17 “Third Party Records”(contributed), Chapter 35 “Bail Hearings”, “Year in Review”, 2012. In Progress Jillian Rogin, Gemma Smyth, Johanna Dennie, “ACCLE and Bill C-75: Implications for Student Legal Clinics & Communities in Canada” (under review, Journal of Law and Social Policy)",
    "listed_research_areas":null
  },
  {
    "faculty":"windsor",
    "name":"Noel Semple",
    "title":"Associate Professor",
    "email":"Noel.Semple@uwindsor.ca",
    "href":"http:\/\/www.uwindsor.ca\/law\/nsemple\/",
    "bio":"Noel Semple is an Associate Professor at the University of Windsor Faculty of Law.  Studying access to justice, Professor Semple's work asks how the law and legal institutions work in real life. It also aspires to improve the ability of law and legal institutions to actually create justice. Empirical research (quantitative and qualitative) and policy analysis are key tools in his scholarship. Professor Semple draws upon and seeks to contribute to the law and society and empirical legal studies traditions. Between 2017 and 2019, he was Editor-in-Chief of the Windsor Yearbook of Access to Justice, a peer-reviewed and open-source scholarly journal. He teaches and writes in the fields of civil dispute resolution, legal ethics and professionalism, legal services regulation, and family law. He directs the Windsor Legal Practice Simulation, a week-long legal practice simulation in which all Windsor Law 1L students participate. In March 2017, he received the Windsor Student Law Society Faculty Award for teaching. Professor Semple's book Accessibility, Quality, and Profitability for Personal Plight Law Firms: Hitting the Sweet Spot is available free from the Canadian Bar Association. His book Legal Services Regulation at the Crossroads: Justitia’s Legions is available from Edward Elgar Press in hardcover and as an affordable e-book.  Professor Semple sits on the Boards of Directors of South Etobicoke Community Legal Services, and the National Self-Represented Litigants Project. He lives with his wife, Angélique Moss, and their children Madeleine and Malcolm in the west end of Toronto.",
    "listed_research_areas":null
  },
  {
    "faculty":"windsor",
    "name":"Shanthi Elizabeth Senthe",
    "title":"Assistant Professor",
    "email":"s.senthe@uwindsor.ca",
    "href":"https:\/\/www.uwindsor.ca\/law\/1372\/shanthi-elizabeth-senthe",
    "bio":"Shanthi Elizabeth Senthe is an Assistant Professor at Windsor Law. She teaches Business Associations, Secured Transactions, and Sports Law. Professor Senthe is also a faculty member with the Dual-JD program, in which she teaches the Business Association module.  She has taught Corporate Governance and Remedies. Prior to joining Windsor Law, Professor Senthe was an Assistant Professor with the Faculty of Law at Thompson Rivers University in British Columbia for three years. Professor Senthe is admitted to practice law in Ontario, Florida, North Carolina and the District of Columbia. Her research interests include corporate, commercial, banking and finance law and sports law. She is currently leading a research study involving Black commercialization and financialization in the Detroit area.   Professor Senthe is completing her PhD at Osgoode Hall Law School, focusing on banking and finance regulation and governance. She completed a merit-based judicial externship at the Florida Supreme Court, and a judicial clerkship at the Superior Court of the District of Columbia. Her professional experiences include banking and corporate-commercial litigation. She has received multiple research awards, including the Social Sciences and Humanities Research Council of Canada (SSHRC) Doctoral Fellowship. She taught as a guest lecturer at Osgoode Hall Law School and was a Visiting Scholar at Duke University School of Law in 2013.",
    "listed_research_areas":null
  },
  {
    "faculty":"windsor",
    "name":"Tess Sheldon",
    "title":"Assistant Professor",
    "email":"tess.sheldon@uwindsor.ca",
    "href":"https:\/\/www.uwindsor.ca\/law\/Tess-Sheldon",
    "bio":"Tess Sheldon joined the University of Windsor Faculty of Law in 2018 as an Assistant Professor. She writes, presents and teaches extensively on a variety of mental health, access to justice, disability and human rights topics. Dr. Sheldon completed her doctorate at the University of Toronto, exploring the legal issues raised by the covert administration of medication in psychiatric settings. She practiced exclusively with Ontario’s legal clinic system, including at ARCH Disability Law Centre and Justice for Children and Youth. Dr. Sheldon's research, including about coercive medication administration practices in psychiatric settings, scrutinizes the role of law to protect and promote our communities’ health. She explores the law’s possibilities (and perils) to confront the regimes that reflect and reinforce economic and social exclusion of persons with disabilities and consumers\/ survivors of the psychiatric system. Research areas: ​Access To Justice; Disability Law; Human Rights Law",
    "listed_research_areas":"​Access To Justice; Disability Law; Human Rights Law"
  },
  {
    "faculty":"windsor",
    "name":"Anneke Smit",
    "title":"Associate Professor",
    "email":"asmit@uwindsor.ca",
    "href":"http:\/\/www.uwindsor.ca\/law\/asmit\/",
    "bio":"Director, Windsor Law Centre for Cities Associate Professor Anneke Smit is Associate Professor in the Faculty of Law and the inaugural Director of the Windsor Law Centre for Cities. She is the co-lead of the Government of Canada-funded Cities and Climate Action Forum.  Prior to joining Windsor Law she held a Lectureship at the School of Law, University of Reading (UK).  Dr. Smit's research, teaching and community engagement focus on urban planning and municipal law, and global refugee law and policy.  Dr. Smit has worked on domestic and global refugee law and policy with government, intergovernmental and non-governmental organisations in Canada, the Balkans and the South Caucasus.  She has held visiting positions at the Amsterdam Centre for Migration and Refugee Law; Oxford University's Refugee Studies Centre, and the Faculté de Droit, Université d'Aix-Marseille.    Dr. Smit's publications include Public Interest, Private Property: Law and Planning Policy in Canada (co-edited with Marcia Valiante, UBC Press, 2016), The Property Rights of Refugees and Internally Displaced Persons: Beyond Restitution (Routledge, 2012), and A Guide to International Law Careers, 2nd ed. (co-authored, British Institute for International and Comparative Law, 2015).  She has written consultancy papers for the Jerusalem Old City Initiative (JOCI) and UNHCR Europe. Her extensive community involvement includes two terms (2016-2020) as founding member of the national Scholars at Risk Canada steering committee, and founding the Windsor-Essex chapter of the Refugee Sponsorship Support Programme (Refugee SSP) from 2016-18.  She is a regular commentator in English and French-language media on urban planning issues and refugee law and policy.  She has been the recipient of the Windsor Law Students Law Society (SLS) Faculty Award, the Windsor-Essex Local Immigration Partnership Welcoming Communities Award, the University of Windsor Alumni Association Excellence in Mentoring Award, and the UWindsor Humanities Research Group Fellowship.",
    "listed_research_areas":null
  },
  {
    "faculty":"windsor",
    "name":"Gemma Smyth",
    "title":"Associate Professor",
    "email":"gemma.smyth@uwindsor.ca",
    "href":"https:\/\/www.uwindsor.ca\/law\/gesmyth\/",
    "bio":"Associate Professor & Externship Director Professor Gemma Smyth is Associate Professor and Externship Director at the Faculty of Law, University of Windsor, on the territories of the Three Fires Confederacy. Professor Smyth was Associate Dean (Academic) (2018-2020), Academic Clinic Director and Associate Professor (2009-2015), Interim Associate Dean (2016- 2017) and Externship Program Director (2017-2018). Professor Smyth was also Director of University of Windsor Mediation Services between 2003 and 2009. She has taught Clinic Seminar, Dispute Resolution, Access to Justice, Mediation Clinic, and Research Methods. Professor Smyth researches and writes in the areas of clinic law, dispute resolution, lawyering skills, and legal education. She is interested in the intersection of clients' and communities' experiences of law and lawyering and the skills, behaviours and attitudes that result in higher quality relationships. Professor Smyth is the co-author of the first text on clinical legal education in Canada, with Professors Sarah Buhler and Sarah Marsden. She also hosts an open-source Youtube channel with materials on law practice with a focus on clinical law skills. She is Past President of the Association for Canadian Clinical Legal Education, a national collaborative working on issues related to clinical and experiential legal education in Canada. Professor Smyth's papers and other publications can be found on the University of Windsor's digital repository. For a full list of Windsor Law's clinical programs, visit https:\/\/www.uwindsor.ca\/law\/341\/clinical-and-experiential-learning. Research areas: Dispute Resolution; Lawyering Skills; Legal Education; Clinic Law",
    "listed_research_areas":"Dispute Resolution; Lawyering Skills; Legal Education; Clinic Law"
  },
  {
    "faculty":"windsor",
    "name":"David Tanovich",
    "title":"Professor",
    "email":"tanovich@uwindsor.ca",
    "href":"http:\/\/www.uwindsor.ca\/law\/tanovich\/",
    "bio":"David M Tanovich is a Professor at the Faculty of Law, University of Windsor. In 2017, Professor Tanovich was inducted as a Fellow of the Royal Society of Canada (Academy of Social Sciences). This is the highest honour that can be awarded to an academic in Canada. In 2016, he was awarded the University of Windsor's Outstanding Faculty Research Award (Established Scholars\/Researchers category). Professor Tanovich teaches and writes in the areas of criminal law, evidence, legal ethics and racial profiling. He is a nationally recognized expert in these areas. He is one of the most cited criminal law academics in the Supreme Court of Canada and provincial appellate and trial courts. All of his publications can be downloaded from his SSRN page.  Prior to joining Windsor Law in 2003, Professor Tanovich served as a law clerk to Chief Justice Antonio Lamer for the 1995 Supreme Court of Canada term. From 1997-2003, he was an appellate lawyer with Pinkofsky Lockyer in Toronto during which he appeared as lead counsel in over 90 criminal and constitutional cases before the Supreme Court of Canada and Ontario Court of Appeal. Professor Tanovich won his last three cases in the Supreme Court of Canada (R v Golden; R v Burke; and R v Lyttle). Research areas: Criminal Law;       Evidence;       Racial Profiling;       Legal Ethics",
    "listed_research_areas":"Criminal Law;       Evidence;       Racial Profiling;       Legal Ethics"
  },
  {
    "faculty":"windsor",
    "name":"Myra Tawfik",
    "title":"Distinguished University Professor",
    "email":"mjt@uwindsor.ca",
    "href":"http:\/\/www.uwindsor.ca\/law\/tawfik\/",
    "bio":"Don Rodzik Family Chair in Law and Entrepreneurship and Distinguished University Professor B.A Hons. (McGill), LL.B (McGill), B.C.L (McGill), LL.M (Queen Mary College, London-Intellectual Property Law), of Osgoode Hall, Barrister-at-law, also of the Bar of Quebec (1986-2000) Professor Tawfik is an expert in intellectual property law. Her research and teaching interests lie in the areas of copyright law, trademark law, international IP law, IP strategy and IP legal history. In 2014, she was appointed a Senior Fellow at the Centre for International Governance Innovation (CIGI) to lead research on capacity-building in IP legal knowledge mobilization. Her CIGI special report: \"Addressing a Gap in Canada's Global Innovation Strategy: Capacity-Building in IP Literacy, IP Strategy and Access to Affordable IP Legal Services\" was released in September 2016.  Professor Tawfik has founded and led a number of multidisciplinary clinics, knowledge mobilization and community outreach projects designed to provide Canadian start-ups and innovators with IP literacy skills and access to affordable IP legal services. She is a recipient of a University of Windsor Award for Outstanding Community Outreach, Knowledge Transfer and Knowledge Mobilitzation (2018). Among her current research projects, she is completing a monograph on pre-Confederation copyright law in Canada. Recent Publications: “Copyright History as Book History: The Law in Multidisciplinary Context” – in Paul Torremans, (ed.), Research Handbook on Copyright Law, 2nd edition (Cheltenham: Edward Elgar, 2017). “Universities are Failing to Equip Entrepreneurs for Patent Battles: Designing an IP 2.0 Curriculum”, CIGI New Thinking on Innovation Series (CIGI, 2017) https:\/\/www.cigionline.org\/articles\/universities-are-failing-equip-entrepreneurs-patent-battles.  “Copyright and Freedom of Expression in Canada\" chapter in Torremans, P., ed., Intellectual Property Law and Human Rights 3rd ed., (The Netherlands: Kluwer Law International, 2015). \"International Copyright Law, Access to Knowledge and Social Justice\", chapter 12 in Ilcan S., ed., Mobilities, Knowledge and Social Justice (Montreal: McGill-Queen’s University Press, 2013). “The Supreme Court of Canada and the “Fair Dealing Trilogy”: Elaborating a Doctrine of User Rights under Canadian Copyright Law” (2013) 51 Alta LR 191.  “Taking an Active Approach in Entrepreneurial Mentoring Programs Geared Toward Immigrants”, Journal of Entrepreneurship, 21 (2), 201 (2012) (with Francine Schlosser).  “Overcoming Obstacles to the Effective Commercialization of Student Innovation on University Campuses” Report to SSHRC - Knowledge-Synthesis Grant on Higher Education R&D (2012) (with Francine Schlosser and Wissam Aoun).  “The Future of International Intellectual Property Law: Remembering the Past” -(2012) 89 UDM Law Review 373. Recent Op-Eds and Commentaries: “Five critical components of a balanced, modern Canadian copyright system” (with Pascale Chapdelaine), The Globe and Mail, December 5, 2018.  “Make the Innovation Chain as Literate in IP as ABCs”, Financial Post, November 15, 2018.    “University of Waterloo case highlights holes in Canada’s university innovation ecosystem”, The Globe & Mail, October 21, 2018  “Why it’s so important for Canadians to be able to leverage their intellectual property”, The Globe & Mail, May 1, 2018  The Globe and Mail, June 17, 2015- To Support Canadian Start-Ups offer Pro Bono Legal Clinics  (with James Hinton). Commentary: What is Canada's International Copyright Policy? CIGI Podcast: Inside the Issues 5.20: Intellectual Property Rights- April 29, 2015",
    "listed_research_areas":null
  },
  {
    "faculty":"windsor",
    "name":"Lisa Trabucco",
    "title":"Assistant Professor",
    "email":"Lisa.Trabucco@uwindsor.ca",
    "href":null,
    "bio":null,
    "listed_research_areas":null
  },
  {
    "faculty":"windsor",
    "name":"Mary Anne Vallianatos",
    "title":"Assistant Professor",
    "email":"Vallianatos@uwindsor.ca",
    "href":"https:\/\/www.uwindsor.ca\/law\/3090\/mary-anne-vallianatos-assistant-professor",
    "bio":"Mary Anne Vallianatos joined the Faculty of Law as an Assistant Professor in 2023. Professor Vallianatos’ expertise and research interests are Canadian legal history, law and empire, and race, ethnicity and migration. Her research and teaching are interdisciplinary and informed by critical race, feminist, and post-colonial theory. Professor Vallianatos’ current project relies on original archival research to connect the legal history of Asian migration and settlement in Canada to constructions of race across the former British empire.  Professor Vallianatos comes to Windsor Law having practiced Aboriginal law and served a number of non-profits and non-governmental organizations in Vancouver and New York on projects concerning civil rights, gender equality, housing access, and international humanitarian law. Professor Vallianatos previously taught courses at the University of Victoria, Faculty of Law and the Schulich School of Law, Dalhousie University, and is a former SSHRC Joseph-Armand Bombardier CGS Doctoral Scholar. Research areas: Canadian Legal History ; Law And Race  ; Asian Canadians And The Law",
    "listed_research_areas":"Canadian Legal History ; Law And Race  ; Asian Canadians And The Law"
  },
  {
    "faculty":"windsor",
    "name":"Vasanthi Venkatesh",
    "title":"Associate Professor",
    "email":"vasanthi.venkatesh@uwindsor.ca",
    "href":"https:\/\/www.uwindsor.ca\/law\/983\/vasanthi-venkatesh",
    "bio":"Associate Professor- Law, Land, and Local Economies Dr. Vasanthi Venkatesh is Associate Professor in Law, Land, and Local Economies at the University of Windsor, Faculty of Law. Professor Vasanthi Venkatesh’s research focuses on labour migration, immigration and citizenship law, law and social movements, racialisation and discrimination, and comparative law. Her expertise lies in the interdisciplinary study of law within its political, economic, global, and historical contexts. It is informed by critical class, race, and anti-colonial scholarship and uses empirical (qualitative and quantitative), comparative, and historical methods. Her research examines how power and privilege is produced in legal doctrines and systems and also how macro-level transnational phenomena (geopolitics, world economy, migration, neocolonialism) impact material realities at the community level; and importantly, how community-level acts of resistance can help to reimagine novel legal and political formations. She has received several grants for her research including from the Social Sciences and Humanities Research Council (SSHRC), Law Foundation of Ontario, and the US National Science Foundation (NSF).  Professor Venkatesh has a PhD from the Jurisprudence and Social Policy Program at University of Berkeley, where her dissertation used a comparative socio-legal approach to theorize how law is made and used by migrant workers and their advocates in several countries. She also holds a JD from the University of Toronto, an MA in Law and Diplomacy from the Fletcher School at Tufts University, and has an MS and a BS degree. She has written articles on migrant and racial justice movements, labour migration, gender violence and global law reform, coloniality of power and the Global South (including on citizenship laws in South Asia and the Dalit Radical Tradition) and legal epistemologies \"from below\".  With Justicia for Migrant Workers in Ontario, she administers the Migrant Farmworkers Clinic funded by the Law Foundation of Ontario, the first legal clinic for migrant farm workers in Canada, which is based on law and organising principles. She was appointed as a member of the Leadership Committee on Equitable Livelihoods in the UN Food Systems Summit (UNFSS) 2021 based on her expertise in migrant and labour rights of food system workers. She is the Chair of the Board of Directors of IAVGO, a workers compensation legal clinic that is oraganised as a collective. Prior to pursuing her PhD, Vasanthi ran a sole legal practice and consultancy in Toronto specializing in refugee rights litigation with a focus on women and LGBTQ+ claimants and has also worked in a litigation firm. In addition, she has worked and continues to work with a variety of activist, grassroots, and human rights organizations globally and in Canada including the Justicia for Migrant Workers in Ontario, African-Canadian Women's Human Rights Project, Alliance for a Secular and Democratic South Asia, Occupational Health and Safety Centre in India, People Against Torture in Kenya, and Centre on Housing Rights and Evictions in Thailand. Research areas: Citizenship And Immigration; Law, Radical Resistance, And Social Movements; Labour Migration; Law And Global Political Economy; Racialization And Discrimination; Comparative Law, International Human Rights Law, And Global South Law; Empirical Legal Methods And Critical Epistemology; Anti-Colonial And Critical Race Frameworks",
    "listed_research_areas":"Citizenship And Immigration; Law, Radical Resistance, And Social Movements; Labour Migration; Law And Global Political Economy; Racialization And Discrimination; Comparative Law, International Human Rights Law, And Global South Law; Empirical Legal Methods And Critical Epistemology; Anti-Colonial And Critical Race Frameworks"
  },
  {
    "faculty":"windsor",
    "name":"Valarie Waboose",
    "title":"Assistant Professor",
    "email":"valarie.waboose@uwindsor.ca",
    "href":"https:\/\/www.uwindsor.ca\/law\/945\/valarie-waboose",
    "bio":"Valarie Waboose graduated from Windsor Law in 1993 and was called to the Ontario Bar in 1995. Since this time she has practiced and worked in many different places. From 1996 to 2002 she worked as In-House Legal Counsel to the Walpole Island First Nation (Bkejwanong Territory). While working full-time for the Walpole Island Chief and Council she completed her Life Skills Coach Training.  In addition to a LL.B she also completed an LL.M in Alternative Dispute Resolution at York University\/Osgoode Hall Law School (1999).  In 2002 she moved to Cambridge, Massachusetts and attended the Program on Negotiation for 1 year. Upon returning home she set up a consultant business specializing in policy development, strategic planning, program planning and evaluation, pre-employment training and life skills coaching.  Later in 2005 she returned to school to complete her Ph. D.  In 2016 she graduated from Trent University with a Doctorate in Philosophy. Her Ph. D. dissertation is entitled:  Re-Living the Residential School Experience, An Anishinabe Kwe’s Examination of the Compensation Processes for Residential School Survivors. In December of 2015 she was successful in a competition for a tenure-track position in the Faculty of Law that commenced on July 1st, 2016. Valarie is delighted to be working at the law school in which she graduated and hopes to see many Indigenous students pass through the doors of Windsor Law while she is here. Valarie’s teaching philosophy revolves around Indigenous Knowledge and Indigenous Legal Traditions. As a member of the Midewiwin Society her Indigenous Knowledge is interwoven with her pedagogical teaching methodologies utilized within a classroom setting. As an Anishinabe Kwe she believes in sharing her knowledge with non-Indigenous students so that they can better serve the clients when they enter the legal profession. In the past 3 years Valarie has been invited to speak at a variety of functions: 2014 – Canadian Indigenous Studies National Association Conference, Montreal, Quebec Spoke on excerpts from her dissertation:  “Re-Living the Residential School Experience, An Anishinabe Kwe’s Examination of the Compensation Processes for Residential School Survivors.” 2015 – Reconciliation Day, Walpole Island First Nation Spoke on excerpts from her dissertation:  “Re-Living the Residential School Experience, An Anishinabe Kwe’s Examination of the Compensation Processes for Residential School Survivors.” 2016 – Windsor, Ontario Child Welfare 2016    - Indigenous Justice Gathering, Niagara Falls, Ontario Child Welfare",
    "listed_research_areas":null
  },
  {
    "faculty":"windsor",
    "name":"Christopher Waters",
    "title":"Professor",
    "email":"cwaters@uwindsor.ca",
    "href":"http:\/\/www.uwindsor.ca\/law\/cwaters\/",
    "bio":"Biography  Christopher Waters was Dean of the Faculty of Law 2015 to 2021. He joined the Faculty in 2007 and served as Associate Dean from 2009-2012. His previous academic post was at the University of Reading in the United Kingdom. He has been a visiting scholar at several universities, including Aix-Marseille Université, and the Asser Institute in The Hague. Dr. Waters' research interests are in the areas of public international law, international humanitarian law, law and politics in Eastern Europe and active transportation and the law. He has extensive human rights and election monitoring field experience in Eastern Europe and the former Soviet Union. Dr. Waters is co-editor of the Canadian Bar Review with Professor Wissam Aoun and is on the editorial board of the Journal on the Use of Force and International Law. He completed the Program in Adjudication for Administrative Agencies, Boards & Tribunals from the Society of Ontario Adjudicators and Regulators, and has extensive board experience, including as past Chair of the Ontario Law Deans, Chair of Community Legal Aid (Windsor), Member of the Board of Governors of the Law Commission of Ontario, Member of the Study Leave Committee of the Canadian Judicial Council, Vice-Chair of Legal Assistance of Windsor, and Chair of the Windsor Bicycling Committee (an advisory committee to City Council). Among other honours, Dr. Waters has been awarded the Canadian Peacekeeping Service Medal and a HM Queen Elizabeth II Platinum Jubilee Pin.     Follow Dr. Waters on Twitter @ProfCWaters Research areas: Public International Law; International Humanitarian Law; Active Transportation",
    "listed_research_areas":"Public International Law; International Humanitarian Law; Active Transportation"
  },
  {
    "faculty":"windsor",
    "name":"Sara Wharton",
    "title":"Associate Professor",
    "email":"swharton@uwindsor.ca",
    "href":"https:\/\/www.uwindsor.ca\/law\/swharton\/",
    "bio":"Associate Professor Biography Sara Wharton joined the Faculty of Law in July 2014 as an Assistant Professor. She researches in the fields of international criminal law and transnational criminal law and is also interested in public international law, international humanitarian law, and Canadian criminal law. Prior to joining the Faculty of Law, Dr. Wharton was a Postdoctoral Fellow at the National University of Singapore (2013-2014) and a Visiting Fellow at the University of New South Wales in Sydney, Australia (2013) where she held an Endeavour Research Fellowship (Government of Australia). Dr. Wharton also worked as a legal intern in the Trial Chamber at the International Criminal Court in The Hague (2012). Dr. Wharton holds a Ph.D. from the University of Cambridge, Faculty of Law. She also holds an LL.M. from Harvard Law School, a J.D. from Osgoode Hall Law School, and a B.A. (Honours) from Queen’s University. Dr. Wharton is also a member of the Law Society of Upper Canada and was called to the Bar of Ontario in 2007. Dr. Wharton teaches courses in Canadian criminal law, access to justice, and international criminal law. Research areas: International Criminal Law; Transnational Criminal Law; Access To Justice; International Humanitarian Law",
    "listed_research_areas":"International Criminal Law; Transnational Criminal Law; Access To Justice; International Humanitarian Law"
  },
  {
    "faculty":"windsor",
    "name":"Vincent Wong",
    "title":"Assistant Professor",
    "email":"vincent.wong@uwindsor.ca",
    "href":"https:\/\/www.uwindsor.ca\/law\/3050\/vincent-wong-assistant-professor",
    "bio":"Vincent Wong joined the University of Windsor Faculty of Law as an Assistant Professor in 2022. He is also a PhD Candidate at Osgoode Hall Law School, where his dissertation focuses on racial capitalism and the processes that produce and structure unfree status-excluded labour in Canada. He serves on the board of the Community Justice Collective (Tkaronto). Vincent holds a Bachelor of Commerce and Juris Doctor from the University of Toronto and a Master of Laws from Columbia Law School, where he was a Human Rights Fellow and James Kent Scholar. Professor Wong’s research focuses in law and political economy – specifically at the nexus between migration, race, markets, and the law. He is particularly interested in how a Canadian context-specific critical race theory (CRT) can better inform and be informed by the practice of anti-racist and intersectional movement lawyering. Professor Wong is also interested in what critical frameworks of law and political economy have to offer in the context of understanding the emerging hub of the 21st century global economic order: China. Prior to academia, Professor Wong worked as a Staff Lawyer at the Chinese and Southeast Asian Legal Clinic and Secretary of the Chinese Canadian National Council - Toronto Chapter. He has also previously held positions at the International Human Rights Program at the University of Toronto and the African American Policy Forum.  Recent Publications:  Vincent Wong, From RDS to IHRP: ‘Turning the Tables’ and the Limits of Canadian Judicial Understandings of Racism (2023, upcoming) Journal of Law and Social Policy. Vincent Wong, Racial capitalism with Chinese Characteristics: analyzing the political economy of racialized dispossession and exploitation of Uyghur and other non-Han Indigenous populations in Xinjiang (2022) 3 African Journal of International Economic Law 1. Vincent Wong, Ethnoracial Legal Clinics and the Praxis of Critical Race Theory in Canada (2020) 16:1 Journal of Law & Equality 63-92.   Courses Taught:  Access to Justice Law, Migration, and Colonialism Research areas: Racial Capitalism And The Law; Critical Race Studies; Law, Migration, And Colonialism; Asian Canadians And The Law; International Human Rights Law",
    "listed_research_areas":"Racial Capitalism And The Law; Critical Race Studies; Law, Migration, And Colonialism; Asian Canadians And The Law; International Human Rights Law"
  },
  {
    "faculty":"windsor",
    "name":"Sujith Xavier",
    "title":"Associate Professor",
    "email":"sxavier@uwindsor.ca",
    "href":"http:\/\/www.uwindsor.ca\/law\/sxavier\/",
    "bio":"Biography Dr. Sujith Xavier (Barrister and Solicitor, Law Society of Ontario) is an Associate Professor at the Faculty of Law, University of Windsor. His research spans Third World Approaches to International Law (TWAIL), public international law, and domestic public law. Sujith is one of the co-editors of Decolonizing Law: Indigenous, Third World and Settler Perspectives (Routledge Press, 2021) & Third World Approaches to International Law: On Praxis and the Intellectual (London: Routledge, THIRDWORLDS Series, 2017). Sujith is a founding member of the Editorial Collective of Third World Approaches to International Law Review (TWAILR.com). He is currently researching and compiling data for his manuscript on reconciliation in post-colonial and settler colonial societies. Sujith has significant experience working with local grassroots non-governmental organizations in Sri Lanka. He was a legal intern with Al-Haq in Ramallah, Palestine. While living in The Hague, he interned with Judge Agius in the Appeals Chamber of the International Criminal Tribunal for former Yugoslavia and International Criminal Tribunal for Rwanda.  Sujith’s notable cases include Canadian Arab Federation v Canada (Minister of Citizenship and Immigration) [2015 FCA 168]; Minister of Citizenship and Immigration v. Alexander Vavilov [2019 SCC 65]. He represented two interveners in Canada (AG) v. Kattenburg (2020 FCA 164). In March of 2018, Sujith was the recipient of the University of Windsor Outstanding Faculty Research Award (Emerging Scholars\/Researcher). In 2015-2016, he was the recipient of the University of Windsor Faculty of Law Students' Law Society Teaching Award for teaching excellence. Sujith taught International Criminal Justice in Monash University Malaysia's summer program. At the University of Windsor Faculty of Law, he teaches Access to Justice, Administrative Law, Legal Theory (LL.M.), Public International Law and Race and the Law.  Tags: Sujith XavierFaculty Research areas: Twail & Race And The Law; Administrative Law & Constitutionalism Of The Global South; Public International Law; Colonialism & Imperialism",
    "listed_research_areas":"Twail & Race And The Law; Administrative Law & Constitutionalism Of The Global South; Public International Law; Colonialism & Imperialism"
  }
]